{"text": "Name: maggie maggie"}
{"text": "E-Mail: maggie.maggie@gmail.com"}
{"text": "Address: Allahābād, India"}
{"text": "Github: https://github.com/maggie"}
{"text": "LinkedIn: https://linkedin.com/maggie"}
{"text": "Phone No. 569122363856"}
{"text": "Summary"}
{"text": "Having 8+ years of experience in all phases of Software Development Life Cycle (SDLC) which involves requirement gathering, requirement analysis, design, development, implementation & enhancement of projects inCRM andSalesForce.com and Java/J2EE technologies."}
{"text": "4+ Years as certified Salesforce Developer, Administrator and BSA."}
{"text": "Experience in Object Oriented Analysis / Design / Development / Testing and Implementation, Client/Server Architecture."}
{"text": "Cleared DEV 401 certifications."}
{"text": "Experience on implementing Apex classes, Visual Force Pages, Apex Components and Controllers, Triggers, and working with Force.com IDE."}
{"text": "Expert Level understanding of Salesforce.com CRM and its Development Life Cycle."}
{"text": "Experience in SFDC Configurations/Customizations - as Administrator and Developer."}
{"text": "Experience in developing User Interface, Page Layouts, Tabs, Custom fields, Custom objects, Validation Rules, Triggers, etc."}
{"text": "Experience on Salesforce CRM platform Worked on different environment of SFDC such as Sales and Service Clouds."}
{"text": "Used Scribe application to integrate business solutions to Salesforce.com and also configure and provide ease of modification as business processes change"}
{"text": "Good understanding in CRM business process such as Case Management. "}
{"text": "Good Understanding on Partner portal(Partner Relationship Management)"}
{"text": "Hands on experience on creating custom Objects and Tabs, designing Custom Fields, assigning Validation Rules and Field-Level Dependencies, Approval Processes. "}
{"text": "Expert knowledge of relational databases and data modeling."}
{"text": "Expertise at administrative tasks such as User management, creating Profiles, Roles and Permission Sets, Workflow, Tasks and Events, Email notification and templates, Reports and Dashboard."}
{"text": "Worked on Chatter implementation and customization using Chatter API."}
{"text": "Worked on Force.com sites and developed many Custom Application using force.com platform."}
{"text": "Used data migration tools such as Apex Data Loader, Salesforce Import and Export Wizard, and InformaticaCloud and have knowledge of integrating Legacy system with Salesforce. "}
{"text": "Have exposure in Customer Portal and Self -Service Portal."}
{"text": "Have good experience in Trigger, Test Methods, and writing SOQL and SOSL queries."}
{"text": "Have good understanding and knowledge of the functionality of Web Services for SOAP API. "}
{"text": "Have worked with project management tools such as Microsoft Project to create project plans, milestone, risk analysis, and responsibilities. "}
{"text": "Experience on translating business process into Custom Objects and creating Look-up relationships and Master-detail relationships. "}
{"text": "Developed business documents for Salesforce.com Custom objects."}
{"text": "Worked on Migration tools Force.com IDE, Eclipse and have knowledge of Changeset migration code and configuration from the Dev sandbox to Production. "}
{"text": "Ability to adapt to any environment such as working with small or large groups or independently and excellent communication skills."}
{"text": "Experience with technologies that work with Salesforce.com including: Java, Java Script, Force.com platform."}
{"text": "Proficiency in programming languages and database such a Java, .Net, Java script, HTML, J2EE."}
{"text": ""}
{"text": ""}
{"text": "Technical Skills"}
{"text": ""}
{"text": "SFDC Technology:Apex classes, controllers and extensions, Apex, Triggers, "}
{"text": "Visual Force Page, SOQL, SOSL.                           "}
{"text": "SFDC Tools:Apex Data Loader, InformaticaCloud, Connect offline, Connect "}
{"text": "Outlook, Force.com IDE (Eclipse), DupCatcher."}
{"text": "Languages:Apex ,Java, .Net, Php with MySQL database,."}
{"text": "Web\t\t\t:  HTML, CSS, JavaScript. "}
{"text": "Operating System: Windows XP, Windows Vista, and Window 7"}
{"text": ""}
{"text": "PCORI, Washington D.C    \t\t\t\t\t\t\tNov 2013 to Till Date"}
{"text": "Patient-Centered Outcomes Research Institute"}
{"text": "Role: Salesforce Developer / Admin"}
{"text": "PCORI find many healthcare options available to patients and those who care for them work best in particular circumstances. We do this by taking a particular approach to CER called Patient-Centered Outcomes Research, or PCOR, research that addresses the questions and concerns most relevant to patients, and we involve patients, caregivers, clinicians, and other healthcare stakeholders, along with researchers, throughout the process.PCORI helps people make informed healthcare decisions, and improves healthcare delivery and outcomes, by producing and promoting high-integrity, evidence-based information that comes from research guided by patients, caregivers, and the broader healthcare community."}
{"text": "Roles & Responsibilities:"}
{"text": "Worked with Business System Analyst to provided recommendation and designed the Best Solutions for implementing new business ideas."}
{"text": "Provided development, implementation, and updating focusing on Sales cloud and Service cloud. "}
{"text": "Worked on Salesforce.com Standard Objects such as Accounts, Contacts, Opportunities, Campaigns, Cases, solutions."}
{"text": "Created Page Layouts to organize fields, custom links, related lists, and other components on record pages."}
{"text": "Implemented various advanced fields like PicklistFields, Master-Detail Fields, Custom Formula Fields, and defined Field Dependencies for custom picklist fields."}
{"text": "Implemented Case Assignment Rules to direct the case to appropriate group such as Stories and PCS Central Support."}
{"text": "Defined objects and Field Level Security for different profiles."}
{"text": "Wrote an Apex Trigger on Contact for cross object field update for reporting purposes."}
{"text": "Enhanced Apex Class and Visual Force Page to create a custom Related List, showing activities for selected contacts or clients."}
{"text": "Performed other administrative tasks such as managing Accounts, Contacts and Cases, setting workflows and approval processfor approving new accounts and other business process."}
{"text": "Created and maintained Reports and Dashboards to provide fast access to key business metrics. "}
{"text": "Provided Case Management by Configuring Email-to-Case for end user to submit a case through Outlook."}
{"text": "Created and configured Email templates which were used by PCS Central users for approval processes and other field updates. "}
{"text": "Customized Salesforce.com User Profiles by setting Standard and Custom objectslayouts, Custom App, Field-level Security, Permission Sets for client services and marketing. "}
{"text": "Customized Chatter objects and tabs to view progress and discussionon business process."}
{"text": "Worked in different sandboxes for development and testing, and involved in migrating the code to production instance in installments using ChangeSet."}
{"text": "Configured Chatter to track emails from Outlook to Salesforce by following a user."}
{"text": "Worked with AppExchangeDupCatcher to filter and prevent duplicate records in the organization."}
{"text": "Responsible for weekly and monthly data export, updates, and backup for the organization."}
{"text": "UsedApex data loader to Inset, Update, and Importdata from Microsoft Excel into Salesforce.com."}
{"text": ""}
{"text": "Environment:SFDC, Apex, Data Loader, Force.com, Import Wizard, Eclipse IDE, Controllers, Visual Force Pages, XML, Triggers, API."}
{"text": "Paramount Pictures, LA\t\t\t\t\t\t\tMarch 2012 to Oct 2013"}
{"text": "Role: Salesforce Developer / Admin"}
{"text": "Led large Salesforce implementation for our Music Rights Clearance department saving significant cost and rework through better tracking and reporting techniques. Implemented global RFID tracking system for our high volume Set, Lighting, and Grip rental equipment business at all US warehouse locations, reducing cycle count times from days to minutes. Delivered a standardized method for viewing ad hoc reports on inventory, item location, and order status from mobile devices throughout our warehouse locations worldwide. Led upgrade and replacement of script submissions and tracking system (CAT) to include a mobile script management tool which allows account executives to view submission status and approvals from their mobile devices"}
{"text": "Roles & Responsibilities:"}
{"text": "Requirements gathering and doing configuration and customization according to business requirement."}
{"text": "Worked on preparing Technical Design Document."}
{"text": "Experience in administration, configuration, Implementation, and Support of Salesforce CRM, and Salesforce SFA applications based on Apex Language and leveraging Force.com Platform. "}
{"text": "Worked on agile Process."}
{"text": "Worked on creating Objects, Page Layouts, Record Types, Relationships, Validation Rules, Workflows and Approval Process."}
{"text": "Responsible for weekly and monthly data export, updates, and backup for the organization."}
{"text": "Used Apex data loader, import wizard to Inset, Update, and Import data from Microsoft Excel into Salesforce.com."}
{"text": "Creating Report Types, Reports and Dashboards."}
{"text": "Creating Public Groups, Queues, Permission Sets, Profiles, Users and Security Settings based on role hierarchy."}
{"text": "Worked on writing Apex Triggers and Apex Classes, Batch Apex, Scheduled Apex."}
{"text": "Experienced in the designing UI using Visual force Pages."}
{"text": "Migrating Meta data from one sandbox to another sandbox using Force.com IDE tool, Change Sets and Eclipse."}
{"text": "Writing the Test Scripts for various scenarios."}
{"text": "Involved in Salesforce.com Application support activities and customizing the apps to match the functional needs of the organization."}
{"text": "Performed other administrative tasks such as managing Accounts, Contacts and Cases, setting workflows and approval processfor approving new accounts and other business process."}
{"text": "Created and maintained Reports and Dashboards to provide fast access to key business metrics."}
{"text": "Provided Case Management by Configuring Email-to-Case for end user to submit a case through Outlook."}
{"text": ""}
{"text": "Environment:SFDC, Apex, Data Loader, Force.com, Import Wizard, Eclipse IDE, Controllers, Visual Force Pages, XML, Triggers, API."}
{"text": ""}
{"text": "New Market, Boston, MA\t\t\t\t\t\tJan 2011- Feb 2012"}
{"text": "Role: Salesforce Developer / Admin"}
{"text": "Pharmaceuticals are a global specialty biopharmaceutical company that is the manufacturer of pharmaceuticals. New Market develops and provides healthcare in the areas of behavioral health, gastrointestinal conditions, rare diseases, and regenerative medicine.\n\nResponsibilities:"}
{"text": "Interacted with users to understand complex business requirements and documented the requirements."}
{"text": "Experienced in designing, developing and data modeling of the application and ensured that they are within the Salesforce governor limits."}
{"text": "Created productive documents which will be used by rest of the team to have better understanding of the related system; Salesforce.com CRM."}
{"text": "Created custom objects, custom Fields, Validation Rules, and formula fields."}
{"text": "Created Visualforce pages, Apex Triggers, Apex Classes, Test Methods and Workflows."}
{"text": "Developed SOQL query to pull data from salesforce.com instance to Right90 application. The process is set to run by default every 20 min and pull information that is changed since last successful sync run."}
{"text": "Deploy using Force.com IDE tool, Change sets and Eclipse for sandbox to production environments."}
{"text": "Developed scripts to load forecast data from salesforce.com."}
{"text": "Created technical design document and functional design documents as per business requirement."}
{"text": "Developed integrations to integrate data from Salesforce.com using SFDC APIs."}
{"text": "Created Page Layouts to organize fields, custom links, related lists, and other components on record pages."}
{"text": "Implemented various advanced fields like PicklistFields, Master-Detail Fields, Custom Formula Fields, and defined Field Dependencies for custom picklist fields."}
{"text": "Implemented Case Assignment Rules to direct the case to appropriate group such as Stories and PCS Central Support."}
{"text": "Wrote CaseEscalation Rules to escalate cases depending on the time frame and difficulty of the case issues"}
{"text": "Environment:SFDC, Apex, Data Loader, Force.com, Import Wizard, Eclipse IDE, Controllers, Visual Force Pages, XML, Triggers, API."}
{"text": ""}
{"text": "AT&T, INDIA   \t\t\t\t\t\t\t\tDec 2008 – Aug 2010"}
{"text": "Role : Java Developer"}
{"text": "Designed a spend management system which gives complete visibility of spend related operations, leading to smarter, data-driven business decisions. It is used to track spend vs. budget, work quality, hot skill sets, supplier performance, complex cost accounting, and more."}
{"text": "Responsibilities:"}
{"text": "Involved in analysis and design of the application architecture based on MVC Architecture, used open source Struts framework and Database with new field updates added to the legacy system."}
{"text": "Expertise in .Net Technologies using IIS in the areas of performance, security, scalability, and extensibility "}
{"text": "Wrote and customized several java programs for the spend management system at SBI to streamline the process of procurement."}
{"text": "Experience in using AJAX framework for quickly creating efficient and interactive Web applications that work across all popular browsers"}
{"text": "Developing within the ASP.NET framework "}
{"text": "Involved in Application development with IDE Tool Eclipse and web server Tomcat."}
{"text": "Designed and developed User Interfaces, Menus using HTML, DHTML, JSP, Java Script, client side and server side validations."}
{"text": "Used PL/SQL, Stored Procedures and table level and system level triggers for handling database processing and for generating analysis reports."}
{"text": "Involved in Module and Unit Level Testing with JUnit, Participated in database tuning."}
{"text": ""}
{"text": ""}
{"text": "Environment :Java/J2EE,J2SE,Struts 1.1, XML, DOM, SOAP, Eclipse, SVN, Weblogic 8.1, Tomcat, Oracle 9i, PL/SQL, Ant, JUnit, UNIX."}
{"text": ""}
{"text": "Teradata Corporation, Hyderabad , India\t\t\t\tOct2006– July 2008"}
{"text": "Position/ Title: Java Developer                                                               "}
{"text": "Teradata Business Intelligence Optimizer"}
{"text": "Teradata Aggregate Designer provides a simplified method to recommend and design Aggregate Join Indexes (AJIs) to support Teradata Relational Online Analysis Process (ROLAP), providing optimal integration between business intelligence (BI) tools and Teradata Database. Teradata Aggregate Designer, which belongs to the Teradata Business Intelligence Optimizer (Teradata BIO) suite. Teradata BIO is a Teradata Tools and Utilities product. Teradata Tools and Utilities are a group of products designed to work with Teradata Database."}
{"text": ""}
{"text": "Duties and Responsibilities:"}
{"text": "Analyzed the business requirement and developed app using Java and Mozilla XUL."}
{"text": "Involved in development using Spring , Hibernate and JSF Framework. Used ANT script for project deployment."}
{"text": "Use case, design – class, sequence diagrams. User Interface design"}
{"text": "Data Modeling – logical and physical models"}
{"text": "Requirements gathering- Proto-typing, Walk-through to business groups and gap analysis"}
{"text": "Understand the business aspect of the application and converted into requirements document. "}
{"text": "Create POC for first time patterns and vendor integrations."}
{"text": "Code review with the developers and delivery team"}
{"text": "Co-Ordinate and manage Global Delivery teams at offshore locations."}
{"text": "Schedule and organize weekly or daily stand up meeting with the whole development teams both onshore and offshore."}
{"text": "Create Unit Test Documents as part of code deliverables"}
{"text": "Participate and represent the Integration team in defect triage meeting with channel partners and provider systems"}
{"text": "Business process review and modeling"}
{"text": "Data modeling and ER diagrams"}
{"text": "Develop Functional Requirements Specification (FRS)"}
{"text": "Business process review and modeling"}
{"text": "Involved in writing SQL queries for the application in Teradata database."}
{"text": "Create or involve in Implementation planning with Project Manager."}
{"text": "Support Production install and validations."}
{"text": ""}
{"text": "Environment/Technology Stack:   Java, J2ee, Spring, Hibernate, JSF, Teradata, JPA, JAX-WS, JAX-RS, JQuery, CSS."}