{"text": "Name: marie marie"}
{"text": "E-Mail: marie.marie@gmail.com"}
{"text": "Address: Nangandao, China"}
{"text": "Github: https://github.com/marie"}
{"text": "LinkedIn: https://linkedin.com/marie"}
{"text": "Phone No. 291922752511"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "EXPERIENCE SUMMARY:\t "}
{"text": "An accomplished, self-driven, target oriented  IT professional with with over 7+ years experience in Software Development, Business Analysis, Designing, Implementation and System Analysis which  includes 4+ years of extensive experience as Salesforce Business Analyst/Administrator. "}
{"text": "Expertise at all phases of Software Development Life Cycle (SDLC) and Software Test Life Cycle (STLC) involving requirements gathering, analysis, functional design, testing and implementation in Salesforce.com "}
{"text": "Excellent knowledge in administrative and development related tasks like creating Profiles, Roles, Users, Tasks and designing various Validation Rules, Custom Objects and Fields, Page Layouts, Reports, customized Dashboard for detailed analysis, Automated Email Generation, Field updates for Workflows and Approval Processes, sharing rules for business and Escalation Rules for better Customer Service and business improvement. "}
{"text": "Well versed with CRM processes like Account Management, Case Management, Contact Management, Campaign Management, Lead Management and other processes. "}
{"text": "Efficient at data migration techniques using Data Import Wizard, Mass Delete, Data Export Wizard and Apex Data Loader using CSV templates."}
{"text": "Have also implemented various object relationships using Master-detail, Many to many and Lookup Relationship "}
{"text": "Used SAP system input feeds to capture web-based information to create Web-to-Lead and Web-to-Case. "}
{"text": "Experience in working with numerous database platforms like Oracle, MySQL, SQL Server and MS Access."}
{"text": "Experience in setting up Partner Portal to increase channel sales. This was more focused on Salesforce automation to improve lead conversion rate. "}
{"text": "Created multiple Business Requirements Documents (BRD), Functional Requirement Documents (FRD), System Requirements Specifications and Non-Functional Requirements Documents along with Project Scope Document."}
{"text": "Used Joint Application Design (JAD) sessions for effective requirement gathering."}
{"text": "Experienced at creating and analyzing UML diagrams such as Use Cases, Sequence Diagrams, Class Diagrams, Activity Diagrams, Data Flow diagrams and Entity-Relationship (ER) Diagram. "}
{"text": "Implemented SDLC methodologies such as Waterfall, RUP and Agile (Scrum). "}
{"text": "Hands on experience in working with Testing teams to perform User Acceptance Testing (UAT), creating and executing UAT test cases, developing test data and test plans. "}
{"text": "Developed skills to organize meetings with user groups. Conduct End User Training and create training manuals and help documents. "}
{"text": "With experience on various types of projects such as Enhancement to existing systems, New Business ventures and Organization Re-structuring projects. "}
{"text": "With excellent communication skills in organizing presentations for C-Level employees, meetings and requirements gathering from valuable stakeholders of the organization. "}
{"text": "Strong knowledge of Project Management skills such as time estimation, task identification and scope management.  "}
{"text": "With additional knowledge on java classes and programming allowing better understanding towards technical project development. "}
{"text": ""}
{"text": "EDUCATION & CERTIFICATIONS :\t "}
{"text": "Bachelor of Computer Science and engineering- Jawaharlal Nehuru Technological University, India  "}
{"text": "Salesforce Certified Administrator (ADM 201)."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "TECHNICAL SKILLS:\t "}
{"text": " "}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:\t "}
{"text": ""}
{"text": "Oakley, Inc.\t\t\t\t\t\t\t\tJan 2015 to Present"}
{"text": "Foothill Ranch, CA"}
{"text": "Salesforce Business Analyst /Administrator"}
{"text": ""}
{"text": "Oakley is a manufacturer of sports equipment and fashion accessories. It has implemented Sales Cloud to improve business and retail market. With projects involving implementation and support of a Salesforce tool as a CRM application to be utilized by Sales representatives for Customer Management and Order Management. "}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Worked in multi-functional environment holding multiple roles as Salesforce Business Analyst / Administrator in the Project. "}
{"text": "Met with Business stakeholders for detailed requirements gathering and conducted interviews, meetings to collect functional and non functional requirements relating to client’s Salesforce CRM platform enhancement and initiatives."}
{"text": "Designed and developed Project Scope Document, Project Plans, Project analysis and Project Deliverables, Business Requirements Document. "}
{"text": "Prepared As-Is and To-Be scenarios for various applications and documented them for future references. "}
{"text": "Worked with Salesforce team on regular basis to discuss and document various Business needs, requirements, development of the application and to discuss and resolve any issues, changes or problems during various phases of SDLC."}
{"text": "Conducted several checks on the data flow into Salesforce.com application with the help of SQL Queries to develop test data. "}
{"text": "Acted as a Salesforce Administrator for Salesforce application to set up and edit various profiles and roles, to grant access rights, generate reports, and accommodate various user requests for field updates, dashboards, reports, access rights, etc. "}
{"text": "Modified fields and record types in various Salesforce.com standard objects like Accounts, Contact, Campaign, and Lead; along with building custom objects for internal purposes such as Recruiting with Job Application, Interview Processing and HR Management."}
{"text": "Worked with various teams, Stakeholders, Committees and other users to get the Business Requirements document approved and signed off. "}
{"text": " Created Email Templates for internal use, external use for inbound and outbound emails using Visual force, HTML with Visual Force and other formats as per the internal requirements."}
{"text": "Designed and developed Validation Rules, custom Page Layouts and fields necessary for supporting the application with automatic reminder settings and dashboard overview and reports. "}
{"text": "Modified existing Workflow Time Triggers for better customer service enhancements and follow up emails with the customers. "}
{"text": "Introduced various validation rules and custom formulas for data cleanliness and incorporated reports and dashboards for data accuracy and better understanding of metrics. "}
{"text": "Designed and developed test scenarios to be used during product testing and User Acceptance testing with test plans, test cases, test data and also conducted UAT end user training by creating training manuals. "}
{"text": ""}
{"text": "Environment: Salesforce.com platform (Apex, Visual Force, Data Loader, Workflow and Approvals, Quotes, Role Hierarchies, Sharing Rules, Email Templates, Reports, Dashboards, Custom Objects, Custom Tabs, Email Services, Excel enabler for Salesforce), QlikView, MS Project, MS Excel, PowerPoint, MS Visio, MS SharePoint, Remedy, Lotus Notes, MS Outlook, Foxit, Microsoft SQL, Token Office Communication, Bugzilla, Jira. "}
{"text": ""}
{"text": ""}
{"text": "NYU Langone Medical Center\t\t\t\t \t          \t\t          Mar 2014 to Dec 2014"}
{"text": "New York, NY"}
{"text": "Salesforce Business Analyst/Admin"}
{"text": ""}
{"text": "NYU Langone Medical Center is a health care provider, which has acquired multiple companies. The projects involved data merger projects and Sales cloud was used to centralize the Patient information to a central system as to track customer activity such as customer calls, customer visits and also allowing to generated various custom reports. "}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Held responsibilities of Business Analyst and Administrator in the Project. "}
{"text": "Worked with numerous business teams for requirement gathering and data collection to implement the business on Salesforce platform by customizing the objects to meet the functional needs of the organization. "}
{"text": "Updated Business Requirement Documents and Conducted GAP analysis. "}
{"text": "Involved in gathering information through interviewing, questionnaires, observations and interactions with various stakeholders and involved teams. "}
{"text": "Prepared project proposals, project schedules, costing, UAT and pertinent documents for the project such as Business Requirement Document, Project Scope Document, System’s Functional and Technical Specifications, release notes, user guides and support guides. "}
{"text": "Interacted with Clients on regular basis during scoping, development and implementation to ensure solution met the requirements. "}
{"text": "Custom built Salesforce application with point click systems and visual force pages. "}
{"text": "Designed and developed Custom Objects, Custom Fields and Tabs, Custom Page Layouts, Entity Relationship Data Model, Components, Custom Links and Custom Buttons. "}
{"text": "Created a Call Center application specific to the company in order to enhance the customer support response time and case handling features. "}
{"text": "Created multiple reports including Matrix Reports, Dashboards, Pie Charts, graphs, Summary Reports and also organized different reports specific to the role and user profiles. "}
{"text": "Created custom Dashboards, Ad Hoc reports to analyze the data using Salesforce and QlikView BI tools. "}
{"text": "Customized standard objects to organization needs by adding necessary Custom Fields, Custom Buttons, validation rules, redesigning the page layout and components for the objects such as Accounts, Contacts, Leads, Campaigns, Reports and Opportunities."}
{"text": "Designed dashboard to track various metrics such as productivity, performance, effectiveness, sales and other daily numbers. "}
{"text": "Worked on HIPPA patient laws to perform information security. "}
{"text": "Experienced Data Loader user with knowledge on complex and large CSV files for faster data integration to the Salesforce data. "}
{"text": "Implemented Web to Lead and Web to Case techniques for enhanced and faster response and faster case assignment to available customer support representative. "}
{"text": "Introduced queues and other customer supporting techniques using Salesforce to provide premium support for sales and customer complaints. "}
{"text": "Participated in team meetings and training sessions to actively co ordinate ideas and improvisations to be made to the business functionality. "}
{"text": "With involvement in Quality Assurance and testing teams to perform User Acceptance Testing as per the BRD guidelines. "}
{"text": ""}
{"text": "Environment: Salesforce.com CRM Application Platform (HTML, JavaScript, Custom Objects, Tabs, Workflow, Approval Processes, Email, Messaging, Dashboard, Reports, Data Loader), MS Project, MS Excel, MS Visio, MS Outlook, MS Office, Visual Basic, UML, MS SQL Server, SQL Server, Visual Force Safe. "}
{"text": ""}
{"text": ""}
{"text": "Assurant, Inc.\t\t\t\t\t\t\t          \t\t          Jan 2013 to Mar 2014"}
{"text": "New York, NY"}
{"text": "Salesforce Administrator"}
{"text": ""}
{"text": "\tAssurant, Inc. is a health insurance company with projects in Health Sector, Employee benefits and other insurance products. The projects mainly involved migrating data from legacy system on to Salesforce cloud. Along with Salesforce platform being used to maintain claim processing and management. "}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Interacted with various business groups for gathering the requirements for Salesforce.com CRM implementation "}
{"text": "Involved Salesforce setup activities and customized the apps to match the functional needs of the organization"}
{"text": "Worked with the Salesforce.com Application implementation team and customized the existing legacy system apps to match the functional and business needs of the organization"}
{"text": "Participated in various business meetings with various members of the facility to gather the functional needs such as Business logic, Role hierarchy, profile and user structure "}
{"text": "Experienced security professional with knowledge on Security settings and Role/Profile configuration specific to project and business"}
{"text": "Introduced queue techniques to control the newly created cases and auto assignment of the cases to the associate as per the skill set. "}
{"text": "Configured various reports for different users based on role and profile of the employee. "}
{"text": "Designed and deployed pick lists, dependent pick lists specific to state and also created lookups, master detail relationships along with validation rules and formula fields to customize the application. "}
{"text": "Including creation of Lookup and Master-detail relationships on custom objects with building Junction Objects for Many-to-Many relationships.  "}
{"text": "Designed various Web Pages in Visual Force for capturing various customer enquiries and implemented logic for migrating cases to different queues based on the type of customer enquiry."}
{"text": "Used Data Loader for insert, update and bulk import or export of data from Salesforce.com subjects. Also used it to read, extract and load data from comma separated values (.CSV) files."}
{"text": "Involved in implementing Salesforce One Application specific to the business with Custom Objects and other features used for basic functioning of the organization."}
{"text": "Implemented new lead follow up methods to provide better response time and business improvement."}
{"text": "Created test scenarios on Sandbox environment and used Force.com component deployment wizard for migrating data between Force.com IDE and Sandbox Environment. "}
{"text": "Performed Functional, API Testing, Data Driven Testing, Staging Website Integration and Environment Validation testing. Also with testing on Mobile/Tablet devices apps. "}
{"text": ""}
{"text": "Environment: Salesforce.com CRM Application Platform, Apex Language, Visual Force, Custom Objects, Tabs, Page Layouts, SOQL, SOSL, Workflows, Approval Processes, Email, Messaging, Dashboards, Reports, Force.com IDE, Visual Studio.EDI, Quality Center, Intercall, SharePoint Portal. "}
{"text": ""}
{"text": ""}
{"text": "Golfsmith International Holding, Inc.\t\t\t    \t\tMay 2011 to December 2012"}
{"text": "Austin, TX"}
{"text": "Business Systems Analyst (SalesForce.com)"}
{"text": ""}
{"text": "Golfsmith International is a golf products manufacturer with multiple retail stores across the United States. The projects involving creation of POS system for retail store management and Salesforce CRM was implemented for sales Automation and Customer contact management. "}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "With involvement in requirements gathering through Interactions, Interviews, Observations and Team meetings with the Project Manager, Clients and System Architect. "}
{"text": "Worked with various stakeholders as to design the Planning Breakdown Structure (PBS) and Work Breakdown Structure (WBS) for the project. "}
{"text": "Designed effective ways to manage the Schedule by setting Milestones, Gantt chart and setting the Critical Path of the project. "}
{"text": "Conducted thorough review of the risks, assumptions and constraints of the project with System Architect and Project Manager. "}
{"text": "Delegated tasks and schedules to programmers, database administrators, QA team and technical support. "}
{"text": "Implemented Salesforce application as per the business requirements. "}
{"text": "Created Users, Roles, Public Groups and implemented sharing rules to provide appropriate access to data. "}
{"text": "Implemented case management process and configured the Case and Solution objects as per the current business needs. "}
{"text": "Introduced Web-to-Case and Web-to-Lead techniques to capture data from the online web portal of the company. "}
{"text": "Customized the current page layout and added multiple necessary custom fields for the business. "}
{"text": "Created Summary Reports, Matrix reports and also designed Dashboards as to meet managerial standpoint of data visualization. "}
{"text": "Developed Workflow rules, tasks, email alerts, automatic field update’s, follow-up emails to track Leads, Accounts and Cases. "}
{"text": "Imported data from Excel sheets, CSV files to Leads, Accounts, Cases, Candidates, Contacts and Projects from Legacy System using Data Loader and Import Wizard. "}
{"text": "Designed various test cases and documented UAT testing. Developed test reports from UAT and Bugs Reports for documentation."}
{"text": "Documented Integration Testing, System Testing and Unit Testing for better understanding and high-level preview of the progress of the project."}
{"text": "Support planning for User Acceptance Testing (UAT), including design of UAT training manual and conducting training sessions. "}
{"text": "Administered and coordinated transactions processing between stakeholders such as Management, Staff, Vendors and End users. "}
{"text": ""}
{"text": "Environment: Salesforce.com (Data Loader, Import Wizard, Custom Objects, Custom Fields, Workflow and Approvals, Custom Tabs, Reports, Dashboards, Page Layouts), MS Project, MS Excel, MS Visio, MS Outlook, SharePoint, UML, SQL Server, Bugzilla, Excel enabler for Salesforce. "}
{"text": ""}
{"text": ""}
{"text": "IIC Systems\t\t\t\t\t\t\t          \tJune 2008 to April 2011"}
{"text": "Hyderabad, India"}
{"text": "Business Analyst"}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Worked on Projects from initiation to closing involving Project Charter document design, Managerial approvals, Project Scope document design, Business Requirement gathering from Business Team as well from Technical Team. "}
{"text": "Created project proposals, project schedules and other important documents such as contracts and status reports for client and internal utilization. "}
{"text": "Performed as a Point of contact for various stakeholders involving various teams and arranged requirement collection meetings, documentation session and project follow up meetings. "}
{"text": "Designed various Requirement gathering templates, conducted interviews, surveys, questionnaires as to collect project requirements in an effective manner. "}
{"text": "Prepared Database specifications, Software functional and technical specifications along with user and technical manuals and testing and implementation plans. "}
{"text": "Conducted JAD (Joint Application Discussion) Session as to avoid scheduling delays being caused due to unavailability of stakeholders. "}
{"text": " Worked closely with Quality Assurance Team as to conduct various testing involving UAT (User Acceptance Testing), Unit Testing, and White Box Testing. "}
{"text": "Involved in various phases of Software Development Life Cycle such as Planning, Analysis, Design, Testing and Maintenance. "}
{"text": "Organized various meetings with different levels of stakeholders to communicate the project scope document and to make sure that it was clearly understood and agreed upon mutually. "}
{"text": "Used a mixture of Waterfall Method and Agile Scrum Methodology to develop the application. "}
{"text": ""}
{"text": "Environment: VB, MS Access, MS Excel, Ms Word, SQL Server, Oracle, MS InfoPath, MS Project, MS Visio, Adobe Photoshop and Acrobat"}
{"text": ""}