{"text": "Name: clara clara"}
{"text": "E-Mail: clara.clara@gmail.com"}
{"text": "Address: Tai’an, China"}
{"text": "Github: https://github.com/clara"}
{"text": "LinkedIn: https://linkedin.com/clara"}
{"text": "Phone No. 640715851714"}
{"text": "                                                                   "}
{"text": ""}
{"text": "PROFESSIONAL SUMMARY:"}
{"text": "Over 6 Years of IT experience as a Java UI Developer in analysis, design, development and testing of web applications."}
{"text": "Proficient in developing and designing the phases of Software development Life Cycle."}
{"text": "Proficient in building Web User Interface (UI) using HTML5, DHTML, tableless XHTML, CSS3 and JavaScript that follows W3C Web Standards and are browser compatible."}
{"text": "Experience on Web Technologies using HTML4/5, CSS2/CSS3, XHTML, DHTML, JavaScript, JQuery, AJAX, XML and JSON."}
{"text": "Extensive experience as web developer with a strong background working on open source technologies, including JSP, PHP, HTML, CSS, MySQL, JavaScript, Flash, Photoshop."}
{"text": "Expertise in working with the JavaScript, prototype JS and various MVC JavaScript frameworks backbone.js and node.js."}
{"text": "Expertise skills in Java Script, AJAX, CSS, HTML5, JQuery, Node.JS, Require.JS, Angular.JS, Backbone.js, Spring MVC, Hibernate and XML related technologies."}
{"text": "Experience in working with Ghostwrite.js (Script Management Framework) to download the Display ads in the site."}
{"text": "Experience in developing web based applications using Google Web Toolkit (GWT) and J2EE Servlet technology."}
{"text": "Extensive experience in creating style guides, best practices and setting UI standards for enterprise/consumer applications."}
{"text": "Professional in creating Templates, Mockups and Prototypes, Web Interfaces, Layouts and Flow of Future Pages."}
{"text": "High level of expertise in CSS pixel-level layout, Consistency with browsers, Version and Platform Independence."}
{"text": "Good experience working on CSS Background, CSS Positioning, CSS Text, CSS Border, CSS Margin, CSS Padding, CSS Table, Pseudo Classes, Pseudo Elements and CSS Behaviors in CSS."}
{"text": "Proficient with creating Logos, Banners, Buttons, Icons and Images using Adobe Flash and Adobe Illustrator."}
{"text": "Excellent experience in Restful Web services and Big Web service development and consumption using (JAX-RS and JAX-WS)."}
{"text": "Experience working with testing tools like Firebug, Firebug Lite, Chrome or safari web inspectors and IE Developer Toolbar. "}
{"text": "Sound knowledge in SEO, making the websites SEO Friendly and ranking in search engines."}
{"text": "Extensive experiences in UI Development, Web UI analysis, Web design, coding, testing, implementation and Support working with various projects."}
{"text": "Expertise in using application servers such as WebLogic, WebSphere, Jboss and Apache Tomcat."}
{"text": "Experienced in Databases like Oracle 11g/10g/9i and SQL Server and writing SQL Queries, Stored Procedures."}
{"text": "Experience in software configuration management using Rational ClearCase, CVS, SVN and PVCS."}
{"text": "Experience with Browser testing, knowledge of cross-browser/cross-platform compatibility."}
{"text": "Strong communication, collaboration & team building skills with proficiency in grasping new technical concepts quickly."}
{"text": "Self-starter always inclined to learn new technologies and Team Player with very good communication, organizational and interpersonal skills."}
{"text": ""}
{"text": "TECHNICAL SKILLS:"}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": "Client: Nordstrom - Apparel, Seattle, WA.                                                                                                             Mar 13 – Till Date            "}
{"text": "Since 1901, Nordstrom has offered a wide variety of quality apparel, shoes and accessories for men, women and children at our stores across the country. Nordstrom enlisted Fortune magazine's list of '100 best Companies to Work For."}
{"text": "Role: Sr. Web/UI Developer"}
{"text": "Responsibilities:"}
{"text": "Actively participated in life cycle development (SDLC) from implementation phase to testing and deployment."}
{"text": "Rapidly prepared and implemented product specifications, including designing and creating wire frames to visually facilitate understanding of user interactions in features and concepts."}
{"text": "Designed and developed User Interface using JSP, CSS, HTML and JavaScript. Used JavaScript DOM manipulation and JavaScript event to generate the data result in UI. "}
{"text": "Developed e-mail modules using JavaScript, and hand coding of HTML, XHTML, and CSS."}
{"text": "Developed complex, useable, attractive and cross-browser web interfaces that account for speed, file size, readability and accessibility."}
{"text": "Translated wireframes into optimized program code using HTML, CSS, and JavaScript."}
{"text": "Implemented user interface designs from UI specifications and product requirements."}
{"text": "Designed Frontend with in object oriented JavaScript Framework like Angular.JS and Ext.JS."}
{"text": "Developed Perl programs for different features like sending feedback mails."}
{"text": "Developed programs to port the xml data to database to make the website xml driven."}
{"text": "Created Master Pages, CSS Styles Sheets and got approval from Business Stake holders."}
{"text": "Used the Node.js and backbone.js MVC Frameworks in the development of the web applications."}
{"text": "Designed the email blasts using Adobe software and then implemented them using HTML and Java script."}
{"text": "Created HTML navigation menu that is role based menu items changes dynamically, derived from the database in the form of XML."}
{"text": "Successfully implemented Auto Complete/Auto Suggest functionality using Ajax, JQuery, DHTML, Web Service call."}
{"text": "Involved in implementation and up-gradation to latest versions of JQuery."}
{"text": "Discussed various ideas/suggestions for the ongoing web sites regarding the page layout and creative design."}
{"text": "Involved in Finding out the bugs, broken links and missing images etc. and rectifying them."}
{"text": "Involved in Planning, Motivation and training the team members in the technical and functional parts."}
{"text": "Involved in analysis for Workflow creation, template and Application-security policy."}
{"text": "Monitored team members to follow standards, guide lines and use new tools."}
{"text": ""}
{"text": "Environment: Java, HTML5, CSS3, JavaScript, Node.JS, Backbone.JS, Angular.JS, DHTML, XHTML, JQuery, Ajax, Eclipse 3.6.2, WebLogic, Oracle 11g, SQL Plus, PL/SQL Developer, Junit, Agile and JIRA, Backbone."}
{"text": ""}
{"text": "Client: National Oilwell Varco - Houston, TX.                                                                                                          May 12 – Feb 13"}
{"text": "National Oilwell Varco is a major supplier of mechanical products and services for energy drilling companies, The scope of this project was to re-enhance NOV.com(Public) and MyNOV.com(which is accessible only for their secured users)."}
{"text": "Role: Java UI Developer"}
{"text": "Responsibilities: "}
{"text": "Involved in the process of Design, Coding and Testing phases of the soft ware development cycle."}
{"text": "Developed front end screens to be cross-browse & cross-platform based application while using XML, XHTML, CSS, JavaScript/JSON, DOM and AJAX."}
{"text": "Designed and Developed Java Script frame work which is wrapper on top of JQUERY frame work and AJAX based UI frame work for UI Configuration widgets."}
{"text": "Developed application using Ajax, OO Java Script, JSP, JQuery, HTML and CSS."}
{"text": "Developed different JQUERY component in MVC micro architecture framework which internally use various design pattern such as singleton, command, delegate, etc."}
{"text": "Implemented and tested the enterprise application with jQuery, Angular.JS and Spring MVC."}
{"text": "Designed and developed pagination and dynamic table update plugins using jQuery."}
{"text": "Redesigned the entire site with CSS styles for consistent look and feel across all browsers and all pages."}
{"text": "Worked on integrating JQuery APIs with MVC pattern. "}
{"text": "Used EXT JS for building rich internet applications, Node.JS, Backbone.JS & Require.JS to optimize in-browser use and to load the module and to improve the Speed."}
{"text": "Developed a functionally rich User Interface like using JavaScript and CSS framework."}
{"text": "Used AJAX frameworks like JQuery, JSON to develop rich GUIs and also involved in performance tuning the website."}
{"text": "Improved outgoing quality through test and yield improvements and characterization. Also reduced costs through test time improvements."}
{"text": "Worked on visual design and the JQUERY controls needed to construct a front-end GUI application."}
{"text": "Developed client-side AJAX application that uses XSLT, XPath, JavaScript OOP, and more Bind objects and retrieve them via JNDI interface."}
{"text": "Developed web services, SOAP message envelopes and headers using WSDL, UDDI, XML and JAXP.  "}
{"text": "Co-ordinate with QA for testing, Production releases, Application deployment and integration."}
{"text": "Involved in Production Support and minor enhancements as per application requirements."}
{"text": ""}
{"text": "Environment: Java, OO JavaScript, HTML5,  CSS3, SOAP, Junit, JSTL,  Angular.JS , Backbone.js, Node.js, JQuery,  Flash, AJAX, XML, Rational Application Developer (RAD), WebSphere, ANT, SQL, IDE - Eclipse, Source Control –SVN, Oracle 11g and UNIX."}
{"text": ""}
{"text": "Client: Kronos World Wide, Cranbury, NJ.        \t\t\t                                                                       Mar 11 – Apr 12"}
{"text": "Kronos Worldwide, Inc. (Kronos) is a producer and marketer of titanium dioxide pigments (TiO2). The Company, along with its distributors and agents, sells and provides technical services for its products to over 4,000 customers in approximately 100 countries, with the majority of sales in Europe and North America. TiO2 is a white inorganic pigment used in a range of products, such as coatings, plastics and paper, as well as specialty products."}
{"text": "Role: Web/UI Developer"}
{"text": "Responsibilities:"}
{"text": "Analyzed business requirements, participated in technical design, development and testing of various modules assigned."}
{"text": "Involved in developing the UI pages using HTML, DHTML, CSS, JavaScript, JSON, JQuery and Ajax."}
{"text": "Implemented the web-based application using struts Framework."}
{"text": "Used JavaScript for adding little functionality to the existing application (calendar, tooltips, hiding elements, etc.)."}
{"text": "Developed JSP for the multiple views in the presentation layer and Java Beans for model layer."}
{"text": "Worked one-on-one with client to develop layout, color scheme for his website and implemented it into a final interface design with the HTML/CSS & JavaScript using Dreamweaver CS3. "}
{"text": "Used JSTL and wrote custom JSP tag libraries and implemented role based handling in JSP pages. "}
{"text": "Used JQuery core library functions for the logical implementation part at client side for all the application."}
{"text": "Used Ajax for populating the list/drop down box with data."}
{"text": "Wrote Hibernate configuration file, Hibernate mapping files and defined persistence classes.  "}
{"text": "Worked on SRS and process flow documents."}
{"text": "Interacted with the Graphics design team in the use of Photoshop CS3, MS Visio, PowerPoint, Dreamweaver and Flash."}
{"text": "Updated defects in Quality center and fixing the defects assigned."}
{"text": "Involved in Developed test cases/scenarios, manual testing of the application."}
{"text": ""}
{"text": "Environment: HTML, DOM, DHTML, XHTML, CSS, JavaScript, JQuery, Adobe Dreamweaver CS3 and Web Services."}
{"text": ""}
{"text": "Client: Parker Drilling, Houston, TX.                                                                                                                           Nov 09 – Feb 11\t"}
{"text": "Parker Drilling provides drilling services both offshore and onshore, the web application developed for Parker allows their technical users to look at the Drilling Data of live feed."}
{"text": "Role: UI Developer"}
{"text": "Responsibilities:"}
{"text": "Developed presentation-tier JSP pages in HTML, Implemented jQuery DataGrid control, Validation control and other Widget controls."}
{"text": "Developed Web forms/user interfaces using Struts MVC, jQuery and JSP."}
{"text": "Used Ajax Controls, Web forms, JavaScript and HTML for Commission, Payment and Inventory reports. "}
{"text": "Worked on AJAX controls like Update Panel to manage the post back of the web page to server, AJAX Script Manager and Script Manager Proxy controls to register JavaScript and web service files. "}
{"text": "Used JavaScript accordingly for validation purpose, browser detection and controls. "}
{"text": "Developed various AJAX controls and widgets to build a rich User Interface for the application."}
{"text": "Created Windows services to create automation processing of XML."}
{"text": "Used Cascading Style Sheets (CSS) to maintain design consistency across all web forms."}
{"text": "Involved in developing jQuery and AJAX wrapper classes for fast retrieval of data and for animations."}
{"text": "Created Model objects using Entity Data Model with Entity framework using Hibernate."}
{"text": "Worked with XPath, XML Node, XML Data documents to synchronize with dataset."}
{"text": ""}
{"text": "Environment: JavaScript, CSS, HTML, jQuery, XML, XPath, AJAX, JSP, Struts, Servlet, MVC, Junit, Oracle, Windows."}
{"text": ""}
{"text": "Company: Bloom Soft technologies, India.\t\t\t\t\t\t                             Apr 08 – Oct 09"}
{"text": "Bloom Soft is a rapidly growing software development and consulting company offering a broad range of software expertise and services with a strong customer focus."}
{"text": "Role: UI Developer"}
{"text": "Responsibilities:"}
{"text": "Interacted with the clients to get site-specific requirements and perform analysis and design for client specific requirements. "}
{"text": "Designed and developed Payment and collection module and delivered successfully with technologies like Web Service, spring, JPA. "}
{"text": "Designed and developed prepaid billing server communication and services with java sockets. "}
{"text": "Designed and developed EJB APIs for Subscriber functionalities Provisioning, Activation, suspend, cancelation using EJB 3. "}
{"text": "Designed and developed UI and backend functionality in JSF, Rich faces, JBoss Seam and JPA, EJB3. "}
{"text": "Debugged and fixed existed version EJB, hibernate issues. "}
{"text": "Developed various web services server API's save plan phase data with axis frame work. "}
{"text": "Developed multi-threading plan and execute phase split node move."}
{"text": "Developed SQL and PL/SQL scripts for save and execute phases date to retrieve and save to Oracle. "}
{"text": ""}
{"text": "Environment: Java, HTML, DHTML, JavaScript, JSP, JSF, Struts, Web Services, Eclipse, SOAP, XML, Hibernate, SQL, PL/SQL, Oracle, Windows XP."}
{"text": ""}
{"text": "Company: Sapient Corporation, India.\t\t                      \t\t          \t                  \t             Dec 07 – Mar 08"}
{"text": "This application has been developed for a reseller application. This project was to develop a web site, which is e-commerce compliant. It involved maintaining good backend inventory and order processing system. The project involved different modules like database designing, static content designing, dynamic product displaying, maintaining the shopping cart, invoice generation and administrator's interface for the remote maintenance of database objects in HTML forms through Java Servlets."}
{"text": "Role: Jr. UI Developer"}
{"text": "Responsibilities:"}
{"text": "Participated in designing the user interface for the application using HTML, DHTML, and Java Server Pages (JSP)."}
{"text": "Developed screens using JSP, JavaScript, and HTML."}
{"text": "Involved in writing Client side Scripts using Java Scripts and Server Side scripts using Java Beans and used Servlets for handling the business."}
{"text": "Coded complicate Java programs based on design documents in the form of UML class diagrams."}
{"text": "Designed and developed the UI using Java Swing components like JScrollPane, JTable, JPopupMenu, JFrame, JButton, JCheckBox, JComboBox, JList, JRadioButton and JSlider etc."}
{"text": "Documented the project for clients."}
{"text": ""}
{"text": "Environment:  Java, Struts, Eclipse, HTML, XML, JSP, JavaScript, SQL, Oracle and Windows."}
{"text": ""}
{"text": "References:  Will be provided upon request."}
{"text": ""}