{"text": "Name: mary mary"}
{"text": "E-Mail: mary.mary@gmail.com"}
{"text": "Address: Rangoon, Myanmar"}
{"text": "Github: https://github.com/mary"}
{"text": "LinkedIn: https://linkedin.com/mary"}
{"text": "Phone No. 10968590983"}
{"text": "Professional Summary"}
{"text": "An accomplishedAgile Project Manager/ Scrum Master with 10+ years of experience specializing in the Information Systems Industry in various domains, viz. Retail, Supply chain, Finance, Banking and Energy. Successful at developing breakthrough software products by usingvarious Software Development Life cycle frameworks (SDLC) such as Waterfall, Scrum,Kanban, Spiral,SAFeand leading cross-functional teams of more than 100 members achieving over $1M increase in quarterly revenue for the recent organization."}
{"text": "In-depth understanding of project cost planning, continuous improvement, defect elimination, and Lean Management, empowering organizationsto deliver business value and attain business objectives.An eloquent speaker and succinct writerwithcritical thinking ability and a focus on effective communication in all endeavors. A strategic thinker, result oriented and deadline driven individual with strong ability to lead,collaborate, solve complex problems and analyze huge data"}
{"text": ""}
{"text": "Have robust understanding of various Software Development Life Cycle methodologies, starting from initiation to implementation, have collaborated with different stakeholders, gathered requirements, created artifacts, performed different analysis, handled change requests, performed Testing and assisted in successful deployment."}
{"text": "Worked in Matrixed, Projectized and Functional Organizations "}
{"text": "Experienced in KANBAN, LEAN TOOLS, QUALITY TOOLS "}
{"text": "Experienced in Cost Management, Risk Management, Communication Management, Human Resource Management, Time Management and Stakeholder Management"}
{"text": "Used MS Project to prepare Work Breakdown Structure and assign resources to each step of project"}
{"text": "Responsible for Earned Value Calculation to ensure project brings in the expected ROI"}
{"text": "Worked in all the phases of Project Management Lifecycle including Initiation, Planning, Execution, Monitoring and Closeout"}
{"text": "In-depth knowledge and experience of analyzing AS-IS business process, creating To-Be business process, conducting feasibility study, cost benefit Analysisandrisk analysis (both business and technical)."}
{"text": "Experienced in Capacity planning, Cost estimation, implementing System Thinking,Issue tracking and resolution, scheduling, scope management,Triple Resource Planning,Prioritization, handling team dynamics and performing staff appraisals."}
{"text": "Experienced in working with Project Management Tool like Confluence"}
{"text": "Skilled in handling change requests, conducting impact analysis and accessing change impact on the triple constraints of project, presenting to Change Control Board, getting it approved from business, baselining artifact."}
{"text": "Skilled in Story writing, just-in-time requirement analysis, created user stories using INVEST criteria, sliced epics and themes using vertical slicing, user acceptance test cases and assisted Product owner with Product backlog."}
{"text": "Facilitated scrum ceremonies, creating tasks by using SMART criteria, story mapping, coached team to be self-organized and on agile principles, logged and resolved impediments, adept at conflict management and resolution. "}
{"text": "Good understanding and working knowledge of Scaled Agile Framework, and LEAN management."}
{"text": "Proficient in using project management tools like Jira, CA AGILE, HPALM, and MS Project. Created scrum burn down, burn up artifacts, Expectation charts for reporting status to higher management, and tracking team performance, velocity, user story completion. Validated completed stories using Definition of Done, tracked user story & Impediment accountability"}
{"text": "Facilitated and Participated in Systems Demo and Solutions demo, therebyescalating impediments and defining KPIs."}
{"text": "Maintained best practices for continuous integration at all levels in SAFe frame work & improved collaboration across teams."}
{"text": "Created various business reports on Tableau, transforming data into business insights"}
{"text": "Worked as Change Agent and Project Manager in cross-functional and large strategic initiatives, provided managementassistance and communicated project status and metrics to internal and external stakeholders."}
{"text": "Skilled in handling change requests, conducting impact analysis and accessing change impact on the triple constraints of project, presenting to Change Control Board, getting it approved from business,baselining artifact."}
{"text": "Experienced in delivering SOA Enterprise-Level Projects, leading to improved ROI"}
{"text": "Facilitated scrum ceremonies, creating tasks by using SMART criteria, story mapping, coached team to be self-organizedand on agile principles, logged and resolved impediments, adept at conflict managementand resolution. "}
{"text": "Proficient in using project management tools like Jira, CA AGILE, HPALM, and MS Project. Createdscrum burn down,burn up artifacts, Expectation charts for reporting status to higher management, and tracking team performance, velocity, user story completion.Validated completed stories using Definition of Done, tracked user story & Impediment accountability"}
{"text": "Strong understanding of OLTP, OLAP, data marts, OLAP Cube, Conceptual modelling, logical modelling, ODS and ETL concepts. Experience and good understanding of using DDL, DML, DRL languages in SQL to perform CURD operations on database including joins, order by, group by, procedures and functions."}
{"text": ""}
{"text": "Skill-Set"}
{"text": ""}
{"text": "Professional Experience"}
{"text": "Kohl’s, Menomonee Falls, WI\t\t\t\t\t\t\t\tJuly 2016 – Sep 2018"}
{"text": "Scrum Master/Project Manager\t"}
{"text": "Scope: The objective of the project was building a Merchant Management System that aims atoptimizing product sales by multiple merchants by using a dynamic pricing model. The resulting savings can be passed down to the customers. Worked in SAFe environment with 8 Agile Release Trains, each train with 120 people "}
{"text": "Roles and Responsibilities"}
{"text": "Led all aspects of a project including initiation, planning, monitoring, implementation and closing"}
{"text": "Managed project delivery teams from Initiation phase to Closure phase to ensure consistent, high-quality project management discipline for all technology related initiatives and endeavors"}
{"text": "Facilitated Pre-PI planning, Post-PI Planning, PI Planning meetings and ensured there is a relevant flow from Value stream backlog to Program Backlog to Team backlog."}
{"text": "Prepared Change Management plan, communicated process changes to stakeholders"}
{"text": "Conducted change impact analysis and got approvals from Change Management Board"}
{"text": "Worked in all Scrum Master responsibilitieslike facilitating Scrum Ceremonies of Sprint Planning, Sprint Review, Daily Scrum, Sprint Retrospective "}
{"text": "Prepared Scrum artifacts like Impediment chart, Expectation chart, Burn down chart, Burn up chart"}
{"text": "Responsible for fast tracking and crashing activities to deliver project on time"}
{"text": "Managed multiple responsibilities simultaneously with conflicting priorities without extending deadline"}
{"text": "Responsible for selecting and guiding the team through forming, storming, norming and performing team stages"}
{"text": "Responsible for synthesizing project information and defining project scope, objectives, resources, budget&deliverables."}
{"text": "Prepared Project Charter, Project Plan and RACI Matrix to keep project on track"}
{"text": "Create detailed project status reports, Risk Management plan, charters and issue logs for management and project team"}
{"text": "Used KANBAN to leverage JIT principles by matching the amount of work in progress (WIP) to the team's capacity."}
{"text": "Implemented Kanban board should be seen as the single source of truth for the team's work"}
{"text": "Used Kanban cards to feature critical information about particular work item, giving the entire team full visibility into who is responsible for that item of work, a brief description of the job being done, how long that piece of work is estimated to take etc., shortening Cycle Time"}
{"text": "Facilitated PI Planning readiness via fostering the preparation of Vision and Backlogs, and via Pre- and Post-PI Planning meetings"}
{"text": "Coached leaders, teams, and Scrum Masters in Lean-Agile practices and mindsets"}
{"text": "Created and maintained project budgets and performed budget analysis"}
{"text": "Ensured value flow from Portfolio to Program to Team level in full SAFe environment"}
{"text": "Worked with Product and Solution Management, Product Owners, and other stakeholders to help ensure strategy and execution alignment"}
{"text": "Led in contract negotiations, vendor management, RFP evaluation, contract administration, and contract closure"}
{"text": "Responsible for performing Cost benefit analysis, defining key performance indices, maintaining release milestones, brainstorming and analyzing ideas, incorporating best ideas into project roadmap."}
{"text": "Used MS Project to prepare Work Breakdown Structure and assign resources to each step of project"}
{"text": "Responsible for Earned Value Calculation to ensure project brings in the expected ROI"}
{"text": "Responsible for tracking project risks in terms of budget and time, dependencies, resources using MS Project Server."}
{"text": "Presented to the Board the change management plans for improved productivity of the team"}
{"text": "Responsible for facilitating agile games that would bring out team collaboration and improve communication."}
{"text": "Resolved conflicts at team and organizational levels "}
{"text": "Collaborated with the Program Manager, Portfolio Manager to ensure value flow from program to team levels. "}
{"text": "Approved Business Requirement document (BRD) to incorporate business requirements, and Software Requirements Specification (SRS) to incorporate functional, non-functional and GUI requirements using MS-Word."}
{"text": "Responsible to foster healthy environment in team by encouraging and ensuring team participation&contribution."}
{"text": "Involved in validating and approvingwireframes, mock-up screens, data flow diagrams, use case diagrams, sequence diagrams and Activity diagrams for To-Be system and web application using business modeling tool like Azure."}
{"text": "Facilitated Sprint Planning meeting for selecting the Sprint Backlog and creating Tasks using SMART criteria"}
{"text": "Facilitated Daily Scrum meeting and Scrum of Scrums to track team performance and ART performance and sprint completion and logged impediments."}
{"text": "Facilitated Sprint Review meeting to incorporate feedback of stakeholders and ensure PSPI acceptance by definition of done."}
{"text": "Facilitated Sprint Retrospective meeting using Wheel technique and used that to improve team performance."}
{"text": "Responsible for impediment tracking, resolution and managing team-conflicts."}
{"text": "Ensured team understood and followed the best practices of Continuous integration, Continuous testing, TDD, BDD and ATDD."}
{"text": "Responsible for creating burn-up, burn-down, requirement churn, impediment chart, expectation chart to communicate team performance and project status to stakeholders and teams."}
{"text": "Facilitated Grooming meeting in prioritizing the backlog using MOSCOW technique and KANO Model. Decomposed epics by vertical slicing and created user stories using INVEST criteria and tasks through SMART Criteria."}
{"text": "Responsible for Communication management, Risk management, Release management, scope the major milestones, timelines and overall business objectives."}
{"text": "Environment & tools: Agile (SAFe), Salesforce CRM, MS Project 2013, Tableau 10.1, MySQL database 6.3, Hadoop, Zookeeper, YARN, Apache Flume and Scoop, Apache Spark, Pig, XML, HTML, HTTP, SOAP API, CA Agile, Informatica Power center 9.6.1 "}
{"text": "Staples, Framingham, MA\t\t\t\t\t\t\tOctober 2015- July 2016"}
{"text": "Scrum Master/Project Manager\t"}
{"text": "Scope: The project involved developing a proactive Supply Chain network where customers, suppliers, logistics providers, carriers, and financial institutions are all connected to a centralized supply chain server. The server receives forecasts for direct material procurement from the customers detailing the orders that the customers desire. These forecasts are analyzed by the supply chain server to ensure that they conform to contractual agreements and do not contain errors. This enables effective demand management"}
{"text": "Roles and Responsibilities"}
{"text": "Prepared Project Charter, Project Plan and RACI Matrix to keep project on track"}
{"text": "Guided and led the team in all project lifecycle stages including Initiation, Planning, Execution, Monitoring-control and Closure"}
{"text": "Analyzed, selected and allocated human resources and organization resources, complying to project budget, scope and schedule"}
{"text": "Involved in business process improvement by conducting Process modelling, SWOT analysis, Document analysis, and GAP analysis to analyze As-Is business process and the To-Be system"}
{"text": "Approved BRD, SRS and assisted SMEs for project risk analysis, developing the Risk Register"}
{"text": "Used 5 WHY Principle for generating FISH-BONE Diagram to perform root-cause analysis of existing process defects"}
{"text": "Assisted in Document analysis, conducted interviews with Compliance team, monitoring team, and Executives to understand about As-Is process of existing supply chain system."}
{"text": "Facilitated JAD sessions and brainstorming sessions to elicit the requirements and analyzed them"}
{"text": "Enabled the effective demand forecast for order fulfillment "}
{"text": "Ensured the account receivables are tracked and routed to responsible customers"}
{"text": "Communicated along with PO the business rules & required functionality of To-Be system to development team."}
{"text": "Responsible for slicing epics by vertical slicing and creation of user stories with INVEST criteria."}
{"text": "Generated Gantt Chart, Work Breakdown Structure and Earned Valued management report to track team’s performance"}
{"text": "Assisted solutions team in designing the architecture, validated & got it approved from business owners."}
{"text": "Responsible for assisting development team in conducting Data profiling, data enrichment and aggregating various data sources."}
{"text": "Responsible for creating a balance with Triple Constraints to maximize the benefits of process improvement"}
{"text": "Responsible for developing conceptual and Logical Entity Relation diagrams using Balsamiq."}
{"text": "Coordinated with ETL developer Responsible in developing and scheduling batch jobs and ETL."}
{"text": "Involved in designing detection engine and correlation engine for pattern analysis and risk scoring."}
{"text": "Facilitated Scrum ceremonies & created burn-up&burn-down for higher management reporting."}
{"text": "Know-how respective scrum ceremony techniques such as Bucket Planning, Kano, &Sad Mad Glad."}
{"text": "Assisted Product Owner in prioritizing requirements, sorting user stories and maintaining the product backlog"}
{"text": "Led the change management effort within the organization by organizing knowledge sharing workshops and coaching the significance of process change for the organization"}
{"text": "Assisted solutions team in designing the architecture, validated & got it approved from business."}
{"text": "Responsible for conducting Data profiling, data enrichment and aggregating various data sources for better process management."}
{"text": "Involved in reviewing, updating Know Your Customer files information to satisfy compliance requirements."}
{"text": "Responsible for creating project communication plan, identifying and managing stakeholder communication needs"}
{"text": "Collaborated with testing team to perform user acceptance testing and systems integration testing."}
{"text": "Collaborated with the PO for grooming backlog, refining user stories, collecting and incorporating end user feedback "}
{"text": "Selected the Prioritization and Estimation techniques of user stories by evaluated the team’s T-Shaped Skills"}
{"text": "Levelled constrained resources by task redistributionand fast tracking without extending the project deadline"}
{"text": "Responsible for implementing LEAN Practices for continuous improvement "}
{"text": "Improved Software Quality by introducing XP engineering practices like Paired Programing, test-first approach, refactoring to ensure minimum technical debt"}
{"text": "Organized Spikes to improve user story certainty and remove any technical constraints"}
{"text": "Coordinated with On-shore and Off-Shore teams for effective project management"}
{"text": "Responsible for creating burn-up, burn-down, requirement churn, impediment chart, expectation chart to communicate team performance and project status to stakeholders and teams"}
{"text": "Environment and Tools: Java, HTTPS, XML, Scrum XP, Rally, Tableau, Java Script, Oracle 11g, Balsamiq 3.5.8, Confluence, Cucumber"}
{"text": ""}
{"text": "World Bank, Washington D.C\t\t\t\t\t\t\tNovember 2014 – September 2015"}
{"text": "Scrum Master/Project Manager\t/Agile Coach"}
{"text": "Scope:The project involved developing a financial transaction management system for automated analytics driven reconciliation of financial transactions in SAFe environment"}
{"text": "Roles and Responsibilities"}
{"text": "Responsible for PERT Analysis, Earned Value Analysis, Triple Constraint planning, Critical Path Analysis, stakeholder identification, RACI Matrix development, and creating Risk Register"}
{"text": "Responsible for fast tracking and crashing activities to deliver project on time"}
{"text": "Responsible for allocating resources and building visual workplace through Kanban task board, Run Chart, Gantt Chart"}
{"text": "Managed project delivery teams from Initiation phase to Closure phase to ensure consistent, high-quality project management discipline for all technology related initiatives and endeavors"}
{"text": "Provided all support to the team using a servant leadership style whenever possible, and leading by example"}
{"text": "Educated employees at all levels, including senior, and at times clients, on Agile principles, providing them with tools for implementing the process in their own work"}
{"text": "Designed strategies for the organizational adoption of Agile, including every stage of adoption, from the introduction of Agile and employee education, to fostering teams and cultures that practice Agile, to sustaining Agile methodologies"}
{"text": "Prepared and updated training documents for Agile Adoption"}
{"text": "Supervised and assign resources to manage and control the project within the assigned program portfolio related to the selection, acquisition, development, and implementation of major information systems."}
{"text": "Managed Triple Constraints totrack both Program-wide and individual project costs associated with internal labor, hardware, software and ongoing maintenance to define the actual cost for the project"}
{"text": "Identified project dependencies, issues and risks and determined mitigation and action plans"}
{"text": "Incorporated Lean Principles like Continuous Improvement for project management"}
{"text": "Performed Document analysis, conducted interviews with Compliance team, monitoring team, and Executives to understand about As-Is process of transaction management"}
{"text": "Identified gaps, conflicts, dependencies, and constraints in scope, requirements, delivery, training, and deployment and worked with necessary parties for resolution"}
{"text": "Facilitated JAD sessions and brainstorming sessions to elicit the requirements and analyzed them."}
{"text": "Communicated along with PO the business rules & required functionality of To-Be system to development team."}
{"text": "Responsible for slicing epics by vertical slicing and creation of user stories with INVEST criteria."}
{"text": "Assisted solutions team in designing the architecture, validated & got it approved from business."}
{"text": "Responsible for conducting Data profiling, data enrichment and aggregating various data sources."}
{"text": "Involved in reviewing, updating Know Your Customer files information to satisfy compliance requirements."}
{"text": "Responsible for developing conceptual and Logical Entity Relation diagrams using Balsamiq."}
{"text": "Coordinated with Data base developer in developing target database and defining key attributes and Triggers."}
{"text": "Coordinated with ETL developer Responsible in developing and scheduling batch jobs and ETL."}
{"text": "Involved in designing detection engine and correlation engine for pattern analysis and risk scoring."}
{"text": "Assisted development team to develop machine learning algorithms as per business defined rules."}
{"text": "Involved in validating the system compliance towards Bank Secrecy Act, US patriot Act& Federal requirements."}
{"text": "Responsible for creation of wire frames and mock-ups for case management user interface."}
{"text": "Facilitated Daily Scrum meeting and Scrum of Scrums to track team performance and ART performance and sprint completion and logged impediments."}
{"text": "Facilitated Sprint Review meeting to incorporate feedback of stakeholders and ensure PSPI acceptance by definition of done."}
{"text": "Facilitated Sprint Retrospective meeting using Wheel technique and used that to improve team performance."}
{"text": "Responsible for impediment tracking, resolution and managing team-conflicts."}
{"text": "Assisted Web service team in understanding, enhancing existing suspicious activity filters and packaging cases."}
{"text": "Collaborated with testing team to inspect user acceptance testing and systems integration testing."}
{"text": "Assisted in identifying, red flags & patterns associated with laundering of illicit funds & provided information to support Suspicious Activity Reports, Currency Transaction Report for regulatory filing & for validation purpose."}
{"text": "Involved in creation of dashboards to present laundering and suspicious activity trends, anomalies and schemes in transactions and relationships for all products across multiple business lines using Tableau."}
{"text": "Facilitated Scrum ceremonies & created burn-up&burn-down for higher management reporting."}
{"text": "Know-how respective scrum ceremony techniques such as Bucket Planning, Kano, &Sad Mad Glad."}
{"text": "Responsible for tracking requirements, tasks, defects and impediments resolution using Rally."}
{"text": "Environment and Tools: Java, HTTPS, XML, Scrum XP Hybrid, Rally, Tableau, Java Script, Oracle 11g, Balsamiq 3.5.8, Confluence"}
{"text": ""}
{"text": "Barclays, Wilmington, DE\t\t\t\t\t\t\tDecember2013– October2014"}
{"text": "Scrum Master/Project Manager\t"}
{"text": "Scope: The scope of the project was to create an Enterprise Data Warehouse to create a one-stop overview of organization performance and help organization in better decision making at enterprise level by visualizing data & generating repots with the help of various OLAP tools, data analytics and data mining."}
{"text": "Roles and Responsibilities"}
{"text": "Conducted interviews with business owners and facilitated JAD, brainstorming sessions between business stakeholders and development team to elicit database and reporting requirements."}
{"text": "Responsible for identifying, analyzing requirements and documented them by creating various artifacts such as Business Requirement Document and Functional Requirements Document."}
{"text": "Expertise on identifying various data sources, performing data profiling, data cleansing, data aggregation, creating Data mapping, data modelling techniques like Entity Relationship modelling, dimensional modelling, data validation in data integration, migration, warehousing projects using Informatica. "}
{"text": "Assisted Project Manager in performing Risk analysis and creating Work Breakdown Structure."}
{"text": "Responsible for creation of data flow diagrams, use case diagrams and documented them."}
{"text": "Coordinated with system architect team in creation of logical, physical designs and Bus Matrix."}
{"text": "Analyzed source database, identified cardinalities and Created conceptual, logical ER diagrams."}
{"text": "Responsible for identifying different data sources and conducted data profiling using Informatica."}
{"text": "Involved in identifying facts and dimensions and created data mapping document. Coordinated with database developer to create star dimension modelling and develop the target Database."}
{"text": "Assisted in developing different dimensions such as slowly changing, rapidly changing, and conformed dimensions and fact tables with facts and measures as per business requirement."}
{"text": "Responsible for identifying business rules and defining active, passive transformations such as Data type conversion, Constant, look-up and data enrichment transformations using Informatica."}
{"text": "Assisted & monitored ETL developer in developing tasks and work Flows to perform Extract Transform Load operations using Informatica Workflow Manager.  Also, monitored ETL logs."}
{"text": "Assisted testing team and Responsible for creating and monitoring Requirements traceability matrix, test cases, test plans, defining User Acceptance criteria and tracking defects using HPALM."}
{"text": "Assisted in developing OLAP cubes and Performed Rollup, Drill down, Slice and Dice operations."}
{"text": "Worked closely with Agile Program manager and Systems Architect in understanding and defining the capabilities of the new Dynamics system, Key Performance Indicators and designing Work Break Down Structures."}
{"text": "Responsible for implementing the LEAN framework and scrum processes across all teams and managing resources."}
{"text": "Responsible for monitoring and managing the work progress and ensured to deliver systems demos as per release plan."}
{"text": "Worked to promote transparency across teams and stakeholders in SAFe environment by publishing team performance, making teams committed and accountableto deliverable and ensure team follows Agile principles."}
{"text": "Worked with and coachedScrum Masters, to drive a steady process and communication across teams."}
{"text": "Worked with on-shore, off-shore teams and made sure the communication is proper and SAFe process is followed"}
{"text": "Managed and optimized the flow of value through the ART and Solution Train using various tools, such as Solution Kanban and other information radiators"}
{"text": "Responsible for accessing and improving program and value streamagility levels through workshops and ensured there is PDCA (Plan-Do-Check-Adjust) in every step."}
{"text": "Responsible for developing best practices for continuous integration at Team level, Program level and value stream level Facilitated System Demos and Solution Demos "}
{"text": "Responsible for tracking impediments, escalating them, setting metrics, managing risks and dependencies"}
{"text": "Participated in Innovation Planning iteration to facilitate PI readiness, cadence based planning, estimating guard band, hackathons, infrastructure improvements and systems demo."}
{"text": "Environment & Tools: Scrum (transitioning from Waterfall), Portfolio SAFe, UML diagrams, Visio, HP ALM, MySQL DB, SSRS, MS Office, and Power BI"}
{"text": "FedEx, Bangalore India\t\t\t\t\t\t\t\tOctober 2012-October2013"}
{"text": "Scrum Master/Project Manager\t"}
{"text": "Scope: Toidentify and evaluate geographical demand using Google Analytics for efficient SKU Management"}
{"text": "Roles and Responsibilities"}
{"text": "Facilitated JAD sessions with management, SME, and other stakeholders to elicit requirements."}
{"text": "Calculated actual SKU Requirement in light of volatile demand, improving inventory turnover"}
{"text": "Generated simulations of efficient order handling from source to central warehouse, improving Supply Chain Visibility"}
{"text": "Implemented trackers in all items to collect real-time data and capture any missing items more efficiently"}
{"text": "Analyzed the requirements and documented them by creating BRD and SRS artifacts."}
{"text": "Acted as a liaison between business and technical teams and involved in communicating the business requirements."}
{"text": "Maintained and build relationships with stakeholders to ensure performance and business needs areunderstood."}
{"text": "Assisted Sr.BSA and Project manager in Risk analysis, Risk Register and Project charter. Managed project templates, Use case project templates, requirement types, & traceability relationships."}
{"text": "Assisted in creation of Wireframes, Mockups by analyzing UX team data using Visio."}
{"text": "Assisted in creating Use case diagrams, sequence diagrams & behavior diagrams using MS Visio."}
{"text": "Assisted in designing of 3-tier architecture that was developed using .Net, C#, HTML and XML."}
{"text": "Created XML mapping schemaand XML documentation usingExcel for application requests and response."}
{"text": "Validated basic SQL scripts to verify the application CURD operations on database using MySQL."}
{"text": "Coordinated all testing activities between offshore and onsite as well as with development team."}
{"text": "Assisted testing teams in performing smoke, systems and User acceptance testing."}
{"text": "Assisted in validating XML documents, SOAP services, Client side and Server-side Validations."}
{"text": "Assisted in creation of web traffic and key metrics by analyzing data from Google Analytics."}
{"text": "Created insightful automated dashboards and data visualizations to track key business metrics."}
{"text": "Delivered summarized sales, marketing data reports critical to making key decision making using Cognos."}
{"text": "Environment and Tools: Waterfall, ASP.Net, XML, MySQL, Google Analytics, Visio, HPALM"}
{"text": "Foster Wheeler, Kolkata, India\t\t\t\t\t\t\t\tMay2011 –September 2012"}
{"text": "Sr. Business Analyst, Supply Chain"}
{"text": "Scope: The scope of the project was to develop a central control panel for an Oil and Gas client that helped the client to centrally manage the remote field sensors by implementing PLC (Programmable Logic Controller) and SCADA system "}
{"text": "Roles and Responsibilities"}
{"text": "Managed all aspects of solution delivery including requirements capturing, creating functional User Cases, designing modules, supporting application and transferring knowledge to customers."}
{"text": "Provided On-boarding and Off-boarding of Users, maintained the reference/master tables, created assignment teams in Assignment Manager, and provided users with pre-defined queries."}
{"text": "Configured and customized the Applets, Views, Screens, Business Components and Business Objects through Joins, Links, MVGs and MVLs."}
{"text": "Designed, developed and supported Siebel EAI, Configuration, Scripting, Workflows. Worked on Stored Procedures for automation of batch jobs."}
{"text": "Assisted in unit testing other modules in the project such as Opportunities and Accounts and logged defects in HPQC for breach in development with the design or the business requirements."}
{"text": "Responsible for monitoring of daily batch jobs to migrate data to OLAP and error handling."}
{"text": "Involved in monitoring ETL process and troubleshoot if any issues arise by exploring log files."}
{"text": "Involved for designing reports and scheduling reports using OBIEE."}
{"text": "Responsible for validating the data across SAP, Siebel and OBIEE and designed hind part solution."}
{"text": "Environment and Tools: SAP ERP, Siebel CRM, Siebel Tools, Informatica, OBIEE, XML, MySQL."}
{"text": "Cairn Energy India Pvt.Limited,Delhi, India\tAugust 2007-April 2011BusinessAnalyst\t\t\t\t\t\t\t\t"}
{"text": "Scope: The scope of the project was to streamline the company’s order management process to establish clear rules order across organization by implementing Siebel Wizard application & the application should provide seamless end-to-end processing, serve cycle of order of billing, & interact with other applications."}
{"text": "Roles and Responsibilities"}
{"text": "Worked extensively on Siebel tools to configure the application in accordance with business requirements of sales force automation functionality."}
{"text": "Customized the out-of-the-box using Siebel Tools creating and modifying business objects, business components, views, screens and applets."}
{"text": "Customized application creating workflows, business services, custom buttons using Siebel eScript and implemented other declarative alternatives like User properties and data validation methods."}
{"text": "Developed inbound / outbound Workflows, Workflow Policies and Workflow Actions for automation of order and billing processes and integrating with the external systems."}
{"text": "Worked on Inbound and Outbound Web Services like SOAP and in configuring the WSDL."}
{"text": "Involved in designing XSDs and XMLs to communicate with the adjacent systems."}
{"text": "Assisted Siebel Administrator in migrating the repository from development to test environment."}
{"text": "Assisted the production support team during deployment activities."}
{"text": "Worked with IBM WebSphere MQ &Siebel Web services to integrate Siebel and other applications"}
{"text": "Environment and Tools: Microsoft Windows Server 2003, Oracle Database, Siebel 7.8 eCommunications (Sales), Tools 7.8, IBM Web Sphere MQ, MySQL."}