{"text": "Name: annie annie"}
{"text": "E-Mail: annie.annie@gmail.com"}
{"text": "Address: Beijing, China"}
{"text": "Github: https://github.com/annie"}
{"text": "LinkedIn: https://linkedin.com/annie"}
{"text": "Phone No. 815146957064"}
{"text": ""}
{"text": "--------------------------------------------------------------------------------------------------------------------------------------"}
{"text": ""}
{"text": "Professional Summary:"}
{"text": ""}
{"text": "8 years of professional experience in all phases of software development life cycle including requirements Analysis and Debugging, Applications Design, Development, Integration, Maintenance, Installation, Testing of various client/server, N-tier and web applications."}
{"text": "Expertise in web and mobile/tablet UI development with experience in developing hybrid mobile applications in Cordova using HTML5, JavaScript and other JS frameworks."}
{"text": "Expertise in Client Scripting language and server side scripting languages like HTML5, CSS3, JavaScript with ECMA5 features, jQuery, JSON, Bootstrap, Angular.js."}
{"text": "Experience in developing Graphic User Interface (GUI) to display report data using D3.js with Cross-browser compatibility and Web application scaling."}
{"text": "Extensive experience on implementing the AJAX with rich features like deferred, promises, pipe, and callback functions."}
{"text": "Worked with JavaScript task runners to automate the development process. Used enhanced features of grunt.js and Gulp.js to implement browser Sync, dev and prod bundle generation, dev server etc."}
{"text": "Experience in creating user interface widgets using JQuery, Kendo UI, Bootstrap and AngularJS."}
{"text": "Experience in developing in application frameworks using JQuery, AngularJS, AngularJS-2."}
{"text": "Hands on experience inwriting light weight Node.js express server, and using technologies like Ajax, JavaScript/jQuery, JSON to make connections between server and databases like MongoDB and MySQL."}
{"text": "Used a custom framework sitting on the top of Nodejsand MongoDB and has used lot of client side javascript plugins."}
{"text": "Experience in using ReactJS in building applications and make them run without any crashes."}
{"text": "Rich experience with development using AngularJS extensive features for loading views in a Single Page Application, MVC structure for JavaScript files, data-binding using Angular JS directives and also building custom directives."}
{"text": "Experience with Handlebars.js to build dynamic HTML templates, and Underscore.js to handle and manipulate data from backend with a RESTful JSON interface."}
{"text": "Experience in developing kiosk app for Chrome OS using web development technologies like HTML, CSS, JavaScript and other JS frameworks."}
{"text": "Experience in the developing applications for different platforms like web browser, iOS, Android, and Chrome OS."}
{"text": "Incorporated the require.js features to build modular structure of JavaScript for better code maintenance and smoother name-spacing of variables."}
{"text": "Involved in web application development projects that required Responsive Web Design using flex box features of CSS3. "}
{"text": "Expertise in plain JavaScript logics, functionality, scope maintainability and name-spacing the variables."}
{"text": "Worked with AGILE Methodology in recent projects and participated in SCRUM meetings as well in previous projects."}
{"text": "Expertise in debugging skills using Safari Web Inspector, Chrome Developers Tool and Firebug."}
{"text": "Experience in using HighCharts, and D3.js Components and integrating back-end applications with AJAX driven front-end."}
{"text": "Experience in working with browsers compatibility issues with browsers like IE, Firefox, Safari, Opera, and Chrome."}
{"text": "Proven track record in developing reusable code, cleaner code structure, and understanding of the JS features to ensure data availability to the front-end."}
{"text": "Strong expertise in the iterative Agile and Scrum development methodologies for software development."}
{"text": "Experience with User Acceptance Testing (UAT) and Accessibility Testing."}
{"text": "Excellent communication skills to discuss the projects with technical and non-technical SME’s and also during the sprint meetings for Agile as well as Scrum development methodology."}
{"text": ""}
{"text": "Technical expertise:"}
{"text": ""}
{"text": ""}
{"text": "Educational Qualifications:"}
{"text": ""}
{"text": "Bachelors"}
{"text": "JNTU Hyderabad, TS India."}
{"text": ""}
{"text": "Certifications:  "}
{"text": "Microsoft professional certified and Programming in HTML5 with Java script and CSS3"}
{"text": ""}
{"text": "Professional experience:"}
{"text": ""}
{"text": "Verizon, Warren, NJ            \t"}
{"text": "Aug 2016 – Till Date         "}
{"text": "Sr. Front End /UI Developer "}
{"text": ""}
{"text": "\tVerizon Communications Inc. is a holding company. The Company, through its subsidiaries, provides communications, information and entertainment products and services to consumers, businesses and governmental agencies. Its segments include Wireless and Wireline. Project was to build eCRM application and it is Verizon’s communication channel to reach out to their customers. It creates & manages the Surveys, Campaigns and Billing, getting customer feedback and taking adequate measures."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Developed multiple applications for multiple platforms including windows surface, iOS tablets, Chrome OS and web browser"}
{"text": "Developed using application frameworks (e.g. jQuery, AngularJS 2.0) to connect the multiple sites of the company globally."}
{"text": "Involved in requirements gathering, framework selection and usability testing for the application"}
{"text": "Extensive experience Kendo UI for layout and responsive mobile/tablet applications."}
{"text": "Single Page Application development using Angular JS, backed by Mongo DB and Node JS."}
{"text": "Used handlebars for templating for ChromeOS application."}
{"text": "Built the template, pulled agent information from JSON object, parse the object, manipulate it using underscore.js and rendered it onto the widget."}
{"text": "Used JS libraries for specific tasks like moment.js for date formatting and calculations involving dates"}
{"text": "Involved in developing charts and data driven reports using high charts and d3.js"}
{"text": "Maintained and enhanced, custom CSS classes to be used application wide repeatedly."}
{"text": "Produced content pages with CSS3 flex box layout."}
{"text": "Debug the application using safari web inspector."}
{"text": "Created dynamic templates and style sheets based on UI standards and guidelines"}
{"text": "Worked with project managers to understand the requirements and to ensure that right set of UI modules been built."}
{"text": "Participated in the team on agile development cycle."}
{"text": "Coordinated with Interface Design Architects for meeting accessibility standards at code level."}
{"text": "Environment:HTML5/HTML, CSS3/CSS, JavaScript, ECMAScript 5, JQuery, JSP, EJB, JSON, DOM, Node.js, AngularJS, Require.js, bootstrap, GIT, MVC/MVVM, Adobe Fireworks, Photoshop, Dreamweaver, Illustrator, AJAX, XML, Eclipse, Internet Explorer, Firefox, Chrome, PL/SQL, Windows."}
{"text": ""}
{"text": "Credit Acceptance, Detroit, MI     "}
{"text": "Mar 2015 - July 2016     "}
{"text": "Sr. Web/UI Developer"}
{"text": ""}
{"text": "\tCredit Acceptance Corporation offers financing programs that enable automobile dealers to sell vehicles to consumers. The Company's financing programs are offered through a network of automobile dealers. The Company has two Dealers financing programs: The Portfolio Program and the Purchase Program. This project involved transforming the applications present in JQuery to Angular JS. The website uses AngularJS, JQuery and AJAX features extensively. "}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Transform the website features from jQuery domain to AngularJS domain as the latter is faster and easier to implement."}
{"text": "Developed AngularJS functionality in the application to provide two-way binding to the system."}
{"text": "Integrated the model and view part using Model View View Models (MVVM)."}
{"text": "Used node.js to develop the web application for the network."}
{"text": "Extensive experience using Bootstrap for layout."}
{"text": "Used customized services and directives in AngularJS to develop dynamic and responsive webpages."}
{"text": "Built the template, pulled agent information from JSON object and rendered it onto the widget."}
{"text": "Used JQuery plug-ins for Drag-and-Drop, Widgets, Menus, User Interface and Forms"}
{"text": "Involved in developing HTML and JavaScript/ECMAscript5 for client side presentation and, data validation within the forms."}
{"text": "Maintained, enhanced, and recommended solutions that best suit business and technology needs from UI standpoint."}
{"text": "Produced content pages with CSS3 layout and style markup presentations and also used JavaScript methods and properties."}
{"text": "Debug the application using Firebug to traverse the documents and manipulated the Nodes using DOM and DOM Functions."}
{"text": "Involved in writing application level code to perform client side validation using JQUERY and JavaScript."}
{"text": "Created reusable templates and style sheets based on UI standards and guidelines; Performed functional tasks using specifications and wireframes."}
{"text": "Successfully executed all the test cases and fixed any bugs/issues identified during the test cycles."}
{"text": "Closely worked with business system analyst to understand the requirements to ensure that right set of UI modules been built."}
{"text": "Participated in the team on agile development cycle."}
{"text": "Coordinated with Interface Design Architects for meeting accessibility standards at code level."}
{"text": "Environment:HTML5/HTML, CSS3/CSS, JavaScript, ECMAScript 5, JQuery, JSP, EJB, JSON, DOM, Node.js, AngularJS, Require.js, bootstrap, GIT, MVC/MVVM, Adobe Fireworks, Photoshop, Dreamweaver, Illustrator, AJAX, XML, Eclipse, Internet Explorer, Firefox, Chrome, PL/SQL, Windows."}
{"text": ""}
{"text": "Procter & Gamble, Cincinnati, OH                                                                   \t\t"}
{"text": "Oct 2013 – Feb 2015"}
{"text": "Web/UI Developer"}
{"text": ""}
{"text": "\tThe Procter & Gamble Company is focused on providing branded consumer packaged goods to the consumers across the world. The Company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care, and Baby, Feminine & Family Care. Procter & Gamble customer service application is internal project. Using this application customer service will create orders for Procter & Gamble vendors."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Developed single page application using AngularJS 1.2.28/1.2.30, jQuery, JavaScript, HTML5, Bootstrap, CSS3, LESS."}
{"text": "Involved in dividing application into modules and took the responsibility to deliver some modules in application. "}
{"text": "Developed AngularJS Directives to extend the grammar of the web through reusable HTML elements, attributes, and classes."}
{"text": "Developed AngularJS services for reusable functionality."}
{"text": "Developed AngularJS modules to group application views, controllers and models."}
{"text": "Developed AngularJS Filters to manipulating text within your HTML views."}
{"text": "Developed cache service, notification service, custom Http service and loading service."}
{"text": "Developed directives for reusable components with custom behavior and behavior control attributes. "}
{"text": "Developed custom filters to display as per the requirement without changing backend data."}
{"text": "Used and customized third party modules when it's providing similar functionality as per requirement."}
{"text": "Developed custom bootstrap with brand appropriate styles, colors, animations and font icons."}
{"text": "Setup the development environment using Node.js, npm, Grunt, Bower, Git."}
{"text": "Used Git as version control and MAVEN for build process."}
{"text": "Working with Data and application architect to design solutions, to ensure all application development, testing and deployment is done successfully."}
{"text": "Environment: AngularJS, HTML5, CSS3, Bootstrap, JavaScript,jQuery, Grunt, Bower, node.js, npm, Java, AJAX, XML, IntelliJ, Sublime Text, Photoshop CS6, Illustrator CS6, Maven, SQL, Tomcat, Git, Agile, Axure, MAC, UNIX / Linux."}
{"text": ""}
{"text": "Exelon Corporation, Chicago, IL                                                                                                            "}
{"text": "May 2012 – Sep 2013"}
{"text": "UI Developer"}
{"text": ""}
{"text": "\tExelon Corporation is a utility services holding company. The Company, through its subsidiary, Exelon Generation Company, LLC (Generation), is engaged in the energy generation business. My role at the organization was to design, create, test, and maintain websites and content that optimize exchange of information. I utilized my knowledge of HTML, CSS, JavaScript and jQuery."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Expertise in client side designing and validations usingHTML, CSS, JavaScript and jQuery."}
{"text": "Participated in Agile Process."}
{"text": "Developeddetailed mockups, prototypes and wireframesto illustrate interface and design concepts of the website using Adobe Creative Suites and InVision."}
{"text": "Involved in the creation of interface to manage user menu and Bulk update of Attributes usingAngular.js and JQuery"}
{"text": "Worked on the modernization of a legacy and outsourced UI. Technologies used were JQuery."}
{"text": "Utilized Adobe Illustrator, Adobe Photoshop, and BBEditfor the front-end development such as web pages, graphics and multimedia’s."}
{"text": "Created HTML navigation menuthat is role based menu items changes dynamically, derived from the database in the formof XML."}
{"text": "Developed page layouts, Navigations and presented designs and concepts to the clients and the management review."}
{"text": "ImplementedCSS and JavaScript based navigation systemvisually identical to previous table-based system to improve ease of maintenance and organic search engine placement."}
{"text": "Used the Mozilla Firefox extension, Firebug, to view and debug HTML, DOM and JavaScript."}
{"text": "Developed web page layouts using CSS mechanism to include different colors, layout, width, height, font size, images size to the web pages."}
{"text": "Utilized various jQuery plugins to build Rich Internet Application (RIA) to make it look more intuitive."}
{"text": "Environment:Angular.js, HTML, CSS, JavaScript, JQuery, Adobe Photoshop, Adobe Illustrator, BBEdit, RIA, SVN."}
{"text": ""}
{"text": "Barclays Capital, New York, NY                                                                                       \t"}
{"text": "Jan 2011 – Apr 2012"}
{"text": "Java UI Developer"}
{"text": ""}
{"text": "\tBarclays PLC is a global financial service holding company. The Company is engaged in retail banking, credit cards, wholesale banking, investment banking, wealth management and investment management services. My role was to create user-centric web application using technologies like HTML, CSS and JavaScript."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Wrote application level code to perform client side validation usingJQUERY and JavaScript."}
{"text": "Designed the front-end applications, user interactive (UI) web pagesusing web technologies like HTML, XHTML, and CSS."}
{"text": "Using advanced level of jQuery, AJAX, JavaScript, and pure CSS layouts."}
{"text": "Wrote JQUERY functions while implementing various UI Screens across the whole web application (both consumer facing as well as internal application)."}
{"text": "Involved in writing application level code to interact withAPIs, Web Services using AJAX, and JSON."}
{"text": "Designed and developed intranet web applications usingJavaScript and CSS."}
{"text": "Worked on cross browser compatibility issuesand fix the bugs pertaining to variousbrowsers."}
{"text": "Maintain, enhance, and recommend solutionsthat best suit technology needs from UI standpoint."}
{"text": "Define technicalrequirements basedupon businessrequirements."}
{"text": "Created cross-browser compatibleand standards-compliant CSS-based page layouts."}
{"text": "Strong communication, analytical and interpersonal skills working within cross-functional teams."}
{"text": "Environment:  HTML, CSS, JavaScript, JQuery, XHTML, AJAX, JSON, Web API."}
{"text": ""}
{"text": "Zensar Technologies, Hyderabad, TS, India                                                         \t\t"}
{"text": "Aug 2008 – Dec 2010 "}
{"text": "Java Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Extensively involved in requirements gathering and analyzing them, checking the dependencies and design of the project."}
{"text": "Implemented server side tasks using Servlets and XML."}
{"text": "Designed and developed User Interface using JSP, CSS, HTML and JavaScript. Used JavaScript DOM manipulation and JavaScript event to generate the data result in UI. "}
{"text": "Designed and Developed Java Script frame work for UI Configuration widgets."}
{"text": "Used OO Java Script, JSP, JQuery, HTML and CSS to develop the application."}
{"text": "Involved in redesigning the entire site with CSS styles for consistent look and feel across all browsers and all pages."}
{"text": "Developed and implemented the MVC Architectural Pattern using Struts Framework including JSP, Servlets."}
{"text": "Used JSON to develop rich GUIs and also involved in performance tuning the website."}
{"text": "Improved outgoing quality through test and yield improvements and characterization. Also, reduced costs through test time improvements."}
{"text": "Developed JSPs and Servlets to dynamically generate HTML and display the data to the client side."}
{"text": "Wrote test plans and performed unit testing and performance testing."}
{"text": "Environment: Java, J2EE, Eclipse, UNIX, My Eclipse IDE, JSP/Servlets, Apache, Tomcat, Web logic, JDBC, XML, HTML, Oracle8."}
{"text": ""}