{"text": "Name: irene irene"}
{"text": "E-Mail: irene.irene@gmail.com"}
{"text": "Address: Shantou, China"}
{"text": "Github: https://github.com/irene"}
{"text": "LinkedIn: https://linkedin.com/irene"}
{"text": "Phone No. 347470124092"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Professional Summary:"}
{"text": "Network Engineer with Over 8+ years of experience in testing, troubleshooting, implementing, optimizing and maintaining enterprise data network and service provider systems."}
{"text": "Implementation, Configuration and Support of Checkpoint (NGX R65, R70, R71, R75 and R77), Juniper Firewalls (SRX5400, SRX5600and SRX5800), Cisco Firewalls (ASA 5505, 5506-X, 5585), Palo Alto Networks Firewall models (PA-2k, PA-3kand PA-5 k)."}
{"text": "Provide scalable, supportable military grade TCP/IP security solutions along with expert TCP/IP network designs that enable business functionality."}
{"text": "Configured and Implemented Cisco Identity Services Engine (ISE) with connectivity to Microsoft Active directory for Authentication including Certificate Based Authentication."}
{"text": "Performed support, configuration, testing and documentation for ISE rollout for Center Point Energy which includes making configuration changes in access and distribution layer switches, wireless controllers and ISE nodes."}
{"text": "Excellent Hands on experience with Cisco ISE and the Migration of Wireless and TACACs to ISE"}
{"text": "Good knowledge on Endpoint incorporates a rules-based firewall, as well as an anti-malware technique"}
{"text": "Worked on F5 LTM/GTM, BIG-IP, load balancing, I Rules and WAN acceleration."}
{"text": "Administration, Engineering and Support for various technologies including proficiency in LAN/WAN routing, switching, security, application load balancing and wireless."}
{"text": "Deployed Cisco ACI Network for several years in enterprise data centers."}
{"text": "Working experience on tools and devices like Gigamon, Sourcefire, Fire eye, Aruba, Cisco ASA, Cisco ISE."}
{"text": "Collaborated & Managed with various project teams consist of 8 to 22 resources to deliver Panorama program projects and Developed group and individual timelines and assessed/identified potential bottlenecks various work streams in each project/program process."}
{"text": "Experience in creating User/Group Accounts and attaching policies to User/Group Accounts using AWS IAM service."}
{"text": "Provide ISE deployment services for migration of users from Cisco NAC to Cisco ISE platform for the following locations."}
{"text": "Managed all network and devices to include Cisco routers, switches, VPNs, SSL, Check Point, Cisco PIX, Cisco ASA, Cisco FWSM as well as content delivery networks (CSS, Citrix NetScaler and F5 Big IP LTM and GTM 1600 and 3400 load balancers) enterprise environment."}
{"text": "Knowledge of web application firewalls and data loss prevention technologies."}
{"text": "Configuration and troubleshooting of CISCO & ARUBA wireless devices"}
{"text": "Aruba Airwave Manager, ClearPass Policy Manager Server"}
{"text": "Worked on Juniper Net Screen Firewalls NS50, SSG 550M, SSG520M, ISG 1000, ISG 200 and Cisco PIX 535, 520, 515, ASA -5500 and 5505."}
{"text": "Experience in Deployed Check Point Provider-1 NGX and configured CMAs"}
{"text": "Responsible for Checkpoint and Cisco firewall administration across global networks"}
{"text": "Worked on Cisco Catalyst Switches 6500/4500/3500 series."}
{"text": "Policy development and planning/programming on IT Security, Network Support and Administration. "}
{"text": "Experience in Configuring and Troubleshooting BIG-IP F5 LoadBalancer LTM. "}
{"text": "Creating Virtual Servers, Nodes, Pools and iRules on BIG-IP F5 in LTM module."}
{"text": "Experience with Firewall migrations from PIX firewall to Cisco ASA and Juniper SRX firewall appliances"}
{"text": "Experience in analyzing security logs generated by Intrusion Detection/Prevention Systems (IDS/IPS), firewalls, network flow systems, Anti-Virus and/or other security logging sources. Experienced in Installation, Configuration, and Troubleshooting VMware ESX & ESXi, 6.5, 6.0, .5.5, 5.1, 5.0, 4.1, 4.0, 3.5, vSphere 5.5, 5.1, 5.0, 4.1, 4.0, vMotion and Virtual Center 5.1, 5.0, 4.1, 4.0, Hypervisor."}
{"text": "Monitor SIEM and IDS/IPS feeds to identify possible enterprise threats. Actively investigate, respond to and remediate security incidents."}
{"text": "Experience in implementation of F5 GTM based on topology load balancing methods."}
{"text": "Experience in migration of data to cloud environment. Good working knowledge of Azure and AWS."}
{"text": "Experience with Bluecoat Proxy servers, LAN & WAN management. "}
{"text": "Hands on experience with Microsoft Azure Cloud services, Storage Accounts and Virtual Networks."}
{"text": "Knowledge of DDOS protection/Terminal functionality, Windows XP/7/8, iOS devices, Unix/Linux, Perl/Python, Nmap, ESXI 5.1, VMware vSphere 5.0, Metasploit with Armitage, Penetration Testing, and usage of Qualys Guard Vulnerability Management/Policy Compliance/WAS/ Asset Management / PCI."}
{"text": "Excellent knowledge in Routing, Switching, Firewall and Gateway technologies, system design, wireless design, data network design, capacity management and network growth. "}
{"text": "Experience on ITSM modules (Incident/Problem/Change/Service Level/Service Request Management) regarding installations and operations."}
{"text": "Deployed the Cisco 3500 Access Points using Cisco Wireless controllers 5500 and 2500 and WCS System."}
{"text": "Experience in working with Cisco Nexus Switches and Virtual Port Channel Configuration."}
{"text": "Experience with Checkpoint VSX, including virtual systems, routers and switches."}
{"text": "Experience with DNS/DFS/DHCP/WINS Standardizations and Implementations."}
{"text": "Extensive understanding of networking concepts, (IE. Configuration of networks, router configuration and wireless security, TCP/IP, VPN, Content Filtering, VLANs and routing in LAN/WAN, Ethernet Port, Patch Panel and wireless networks."}
{"text": "Experience with management platforms such as Panorama, Juniper NSM and Smart Center."}
{"text": "Configuration of Network and Security devices such as Cisco routers and switches (Cisco 7600/3500/Nexus 7K/5K), Firewall (Checkpoint R75/Gaia and Cisco FWSM), Load Balancers and DNS and IP Manager (Infoblox)"}
{"text": "Black listing and White listing of web URL on Blue Coat Proxy Servers."}
{"text": "Administration of production Windows Servers infrastructure that includes Domain Controllers, IIS Web Servers, SharePoint, File and Print and FTP/SFTP servers."}
{"text": "Experienced with routing protocols (RIPv1/2, IGRP, EIGRP, OSPF, BGP), switching (VLANS, VTP Domains, STP and trunking),"}
{"text": "Extensive experience in Windows 2008 R2/2008/2003 Wintel Servers at single or multi-domain platforms."}
{"text": "Provide consultancy services to customers on a variety of network security products including firewalls, VPNs, authentication, load-balancing, data loss prevention and security information and event management."}
{"text": "Wrote Python scripts to parse XML documents and load the data in database."}
{"text": "Proficient in installing and configuring Windows Server 2003, 2008, 2012 and Windows XP, 7 & 8Professional Client Operating Systems"}
{"text": "IDS and IPS event management using CSM including signature updates for SSM Modules, IDSM."}
{"text": "Provides management level reporting of firewall and Intrusion Protection System (IPS) activity on a periodic basis."}
{"text": "Optimize, secure and control the delivery of all enterprise and cloud services and maximize the end user experience for all users including mobile clients using NetScaler."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Professional Experience:"}
{"text": "    "}
{"text": "Client: At&T, Austin, TX\t\t\t\t\t\t                                   Jan 2019 – Present"}
{"text": "Role: Sr. Systems Engineer\t"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Responsible in Massive project Migrating current Brocade Infrastructure to F5 Infrastructure."}
{"text": "Worked to optimize current data center leveraging best practices for aging technology until the upgrade plan is executed."}
{"text": "Work across multiple customers including internal and external constituents ultimately supporting the whole Infrastructure."}
{"text": "Creating Ansible Playbooks for each and every instance in the migration plan"}
{"text": "Developed Ansible scripts for Setup and Configuration of F5 virtual instances."}
{"text": "Advised management on current state and future state recommendations."}
{"text": "Providing all varieties of services over Layer-2, Layer-3 and SME on F5 and Brocade Load Balancer’s. "}
{"text": "Analyze and provide the best practices using Stats on the ports or of the network using various Networking Monitoring tools."}
{"text": "Providing end-to-end infra support for development, staging and production environments."}
{"text": "Configuring GSLB policies for virtual servers on existing brocade Load balancers."}
{"text": "Manage VCMP’s on physical F5 device and setting up them separately for Dev and QA instances."}
{"text": "Running ansible playbooks on remote linux server and testing them by migrating the virtual servers to F5."}
{"text": "Maintain and support Network Architecture Post-Migration. "}
{"text": "Configured F5 LTM solutions on various virtual Instances, which includes Wide IP, Pool Load Balancing Methods, probers and monitors."}
{"text": "Setup and configured LTM instance from the scratch."}
{"text": "Installed and configured high availability Big IP F5 LTM and GTM load balancers 11800 to provide uninterrupted service to customer applications and monitoring the availability."}
{"text": "Created multiple instances for helping the Migration plan to be Implemented successfully."}
{"text": "Implemented security policies utilizing F5 ASM to Secure At&T’s web applications."}
{"text": "Participate in application delivery environment, build activities including creation of virtual servers, SSL profiles, pools, encryption policies and iRules based on customer requirements."}
{"text": ""}
{"text": "Environment: Brocade ServerIron ADX, Big IP F5 LTM, Ansible, Server management."}
{"text": ""}
{"text": ""}
{"text": "Client: Schlumberger, Houston, TX\t\t\t\t\t\t           June 2016 – Dec 2018"}
{"text": "Role: Sr. Network Security Engineer\t"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Modify pilot ISE environment for production scaling and performance"}
{"text": "Works with client engineering groups to create, document, implement, validate and manage policies, procedures and standards that ensure confidentiality, availability, integrity and privacy of information."}
{"text": "Researched, designed and replaced aging Cisco ASA firewall architecture with new next generation Palo Alto appliances serving as firewalls and URL and application inspection."}
{"text": "Executing RADIUS pre-deployment tasks like ISE setup, loading templates into Cisco Prime."}
{"text": "Performed site refreshes on Cisco switching and Aruba wireless infrastructure at several locations."}
{"text": "Configured, implemented and troubleshooting issues on Checkpoint R77.10 Gaia, R75, Cisco ASA 5540, 5000 series firewalls for the client environment. "}
{"text": "Contribute to the development and overall strategy of the penetration testing program"}
{"text": "Manage project task to migrate from Cisco ASA firewalls to Check Point firewalls."}
{"text": "Configured Cisco ISE for Wireless and Wired 802.1x Authentication on Cisco Wireless LAN "}
{"text": "Configuration and Integration of Cisco Identity Services Engine (ISE)"}
{"text": "Worked on VPN configuration, routing, NAT, access-list, security contexts and failover in ASA firewalls."}
{"text": "Palo Alto design and installation (Application and URL filtering, Threat Prevention, Data Filtering). "}
{"text": "Configured and maintained IPSEC and SSL VPN's on Palo Alto, Cisco ASA Firewalls."}
{"text": "Configuring, Administering and troubleshooting the Checkpoint, Palo Alto and ASA firewall."}
{"text": "Configured IPSec VPN (Site-Site to Remote Access) on Cisco ASA (5200) series firewalls."}
{"text": "Working with the rule base and its configuration in Cisco ASA, Palo Alto, Juniper and Checkpoint firewalls."}
{"text": "Deploying ISE Wired and Wireless Authentication, Authorization and Accounting."}
{"text": "Deployment of Cisco ASA firewalls and migration of end of life ASA firewalls to New ASA firewalls"}
{"text": "Cisco Firewalls include ASA 5585x, 5580, 5550 Series Hardware managed through CLI, ASDM as well as CSM. "}
{"text": "Hands-on experience on Tufin Secure Track to reduce risk while increasing compliance and efficiency."}
{"text": "Installation and configuration of Splunk product at different environments. Configured Splunk Searching and Reporting modules, Knowledge Objects, Administration, Add-On's, Dashboards, Clustering and Forwarder Management."}
{"text": "Responsible for maintaining availability, reporting and communication of the SIEM between it, its event-sources and the endpoints."}
{"text": "Configuring & Administration of the Checkpoint Firewall that includes creating Hosts, Nodes, Networks, Static & Hide NAT's."}
{"text": "Worked on manual Penetration testing of client systems, web sites and discovered network vulnerabilities."}
{"text": "Experience in creating multiple policies and pushing them into Checkpoint Firewall (Gateways) and hands-on experience in managing the Checkpoint Management Server and Gaia operating system."}
{"text": "Experience working with Palo Alto firewalls managed through Panorama management platform."}
{"text": "Configure High Availability on Palo Alto firewalls. "}
{"text": "Defining, tracking and maintaining the standard baselines and configuration sets of security devices and implementing industry best practices with regards to Firewall, IDS/IPS, IPsec VPN, SSL VPN."}
{"text": "Applied security enhancement by implementing certificates and RSA keys for authentication."}
{"text": "Installed and administered RSA Secure ID token authentication servers."}
{"text": "Support Citrix NetScaler F5 platform, configuring, implementing, & troubleshooting Citrix NetScaler VIP configuration with health check, policy configurations Access Gateway, & content switching configuration solutions. "}
{"text": "Coordinate and evaluate vendors and associated products/tools in facilitating the Penetration Testing initiatives"}
{"text": "Configured F5 GTM solutions, which includes Wide IP, Pool Load Balancing Methods, probers and monitors."}
{"text": "Designed and developed Azure Cloud Service projects and deployed to Web Apps, PaaS, and IaaS."}
{"text": "Work with the Cisco Meraki Sales team and on strategic sales initiatives like customer outreach and channel training to grow business in targeted regions."}
{"text": "Defined AWS Security Groups which acted as virtual firewalls that controls the incoming traffic and configured the traffic allowing reaching one or more AWS EC2 instances Virtual private cloud (VPC), subnets, Internet Gateways."}
{"text": "Responsible for resolving customer issues involving Routing & Switching, SD-WAN services, Router configuration, and managing field technician dispatches"}
{"text": "Worked on Cisco Nexus 9000 family of switches whose hardware is based on Cisco ACI"}
{"text": "Physically deployed new Cisco Nexus devices, Catalyst and Nexus replacement blades, FWSMs, Cisco ASAs, Citrix NetScaler MPX and SDX chassis."}
{"text": "Verify Firewall status with Checkpoint Monitor. Creation and implementation of Application delivery architectures which includes load balancing on F5 BIG IP modules."}
{"text": "Worked with F5 Load balancing, IDS/IPS, Bluecoat proxy servers and Administrating."}
{"text": "Use of Web application firewall providing reverse proxy-based protection for applications deployed in physical, virtual / public cloud environments."}
{"text": "Involved in the deployment and decommission of VLANs on core ASR 9K, Nexus 7K, 5K and its downstream devices."}
{"text": "Involved in F5 LTM GTM and ASM planning, designing and implementation. Actively involved in F5 ASM policy configuration and deployment. Troubleshoot and Worked with Security issues related to Cisco ASA/PIX, Checkpoint, IDS/IPS and Juniper Net screen firewalls"}
{"text": "Configured High availability, User ID on Palo Alto firewall."}
{"text": "Configured and utilized many different protocols such as OSPF, ISIS, BGP/MP-BGP, OER, MPLS, LDP, Multicast, IPv4/IPv6 protocols."}
{"text": "Utilized knowledge of Spanning Tree Protocol, BGP, MPLS, OSI model layers 1-2 to create network layouts."}
{"text": "Integrating Cisco Stealthwatch with other Cisco Security services such as Firepower and Cisco Identity Services Engine (ISE)"}
{"text": "Stateful firewall, VLAN to VLAN routing, Link bonding / failover, 3G / 4G failover, Traffic shaping / prioritization, WAN optimization, Site-to-site VPN, Client VPN, MPLS to VPN Failover, Active Directory and LDAP integration."}
{"text": "Responsible for investigating Data Loss Prevention using Symantec DLP."}
{"text": "Configured EIGRP routing and BGP route maps to allow traffic from subnets out to the core to Datacenter on the ASR 1002 devices."}
{"text": "Implementation and configuration of Cisco L3 switches 3750, 4500, 6500 in multi VLAN environment with the use of inter-VLAN routing, dot1Q trunk, ether channel"}
{"text": "Configure and troubleshoot Routing protocols such as OSPF and EIGRP for routing internally and BGP for external routing. Configuring and maintaining virtual server environment using VMWARE ESXi, VSphere, VCenter, VBlock."}
{"text": "Worked and maintained various network, application monitoring tools like Solar Winds, Cisco Prime, ForeScout, Wireshark, TCP Dump."}
{"text": "To monitor, track and report changes for all firewalls, routers and switches in the organization by using the Tufin secure track"}
{"text": "Supply documentation and training based articles on different aspects of StealthWatch and NetFlow."}
{"text": "ForeScout CounterACT- NAC, endpoint compliance, real-time intelligence and policy-based control."}
{"text": "Experience with Monitoring wireless networks and performing site surveys."}
{"text": "Involved in Troubleshooting IP Addressing Issues and Updating IOS Images using TFT."}
{"text": "Managed multiple projects resource allocation (in-house, offshore & virtual), leveling & planning for current and future Panorama Program projects using integrated project plans as well as negotiating with multiple teams, resource managers for maximizing resource talents."}
{"text": ""}
{"text": "Environment: Cisco ASA5580/5540/5520, CheckpointR70, R75, R77.20 Gaia, Palo AltoPA-5000/3000, Juniper SSG, SRX, Big IP F5 LTM/GTM, Nexus switches, Routers, TCP/IP, VPN, Bluecoat Proxy servers, IDS/IPS. SIEM and monitoring, BMC Remedy, Cisco Prime, ForeScout CounterACT, Tufin."}
{"text": "        "}
{"text": ""}
{"text": " Client: CITADEL, CT\t\t\t\t\t\t\t\tDecember 2014 –May2016"}
{"text": "         Role: Sr. Network Security Engineer"}
{"text": "\t"}
{"text": "         Responsibilities:"}
{"text": "Implementing Security Solutions using PaloAltoPA-5000/3000, Cisco 5580/5540/5520, Checkpoint firewalls R70, R75, R77.20Gaia and Provider-1/MDM."}
{"text": "Configuration and administration of firewalls, which includes Checkpoint, Juniper and Cisco ASA firewalls."}
{"text": "Configured and maintained rule sets in the firewalls and updated them on the daily basis."}
{"text": "Monitors the network traffic and maintain the records with the help of SPLUNK."}
{"text": "Knowledge of Cisco ASA firewall, VPN, GRE over IPSec tunnel configuration and Route-maps."}
{"text": "Extensive knowledge of and experience configuring and troubleshooting layer 3 routing protocols (EIGRP, OSPF, RIP, BGP) and High Availability on Cisco devices."}
{"text": "Designed AWS Cloud Formation templates to create custom sized VPC, subnets, NAT to ensure successful deployment of Web applications and database templates."}
{"text": "Create and validate SMOPS for upgrade, replace, add and remove Cisco VOD equipment. "}
{"text": "Work with Load Balancing to build connectivity to production & disaster recovery servers through Citrix NetScaler."}
{"text": "Provided engineering support and technical assistance by ensuring the Cisco ISE server is correctly installed and licenses are applied."}
{"text": "Vulnerability scanning using IBM Endpoint Manager & Nessus"}
{"text": "Vulnerability security patching using IBM Endpoint Manager, SCCM & WSUS"}
{"text": "Configuring High Availability using Cluster XL on Checkpoint as well as VRRP and monitor the Sync status for state full replication of traffic between active and standby member."}
{"text": "Innovated with support of Palo Alto for remote and mobile users and for analyzing files for malware in a separate (cloud-based) process that does not impact stream processing."}
{"text": "Researched, designed and replaced Checkpoint firewall architecture with new next generation Palo Alto PA3000 and PA5000 appliances serving as firewalls and URL and application inspection."}
{"text": "Handling Modern related issue like that of RAD & Aruba."}
{"text": "Responsible for the deployment and associated tasks for the implementation of the Tanium Endpoint Security and Systems Management product."}
{"text": "Configuring rules and maintaining Palo Alto Firewalls& Analysis of firewall logs using Panorama. "}
{"text": "Successfully installed Palo Alto PA-3000/PA-5000 firewalls to protect Data Center and provided L3 support for routers/switches/firewalls."}
{"text": "Configured and maintained IPSEC and SSL VPN's on Palo Alto Firewalls and also implemented Zone-Based Firewall and Security Rules on the Palo Alto Firewall."}
{"text": "Exposure to wild fire feature of Palo Alto."}
{"text": "Configuration and Maintenance of Cisco ASA 5580-20, ASA 5540, ASA 5520, ASA 5510 series firewalls."}
{"text": "Hands on Experience with Cisco Wireless Controllers 5500's and 2500's and coming to access points, worked on 3700's, 3500's and 1142 access points."}
{"text": "Configured and installed Cisco routers 2500, 2600, 3601 and 4000 series. 2950 Switches & Link sys wireless access points."}
{"text": "Configuring and install hardware and software required to conduct network penetration testing. "}
{"text": "Configure Syslog server in the network for capturing and logs from firewalls."}
{"text": "Provided tier 3 support for CheckPoint and Cisco ASA Firewalls to support customers, Backup and restore of Checkpoint and Cisco ASA Firewall policies."}
{"text": "Monitoring Traffic and Connections in Checkpoint and ASA Firewall."}
{"text": "Manage project task to migrate from Cisco ASA firewalls to Check Point firewalls."}
{"text": "Configuring and troubleshooting site-to-site IPSEC VPN tunnels using Cisco ASA 5540 for third-party connectivity."}
{"text": "Served a platform for other services that are required within the data center or cloud environment using Cisco ACI."}
{"text": "Installed and configured a variety of Cisco devices like Cisco Routers (1841, 1900, 2600, 2800, 3800, ASRs and more), Cisco switches (3560, 3750, 4507 catalysts, 6500 catalyst Switch and more) and Nexus 7000 series, Nexus 5000 series, Nexus 2K Fabric Extenders and F5 appliances.  "}
{"text": "Applied knowledge of Ethernet switch and router configuration to configuration/design MPLS connections."}
{"text": "Placed in charge of control and maintenance of the SD-WAN laboratory environments, performing version updating before user client official updating."}
{"text": "understanding of Layer2/3 VPN's, MPLS, Metro Ethernet and LAN switching."}
{"text": "Creating object, groups, updating access-lists on Check Point Firewall, apply static, hide NAT using smart dashboard."}
{"text": "Installed and configured high availability Big IP F5 LTM and GTM load balancers like 6600, 6800 to provide uninterrupted service to customer applications and monitoring the availability."}
{"text": "Configuration and Integration of Cisco Identity Services Engine (ISE)."}
{"text": "Consisted of ISE Deployment, Authentication with Active Directory and Microsoft Certificate Authority."}
{"text": "Identified opportunities for implementation of network best practices, particularly F5 load balancer implementations."}
{"text": "Configuring F5 Load Balancers: Adding virtual IPs, nodes, pools and health monitoring."}
{"text": "F5 Big IP iRule programming and troubleshooting."}
{"text": "Worked on F5 solutions/support for migration work of applications and websites from Cisco CSS Load Balancers to the F5 BigIP Load Balancers. "}
{"text": "Configure and Monitor Cisco Sourcefire IPS for alerts."}
{"text": "Working with different teams to gather info for the new request and troubleshoot for any connectivity issues by capturing traffic using TCPDUMP and smart view tracker."}
{"text": "Worked on VPN configuration, routing, NAT, access-list, security contexts and failover in ASA firewalls."}
{"text": "Provide support to help desk for complex/major network problems. Build the rules for the application access across the IPSEC VPN tunnel"}
{"text": "Implemented configuration back-ups using WinSCP, cyberfusion to automate the back-up systems with the help of public and private keys."}
{"text": "Deployment and Management of Bluecoat proxies in forward proxy scenario as well as for security in reverse proxy scenario."}
{"text": "Worked on Blue Coat Proxy SG to safeguard web applications in extremely untrusted environments such as guest Wi-Fi zones."}
{"text": "Performing URL filtering and content filtering by adding URL’s in Bluecoat Proxy SG’s."}
{"text": "Working on the network team to re-route BGP routes during maintenance and FW upgrades."}
{"text": "Running vulnerability scan reports using Nessus tool."}
{"text": "Use of Citrix NetScaler for the application delivery control."}
{"text": "Configure B2B VPN with various business partners and 3rd parties and troubleshoot VPN Phase 1 and Phase 2 connectivity issues including crypto map, encryption domain, psk etc."}
{"text": "Provided administration and support on Bluecoat Proxy for content filtering and internet access to primary, remote site offices and VPN client users"}
{"text": "Follow information security policies, methods, standards, NIST standards and practices to organize information systems, IT reference material and interpret regulations."}
{"text": "Monitor Intrusion Detection Systems (IDS) console for active alerts and determine priority of response."}
{"text": "Actively use SIEM technology for searching and monitoring real-time events for network security and compliance."}
{"text": "Review daily log data gathered from various resources such as sensors, alert logs, firewall logs, content filtering logs."}
{"text": "Experience with converting Cisco 6500 IOS to Cisco Nexus NX-OS in the data center environment."}
{"text": "Working on day-to-day service tickets to solve troubleshooting issues."}
{"text": "Experience using Service Now ticketing tool."}
{"text": ""}
{"text": "Environment: Cisco ASA5580/5540/5520, CheckpointR70, R75, R77.20 Gaia, Palo AltoPA-5000/3000, Big IP F5 LTM/GTM, Nexus switches, TCP/IP, VPN, Bluecoat Proxy servers, IDS/IPS. SIEM and Monitoring, Service Now."}
{"text": ""}
{"text": "Client: Rukus wireless, CA\t\t\t\t\t\t\t\tMay 2012 – November 2014       "}
{"text": "Role: Security Engineer "}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Day-to-Day work involves scheduling firewall policy provisioning and working with users to identify connectivity related issues and troubleshoot using both Smart Utilities and CLI."}
{"text": "Managing and administering Juniper SRX and Checkpoint Firewalls at various zones including DMZ, Extranet (Various Business Partners) and ASZ and internal."}
{"text": "Implementing Security Solutions in Juniper SRX and Net Screen SSG firewalls by using NSM."}
{"text": "Juniper Firewall Policy Management using NSM and Screen OS CLI."}
{"text": "Provide VOD Method of Procedures documentation to customer for software upgrade downgrade release. "}
{"text": "Maintained the following Cisco platforms 7600, 7500, 7200, 7000, 3560, 2900, 2801, 2000, ASA5500, Catalyst 6500, 4500, 3560 and 2900."}
{"text": "Experience as a Sales QA Representative in Production Environment for Network Based Firewall Based Wireline Applications and interact with Net bond team who establishes a firewall connection on a VPN to the Cloud Portal."}
{"text": "Participate in the installation and configuration of new VOD equipment."}
{"text": "Configured and utilized many different protocols such as OSPF, ISIS, BGP/MP-BGP, OER, MPLS, LDP, juniper cast, IPv4/IPv6 protocols."}
{"text": "Utilized knowledge of Spanning Tree Protocol, BGP, MPLS, OSI model layers 1-2 to create network layouts."}
{"text": "Acts as local liaison to identify, correlate, communicate and verify customer impact for nationally managed care team events impacting Video, VOD, network transport, or related IP services. "}
{"text": "Daily technical hands-on experience in the configuration, troubleshooting of Juniper SRX firewalls as well as experience working directly with customer in a service/support environment."}
{"text": "Troubleshooting Firewall Connectivity related issues using Smart view tracker on Checkpoint, NSM Log viewer for Juniper Firewalls."}
{"text": "Creating and Provisioning Juniper SRX firewall policies."}
{"text": "Configure and administer Cisco ASA Firewalls (5585, 5550 and 5540) and use command line CLI, Cisco CSM, ASDM for day-to-day administration."}
{"text": "Active/Standby and Active/Active HA configuration on Cisco ASA Firewalls."}
{"text": "Configuring High Availability using Cluster XL on Checkpoint as well as VRRP and monitor the Sync status for stateful replication of traffic between active and standby member."}
{"text": "Configuring rules and maintaining Palo Alto firewalls and analysis of firewall logs using various tools."}
{"text": "Experience on ASA firewall upgrades to 9.x."}
{"text": "Configured Panorama web-based management for multiple firewalls."}
{"text": "Worked on configuration, maintenance and administration of Palo Alto PA3000 Firewalls and migrating customers from Cisco ASA to Palo Alto in HA network."}
{"text": "Configuring rules and maintaining Palo Alto Firewalls& Analysis of firewall logs using various tools. "}
{"text": "Network hands-on installation experience of (Cisco routers, switches, ASA 5505 firewall, VPN)"}
{"text": "Understand the flow of traffic through the Check Point Security Gateway cluster and troubleshoot connectivity issues using advanced troubleshooting from Command Line Utilities."}
{"text": "Use Tools such as SKYBOX for Firewall Policy optimization and rule base Clean up."}
{"text": "Build and configure Active/Standby Failover on Cisco ASA with stateful replication."}
{"text": "Configure and tweak the inspection policies on Firewall to allow legacy application traffic."}
{"text": "Understand different types of NAT on Cisco ASA firewalls and apply them."}
{"text": "Firewall policy provisioning on Fortinet FortiGate appliances using FortiManager."}
{"text": "Support Blue Coat Proxy in explicit mode for users trying to access the Internet from Corp Network."}
{"text": "Troubleshooting connectivity issues through Blue coat as well writing and editing web policies."}
{"text": "Involved in Upgrading Bluecoat proxy servers from SG900-10s to SG 9000-20B."}
{"text": "Administration Big IP F5 LTM for all Local Load balancing and use GTM for load balancing across Data Centers."}
{"text": "FWSM configurations in single/multiple contexts with routed and transparent modes."}
{"text": "Support Data Center Migration Project involving physical re-locations. "}
{"text": "Environment: Juniper (SRX, JUNOS, ScreenOS, Net Screen SSG), Cisco (CheckPoint, ASA Firewalls), Palo Alto Firewalls, Big IP F5 LTM/GTM, TCP/IP, FortiGate, Service Now."}
{"text": ""}
{"text": "Client: Pluribus Networks, Bengaluru, India\t\t\t\t                 May 2010 – March 2012\t"}
{"text": "Role: Network Engineer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Firewall Policy Provisioning and troubleshoot connectivity issues through firewall."}
{"text": "Performed penetration testing internally for our clients."}
{"text": "I worked on Check Point Security Gateways and Cisco ASA Firewall."}
{"text": "Firewall Clustering and High Availability Services using Cluster XL on Check Point."}
{"text": "Configuring and tweaking Core XL and Secure XL acceleration on Check Point gateways."}
{"text": "Troubleshoot User connectivity issues on Checkpoint and Cisco ASA using CLI utilities."}
{"text": "Packet capture on firewalls and analyzing the traffic using Wire shark utilities."}
{"text": "Troubleshot Clustering issues on Check Point and Sync issues monitoring and fix."}
{"text": "Upgrade of Checkpoint Gateways in Cluster with Minimal downtime. "}
{"text": "Implemented Active/ Standby HA configuration on Cisco ASA Firewalls."}
{"text": "Configuring Cisco ASA firewalls in Single and Multiple Context Mode firewalls."}
{"text": "Upgrade of Cisco ASA Firewall in Active/Standby mode with no down time."}
{"text": "Configuring VPN both B2B and remote access SSL and centralized policy administration using Fort Manager, building FortiGATE High Availability using FortiGATE Clustering Protocol (FGCP)."}
{"text": "Firewall Compliance and Rule remediation for compliance such as SAS 70 Audit."}
{"text": "LAN/WAN level 3 support (diagnose and troubleshoot layer 1, 2, 3 problems) "}
{"text": "Vlan design and implementation, Spanning Tree Implementation and support using PVST, R-PVST and MSTP to avoid loops in the network. Trunking and Port channels creation."}
{"text": "Working with OSPF as internal routing protocol and BGP as exterior gateway routing protocol."}
{"text": "Configuring static NAT, dynamic NAT, Inside Global Address Overloading, TCP overload distribution, Overlapping Address Translation on Cisco ASA Firewalls."}
{"text": "Deployed a Syslog server to allow proactive network monitoring."}
{"text": "Implemented VLANS between different departments and connected them using trunk by keeping one VLAN under server mode and rest falling under client modes."}
{"text": "Configured Firewall logging, DMZs and related security policies and monitoring."}
{"text": "Deployed Jenkins user documentation Switching related tasks included implementing VLANS and configuring ISL trunk on Fast-Ethernet channel between switches."}
{"text": "Documentation and Project Management along with drawing network diagrams using MSVISIO."}
{"text": ""}
{"text": "Environment: CISCO routers and switches, Access Control Server, RIP V2, OSPF, EIGRP, VLAN, Trunk Protocols, CISCO ASA, DHCP, DNS, Spanning tree, Nimsoft."}