{"text": "Name: elizabeth elizabeth"}
{"text": "E-Mail: elizabeth.elizabeth@gmail.com"}
{"text": "Address: New York, United States"}
{"text": "Github: https://github.com/elizabeth"}
{"text": "LinkedIn: https://linkedin.com/elizabeth"}
{"text": "Phone No. 693738112585"}
{"text": "__________________________________________________________________________________"}
{"text": "PROFESSIONAL SUMMARY:"}
{"text": "Over 6+ years of experience in software development as a UI Developer and UI/UX Designer in various environments. "}
{"text": "Experience in web development with a strong background working on open source technologies, including HTML/HTML5, CSS3 etc. "}
{"text": "Experience in UX design with a strong background working in Wireframes (low fidelity and high fidelity) Prototypes, Mock-ups, Storyboard and User Flows. "}
{"text": "Translate business requirements into wireframes, screen mock-up and prototype. "}
{"text": "Experienced in breaking up layered PSD into HTML using CSS. "}
{"text": "Experienced in designing, developing, delivering and implementing data-driven desktop and Web applications for clients and assisting in the development and maintenance of company Web applications (Internet and Intranet) "}
{"text": "Strong problem solving ability and analytical skills and able to integrate quickly into team and work independently toward team goals. "}
{"text": "Strong exposure to Adobe tools - Photoshop, Dreamweaver, Illustrator and Flash."}
{"text": "Extensive experience in visualization, creating visual designs, Product Logos, developing high quality of work, maintaining team, and design reviews, handling whole project through its life cycle. "}
{"text": "Strong experience in SEO (Search Engine Optimization) and Progressive Enhancement. "}
{"text": "Exposure in Responsive Web Designing, Strong experience in Unit Testing, Integration Testing."}
{"text": "Expertise in effective interactive design solutions that meet business, project, and design goals, based on standards and guidelines. "}
{"text": "Skilled in conceptual development of Web-based Projects, including Project Strategy, Functionality, Information Architecture, Navigation Systems. "}
{"text": "Extensive experience in attending client calls, Provide the estimate of effort required to complete a unit of design task to ensure the completion of job within given timeframe. "}
{"text": "Worked with BA to develop and iterate design mock-ups, user stories and other design doc. "}
{"text": "Handled multiple projects and had a review with whole project at the end of the course. "}
{"text": "Very quick learner and keen to adopt new technologies."}
{"text": "Strong team playing skills coupled with the ability to build excellent customer relations."}
{"text": "Technical Skills:"}
{"text": ""}
{"text": "CLIENT: Fidelity Investments, Cary, NC                                                                        Oct'2014-to Present"}
{"text": "Role: UX Designer"}
{"text": "Project Description: Fidelity Investments manages a large family of mutual funds, provides fund distribution and investment advice services, as well as providing discount brokerage services, retirement services, wealth management, securities execution and clearance, life insurance and a number of other services."}
{"text": ""}
{"text": "Roles and Responsibilities"}
{"text": "Established UX design as the first stage of all Web and mobile application developments, instituting a user-centered design (UCD) approach."}
{"text": "Created concept models, heuristic reviews, sitemaps, process flows, sketches, wireframes, prototypes, and detailed specifications for mobile/tablet."}
{"text": "Conducted stakeholder interviews and both remote & in-person user interviews and usability tests. Created click-throughs and prototypes for web and mobile/tablet for use during tests. Synthesized and compiled findings to inform UX strategy."}
{"text": "Designing and developing dynamic web pages using HTML5, Bootstrap, LESS CSS."}
{"text": "Performed all tasks from UI design and implementation to writing code for various features."}
{"text": "Front-end validations are done using JavaScript."}
{"text": "We have followed with Agile and Scrum development methodologies."}
{"text": "Interacted with java controllers (jQuery, Ajax, and JSON to write/read data from back end systems)."}
{"text": "Designed mockups and wireframes using Balsamiq and Adobe Photoshop according to Fidelity standards."}
{"text": ""}
{"text": "Environment: HTML, CSS, Agile methodology, Balsamiq mockups, Adobe Photoshop and Adobe Illustrator."}
{"text": ""}
{"text": "CLIENT: Farmers Insurance, Los Angeles, CA                                                         Jun'2013-to Sep' 2014"}
{"text": "Role:UX Designer"}
{"text": "Project Description:The Farmers Insurance Company which started off as a simple car insurance company for the farmers is now a multi-company insurer and financial services group with a solid reputation. It has approximately 50,000 sales agents in offices across the U.S."}
{"text": ""}
{"text": "Roles and Responsibilities"}
{"text": "Designed and implemented the whole web site using HTML, CSS and JavaScript."}
{"text": "Performed all tasks from UI design and implementation to writing code for various features"}
{"text": "Overhauled Farmer’s Web site to optimize the user experience. Newly launched site catapulted visit-to-lead and visit-to-order ratios, while shrinking page-abandonment rate by 17%."}
{"text": "Involved in Design UI Screen, Created several mock up Using Microsoft visio, balsamiq and Adobe Photoshop."}
{"text": "Created web page layouts using HTML/HTML5 and CSS/CSS3."}
{"text": "We have followed with Agile and Scrum development methodologies"}
{"text": "Debug the application using Firebug to traverse the documents and manipulated the Nodes using DOM and DOM Functions using Firefox and IE Developer Tool bar for IE."}
{"text": "Designed and developed various Web forms using HTML, CSS, and JavaScript."}
{"text": "Participated in analyzing the requirements and depicted them through use cases and scenarios."}
{"text": "Participated in unit testing, integration testing and installation of the system."}
{"text": "Extensive experience using HandleBars and Moustache."}
{"text": "Involved in Web design and development for the UI interface design, graphic design for printed materials and presentations, illustration, logo design. Used HTML, CSS, and JavaScript."}
{"text": "Contributed in decision making of the software and hardware requirements and tool evaluations."}
{"text": ""}
{"text": "Environment: HTML, CSS, JavaScript, JQuery, AJAX, Agile methodology, Angular JS framework,Eclipse,"}
{"text": ""}
{"text": ""}
{"text": "\tClient:Ariba (An SAP Company), Sunnyvale, CA                            May'2011-Apr’2013"}
{"text": "Role:UX Designer"}
{"text": ""}
{"text": "Roles and Responsibilities"}
{"text": "Designed and implemented the whole web site using HTML, XML, CSS, Flash, PHP/MySQL and JavaScript."}
{"text": "Performed all tasks from UI design and implementation to writing code for various features"}
{"text": "Designed high-impact, user-centered Web sites with strong emotional appeal, sophisticated production values and intuitive navigation to maximize user engagement and cement powerful brand identities."}
{"text": "Involved in Design UI Screen, Created several mock up Using HTML, CSS and JavaScript."}
{"text": "Front-end validations are done using JavaScript."}
{"text": "Designed and implemented new module for Inventory division."}
{"text": "Used UI Development using HTML, and coded Java components which Retrieves data using SQL from Oracle database."}
{"text": "Designed and developed various Web forms using HTML, CSS, and JavaScript."}
{"text": "Participated in analyzing the requirements and depicted them through use cases and scenarios."}
{"text": "Participated in unit testing, integration testing and installation of the system."}
{"text": "Involved in Web design and development for the UI interface design, graphic design for printed materials and presentations, illustration, logo design. Used HTML, CSS, and JavaScript."}
{"text": "Contributed in decision making of the software and hardware requirements and tool evaluations."}
{"text": ""}
{"text": "Environment: HTML, CSS, JavaScript, JQuery, AJAX, Usability Testing, Agile methodology, Eclipse."}
{"text": ""}
{"text": "Client:ICICI Bank Ltd, INDIAMay'2009-Mar'2011"}
{"text": "Role:Web/UI Developer"}
{"text": "Description: ICICI Bank is India’s second largest bank with total assets of about US $38.5 billion. It provides all kinds of finance needs from securities to auto finance, banking, corporate and retail. CMD Issue Collection Application was developed for Collection of Application money in respect of IPO/Bonds/Debt instruments by Capital Market Division (CMD) branch and other identified branches of ICICI Bank Ltd. The software application facilitated data entry for generating various Reports."}
{"text": ""}
{"text": "Roles and Responsibilities"}
{"text": "Design the UI layer for the application used for Legacy Migration."}
{"text": "Analyzed, Designed and developed the system to meet the requirements of users."}
{"text": "Participated in daily pulse of the application to come up with UI and provide best possible recommendations for the application from UI standpoint."}
{"text": "Developed screen functionality using HTML, CSS, JavaScript and JQUERY."}
{"text": "Used AJAX for implementing part of the functionality for Customer Registration, View Customer information modules."}
{"text": "Developed UI using JavaScript, HTML,CSS, JavaScript validations and XML."}
{"text": "Implemented interaction between frontend and backend using the JSON object."}
{"text": "Wrote Cross Browser code of CSS and JavaScript, Angular.jsfor Internet Explorer and Firefox."}
{"text": "Written CSS to provide table free layout to user interface screen."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}