{"text": "Name: helen helen"}
{"text": "E-Mail: helen.helen@gmail.com"}
{"text": "Address: Bozhou, China"}
{"text": "Github: https://github.com/helen"}
{"text": "LinkedIn: https://linkedin.com/helen"}
{"text": "Phone No. 408705511298"}
{"text": ""}
{"text": "PROFESSIONAL SUMMARY:"}
{"text": "7+ years of extensive experience in Information Technology analysis and Certified Scrum Master Professional with coaching and facilitating Scrum teams."}
{"text": "Responsible, Collaborative, Committed and knowledgeable Certified Professional Scrum Master (PSMI) from Scrum.org"}
{"text": "Certified Team Kanban Practitioner from Lean Kanban University"}
{"text": "Certified Scaled Agilest (SA) Leading SAFe from Scaled Agile Framework"}
{"text": "SAFe Certified Scrum Master (SSM)"}
{"text": "Active member of Project Management Institute, Agile Certified Practitioners [PMI ACP]"}
{"text": "Excellent team motivation skills with servant leadership qualities to nudge, steer, and help team in fulfilling scrum goals by facilitating scrum ceremonies"}
{"text": "Strong experience in understanding SAFe Agile concepts, best practices and planning concepts"}
{"text": "Hands on experience in handling Agile teams practicing Acceptance Test Driven Development process (ATDD), Test Driven Development (TDD) cycle"}
{"text": "Expert in motivating agile transitioning teams to adapt agile methodologies and self-organizational traits"}
{"text": "Experienced Agile Coach and workshop facilitator (RAD, JAD, and DRP sessions)"}
{"text": "Expert in doing Root Cause Analysis for identifying and resolving team’s performance hurdles and suggested fool-proof techniques for successful completion of agile sprints; effective utilization of the sprint retrospective meetings"}
{"text": "Expertise in conducting Story mapping& Sprint planning practices and illustration of the vision of the project"}
{"text": "Expert in using various techniques to refine the product backlog with Business value and Effort estimates by facilitating product refinement meetings"}
{"text": "Empowering the team to knock blockers out themselves and build trust to communicate clearly and objectively"}
{"text": "Expert in handling time boxed daily scrum calls with brisk and relevant discussions"}
{"text": "Inspection and adaption of the team activities in sprint retrospective meetings "}
{"text": "Highly experienced in tracking and communicating sprint release progress through burn-down charts"}
{"text": "Expert in evaluating User Stories from epics and refining Backlog list with Business owner "}
{"text": "Training and mentoring developers and quality analysts in understanding agile methodologies "}
{"text": "Effective blocking of the scrum team impediments and deviations from cross functional teams. "}
{"text": "Worked with Architects, Data modelers, Developers, testing teams thereby coordinating efforts."}
{"text": "Proven success in eliciting requirements, GAP analysis, Risk assessment, and SWOT analysis."}
{"text": "Leading and working with teams to examine and solve business problems by accurately analyzing the needs of clients and helping them achieve improved quality and value for their customers."}
{"text": "Experience in networking with individuals at various levels and possess outstanding skills in structuring and facilitating Joint Application Design sessions."}
{"text": "Involving in Feasibility and Estimation meetings to gain in depth knowledge of the entire scope of the project"}
{"text": "Collaborating and analyzing with all the strategic business units to define the areas for implementation of Business re-engineering."}
{"text": "Effectively handling sign off process with stake holders at different levels and executing good conflict resolution approaches."}
{"text": "Dedicated & Self-motivated individual with proven leadership capabilities, verbal and written communication skills, problem-solving skills and time management skills."}
{"text": ""}
{"text": "Technical Skills:"}
{"text": "SDLC Methodologies:\t\tScrum, Waterfall-Scrum, Waterfall, SAFe, Kanban"}
{"text": "Business Skills: \tChange Management, Impact Analysis, JAD Sessions, Interviews, SWOT analysis, Project Planning, Project Scheduling, and Project Budgeting."}
{"text": "Requirement Management:\tMS Office suite, JIRA, Rally, TFS, Stories Onboard"}
{"text": "Modeling Tools: \t\tRational Rose, MS Visio, Mockups Screens, Wireframes"}
{"text": "Project Management Tools: \tMS Project, MS SharePoint Server"}
{"text": "Testing Tools:\t\t\tHP QC, HP ALM, Load Runner"}
{"text": ""}
{"text": "Certifications:"}
{"text": "Scrum Master Certified: Professional Scrum Master 1(PSM1)"}
{"text": "SAFe Certified Scrum Master (SSM)"}
{"text": "Scaled Agilest (SA)"}
{"text": "Team Kanban Practitioner (TKP)"}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": "Aetna/ PayFlex, Downers Grove, IL \t\t\t\t\t\t\t\t"}
{"text": "Sr. Scrum Master \t\t\t\t\t\t\t\t\t\tMarch 19 – Present"}
{"text": "Description: Aetna is the Second Largest Healthcare provider in the world with healthcare delivery in all 50 states through more than 1.1 million health care professionals and more than 674,000 primary care doctors. Worked in several compliance and timeline driven projects in multiple domains including Claim Adjudication, Claims reporting, and HR Integration and Corporate functions.  "}
{"text": "\n Roles and Responsibilities:"}
{"text": "Responsible for estimation, planning, scheduling, tracking, co-ordination and facilitation for multiple projects in PayFlex.  "}
{"text": "Co-ordinated, managed and tracked extensive Infrastructure work (budget $2.4M) in multiple work streams and worked as Liaison to deliver those work effectively.  "}
{"text": "Involved in helping the product owner maintain the product backlog.  "}
{"text": "Monitor and track progress using TFS (Team Foundation Server) toolset that is utilized by various teams.  "}
{"text": "Facilitate scrum ceremonies (daily standups, Sprint Planning Demo and retrospective or any additional meetings) as needed.  "}
{"text": "Helped the team continuously make progress on the project by making sure each person is working on the right tasks. "}
{"text": "Helped the team to remove any obstacles to the team members' progress and protecting the team from distractions.  "}
{"text": "Guided the team and assisted them in estimating the user stories in story points."}
{"text": "Educated the team in how to manage an overall release plan, velocity forecast with agile metrics through standard agile tooling such as TFS"}
{"text": "Engaging with customer business stakeholders to understand business & compliance requirements, as applicable. "}
{"text": "Facilitate multiple project meetings that ranged from Senior Leadership, Business/IT Stakeholders and the Project Teams.  "}
{"text": "Collaborates with technical resources, product owner and analysts to break down project needs and user feedback into user stories and tasks, which can be added to sprint backlog. In addition, drive stories to ready state in preparation for the upcoming sprint. "}
{"text": "Work with the team and state \"definition of done\" criteria"}
{"text": "Manage sprint velocity-related metrics "}
{"text": "Lead multiple Scrum teams through the agile process in the delivery of enterprise software development projects "}
{"text": "Implement Agile practices to facilitate the incremental and adaptive delivery of software products within the Scrum teams "}
{"text": "Work along with product owner and product manager to ensure quality product is being delivered"}
{"text": "Participate in elaboration sessions, feature breakdown sessions and"}
{"text": "Lead bi- weekly project reporting meetings to Executive sponsors"}
{"text": "Provide input into processes, standards or plans in support of the business. "}
{"text": "Effectively lead the project team or the responsible area to align with the business objectives, project schedule"}
{"text": "Ensure prioritization of requirements and code module completions meet customer expectation. Also Identify Process gaps and introduce improvements  "}
{"text": "Leading user acceptance testing of newly built solution by coordinating with IT and Business stakeholder teams.  "}
{"text": "Organization of daily, weekly and periodic sessions for technical issues resolution, technical solution design progress review and technical team performance improvement based on stakeholder feedback respectively."}
{"text": "Planning, monitoring and controlling the assigned IT projects throughout their Software Development Life Cycle. Planning and coordination of release management with system & application teams. Production implementation planning & postproduction support activities. "}
{"text": "Overseeing schedule, scope of work, estimated cost, quality of work, technical and functional risks and issues and deciding respective course of action to resolve any impediments to ensure technical work is on track for completion based on agreed upon guidelines between the customer and application teams  "}
{"text": "Managing resource allocation and finance/budget of project through PlanView and Clarity extensively.  "}
{"text": "Regular status reporting to steering committee/executive committee involving senior leadership from IT and business. "}
{"text": "Ensuring successful implementation of projects and getting business acceptance of the closure of project. \n"}
{"text": "Micron Technology, Boise, ID"}
{"text": "Scrum Master\t\t\t\t\t\t\t\t\t\t\t           May’ 18 – Feb’ 19"}
{"text": "Description: Micron Technology, Inc. is an American global corporation based in Boise, Idaho. The company is a holding company for subsidiaries engaged in the design and production of computers, semiconductors, and other related products.\t"}
{"text": "\t\t\t\t\t\t\t\t\t"}
{"text": "Roles and Responsibilities"}
{"text": "Worked with Agile Coach in Standing-Up New Agile team transitioned from Waterfall methodology"}
{"text": "Facilitated 4 weeks training sessions in educating the team in Agile Methodology and Scrum Framework"}
{"text": "Assisting the Agile Coach with various action plans on education the new team on Agile methodology"}
{"text": "Organized and facilitated sprint planning, daily stand-up meetings, reviews, retrospectives and other Scrum-related meetings"}
{"text": "Helped the team to create clear and concise epics/features/stories"}
{"text": "Facilitated can conducted workshop for the team to create user stories using INVEST and SMART principals"}
{"text": "Guided the team and assisted them in estimating the user stories in story points."}
{"text": "Assisting team to remove impediments by having an understanding the control and release processes"}
{"text": "Educated the team in how to manage an overall release plan, velocity forecast with agile metrics through standard agile tooling such as TFS"}
{"text": "Assist with internal and external communication, improved transparency, and radiated information"}
{"text": "Assisted with prioritization of the Features and User Stories"}
{"text": "Conducting daily stand-up meeting with on shore and offshore team members and make sure they answer all the three questions."}
{"text": "Facilitated the Product Team meetings with Product owner, Product manager and Stakeholders and review the features and release plan"}
{"text": "Built relationship with Product owner and other stake holders to facilitate team's interaction with them"}
{"text": "Assisting Product Owners in creation and maintenance of Product Backlog"}
{"text": "Guiding team members on Agile principles and providing general guidance on the methodology"}
{"text": "Continuously learned Agile/Scrum techniques and shared findings with the team"}
{"text": "Engaged with other Scrum Masters in Scrum Master CoP to increase the effectiveness of the application of Scrum in the organization.     "}
{"text": "United Health Group, Minneapolis, MN"}
{"text": "Scrum Master\t\t\t\t\t\t\t\t\t         \t\tDec’ 16 – March 18"}
{"text": "Description: UnitedHealth Group Inc. is an American for-profit managed health care company based in Minnetonka, Minnesota. As of 2018, it is ranked #5 on the Fortune 500 rankings of the largest United States corporations by total revenue. UnitedHealth Group offers health care products and insurance services\t"}
{"text": ""}
{"text": "Roles and Responsibilities:"}
{"text": "Being a servant leader coached the team to improve continuously using agile principles."}
{"text": "Organized Product backlog refinement, Sprint planning, Sprint reviews and Sprint retrospective"}
{"text": "Laying foundation for the team by planning and executing sprint zero."}
{"text": "Acted as Agile Coach, Scrum Master and Servant Leader for technical cross functional teams implementing, Scrum, and Kanban"}
{"text": "Educated Agile teams on the use of Kanban and flow to optimize the team’s work"}
{"text": "Efficiently handled two Agile teams that are part of two release trains"}
{"text": "Facilitated 4 PI planning sessions, managed 2 ART's and identified the scope, dependencies, risks of the project"}
{"text": "Work with RTE, scrum masters and product owners on identifying the objectives for every PI"}
{"text": "Conduct Scrum of Scrums with other dependent program teams to identify the cross-team dependencies"}
{"text": "Create change requests, get approvals and go through CAB (Change Approval Board) meetings for PRODUCTION related changes"}
{"text": "Mentored and empowered teams towards making appropriate commitments through story selection, establishing acceptance criteria, automated test-driven development (ATDD) and test-driven development (TDD), story sizing and task definition"}
{"text": "Aggregates team timelines, creates a roadmap and publishes for visibility and transparency "}
{"text": "Establishes the annual calendars for Iterations, Program Increments, etc. "}
{"text": "Monitors, tracks and makes decisions on issues and risks at the program level, escalates impediments"}
{"text": "Lead the team to be self-directed with strong accountability, decision making, conflict resolution and transparency"}
{"text": "Ensured adoption of engineering practices, DevOps, and Agile architecture"}
{"text": "Ensured a faster flow of value to end user using mechanisms for tighter integration of development and deployment operations (DevOps)"}
{"text": "Act as the communications conduit to executive sponsors and program board "}
{"text": "Assess team, Develop and implement program governance along Agile and SAFe methodologies "}
{"text": "Using Agile and SAFe methodologies, manage the coordination, status reporting, schedules and stability of product-oriented agile work efforts  "}
{"text": "Collaborating with the Technical Architects and Business Partners to discuss customer, system needs and monitor if the team deliverables are meeting the customer, system needs"}
{"text": "Worked as a coach for Scrum Masters, Product Owners and Product Managers to understand SAFe practices and helped the cross-application teams adapt to SAFe"}
{"text": "Involved in program management improvement and standardization events to improve efficiency"}
{"text": "Facilitated use of Test-Driven Development (TDD), Continuous Integration (CI) and Pair programming for robust code development."}
{"text": "Educated the team in how to manage an overall release plan, velocity forecast with agile metrics through standard agile tooling such as JIRA"}
{"text": "Protect scrum team from outside distractions, impediments or team conflicts and maintain focus on product backlog and project timelines."}
{"text": "Delivering Minimum Viable Product to the Business owners from where the consumption got productionable"}
{"text": "Involved in breaking down the concepts into user stories and streamlining the daily delegation of incoming issues using Issue tracking system"}
{"text": "Resolved impediments/roadblocks to re-create the focus on accomplishing the sprint goal."}
{"text": "Conducted retrospective meetings to inspect the team’s performance and adapt new changes"}
{"text": "Negotiating with Product Owner in backlog management for scope creeps and continuous delivery"}
{"text": "Tracking and Radiating team metrics through burn-down charts to higher executives"}
{"text": "Actively contributed throughout the scrum/agile process in daily standups, functional and technical grooming sessions. "}
{"text": "Steer the team to stick to short answers to the three questions; steer them away from discussing problems or details during the daily scrum"}
{"text": " "}
{"text": "State Farm Insurance, Bloomington, IL\t\t\t\t\t\t\t\t\t\t   "}
{"text": "Scrum Master \t\t\t\t\t\t\t\t\t\t\t            Jun ‘16 - Dec’ 16"}
{"text": "Description: State Farm is an American group of insurance and financial services companies in the United States. The group's main business is State Farm Mutual Automobile Insurance Company, a mutual insurance firm that also owns the other State Farm companies"}
{"text": ""}
{"text": "Roles and Responsibilities:"}
{"text": "Worked with cross-functional teams in an Agile-Scrum environment which transitioned from waterfall methodology"}
{"text": "Help team to overcome impediments as a top priority and ensure relevant team members meet to overcome impediments before doing regular work"}
{"text": "Engaged in agile program management and created product concepts based on the organisation’s strategy"}
{"text": "Audit sprint metrics and convey all the data to Product Management teams"}
{"text": "Rendered hands-on supervision and mentorship to a team which was entirely new to Agile Scrum methodology"}
{"text": "Successfully met the goal of managing a project outside the area of technical expertise"}
{"text": "Scheduled releases and kept track of development status, inspected and adapted with the team to constantly improve performance and responsiveness."}
{"text": "Introduced Hand-shake meeting to facilitate effective transition of work between on-shore and off-shore team members"}
{"text": "Facilitated daily standup meetings and multiple meetings for the development teams"}
{"text": "Facilitated product backlog refinement meetings for the product owner to refine and prioritize the stories"}
{"text": "Conducted Sprint planning A and Sprint Planning B meetings for better understanding of the user acceptance criteria and proper planning of the sprint"}
{"text": "Organized Sprint review meetings for appreciation of the developed product by product owners and other stakeholders"}
{"text": "Helped the product owners to come up with set of stories for better understanding for estimation and development. "}
{"text": "Ensure (help) the Product Owner refines and prioritizes the backlog and ensure the product owner prepares a sprint goal"}
{"text": "Met goal of addressing and resolving issues within 24 hours and managed the lifecycle of code development, from ideation to sprints to deployment"}
{"text": "Facilitated and participated in almost every Scope lock meeting to finalize the Requirements and deliverables of each sprint."}
{"text": "Communicated with other cross functional teams like Security, Networking and legal & compliance teams."}
{"text": "Assisted in defect tracking and coordinated with developers to quickly resolve the defects associated with them."}
{"text": "Provided support to offshore and onsite testing team in defect triaging, analyzing and help identifying the bugs."}
{"text": "Ensured Scrum Framework is followed including the required meetings and artifacts, worked closely with the Product Owner to ensure product backlog and release plans are clear "}
{"text": "Resolved variety of project issues including Scope Creep and technical challenges"}
{"text": "Worked on documenting the project’s statement of work document and maintained product backlogs, current priorities with business and IT leads. "}
{"text": "Assisted QA team to develop test plan, test design, & test scenarios to perform black box, Regression, & UAT."}
{"text": "Involved in Defect tracking & management & generating error reports with the testing team."}
{"text": ""}
{"text": "SoulPro Infologix Pvt. Ltd, Hyd, India.\t\t\t\t\t\t\t\t\t\t"}
{"text": "Agile Business Analyst/ Scrum Master\t\t\t\t\t\t\t\tSept’ 12 -Nov’ 15"}
{"text": "\t\t\t\t\t\t\t           "}
{"text": "Roles and Responsibilities:"}
{"text": "Conducting story mapping and story boarding session to elicit high level features and goals from the Product owners"}
{"text": "Creating good user stories and tasks using INVEST and SMART Principles"}
{"text": "Developing user stories and grooming them with product owners throughout the agile lifecycle"}
{"text": "Serve as a liaison between product owner and scrum team for communicating well developed user stories"}
{"text": "Assisted with the development of project schedules using MS Project"}
{"text": "Analyzed an efficient production workflow using Microsoft technology"}
{"text": "Grooming well developed user stories with user acceptance criteria and mockups if required for developing a good product backlog "}
{"text": "Creating data flow diagrams and business process flow diagrams for better understanding of the business needs by the scrum team"}
{"text": "Creating the Gap analysis document by analyzing the as is process and understanding the future need"}
{"text": "Negotiating effectively with Product owner on the release priorities and exceptional scope creep."}
{"text": "Significant contribution to stories development in product backlog, sprint backlog and release backlog meetings."}
{"text": "Active participant in Sprint planning, Sprint retrospective, Sprint review and Product review meetings."}
{"text": "Utilizing Sprint retrospective Meetings to understand the impediments and improve the productivity of the team."}
{"text": "Involving users actively in User Acceptance Tests (UAT) between development team and the end users from the business team"}
{"text": "Participated in daily stand-up meetings and sprint review meetings."}
{"text": "Developing Business requirement document and responsibly taking the signoffs at each stage."}
{"text": "Documenting functional requirement documents, use cases, mockups and roles documentation as needed"}
{"text": "Checking the integrity of the newly added features and their effect to the existing ones with integrity testing and regression testing"}
{"text": "Conducting smoke test, black box test, alpha test and beta test along with Quality Assurance teams."}
{"text": "Coordinate development activities by managing the technical requirements in a requirements traceability matrix."}
{"text": ""}
{"text": "EDUCATION"}
{"text": "Bachelor of Technology "}
{"text": "Mechanical Engineering"}
{"text": "GITAM University, Visakhapatnam, Andhra Pradesh, India"}
{"text": ""}
{"text": "Masters of Science"}
{"text": "Engineering Management"}
{"text": "Central Michigan University, Michigan"}