{"text": "Name: ruth ruth"}
{"text": "E-Mail: ruth.ruth@gmail.com"}
{"text": "Address: Sydney, Australia"}
{"text": "Github: https://github.com/ruth"}
{"text": "LinkedIn: https://linkedin.com/ruth"}
{"text": "Phone No. 546103441363"}
{"text": ""}
{"text": "Professional Summary"}
{"text": ""}
{"text": "An experienced professional with over 7 years of experience as Front End Developer/UI (User Interface) in developing web applications using HTML5, CSS3, JavaScript, JSF, AJAX, jQuery, JSON, Bootstrap and Angular JS."}
{"text": "Extensive experience in various UI widgets using JavaScript libraries like Angular.js, Angular2.js, Backbone.js, Require.js, Common.js, Node.js, React.js, for developing Rich Internet Applications."}
{"text": "Strong understanding of CSS preprocessors such as SASS and LESS."}
{"text": "Hands on experience of Responsive Web Design using Media Queries, Twitter Bootstrap and jQuery Mobile."}
{"text": "Expertise with MVC JavaScript Frameworks like Angular JS for fast paced web development and better functionality."}
{"text": "Experience in working with React and Redux and created interactive and reusable UI Components. "}
{"text": "Experience in all phase of SDLC like Requirement Analysis, Implementation and Maintenance, and extensive experience with Agile and SCRUM."}
{"text": "Experience with GitHub for source code management, GIT for version control, Clear Quest for bug fixing and Grunt, Gulp, Browserify, Npm package manager."}
{"text": "Knowledge of node.js, express.js as well as NoSQL data bases such as mongo and couch."}
{"text": "Expertise with browser debugging tools and troubleshooting existing code using Firebug, IE Tester, Chrome Inspector, Responsive Inspector."}
{"text": "Knowledge of Karma, Jasmine Unit Testing framework to conduct unit testing for Test Driven Development (TDD)."}
{"text": "Experience in Software Development Life-Cycle (SDLC) preparing Requirement Specification documents, User Training documents and Technical Help documents."}
{"text": "Great understanding of Web2.0 and W3C Standards."}
{"text": "Technical Skills"}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "Professional Work Experience"}
{"text": ""}
{"text": "J.P. Morgan (Columbus, OH)\t\t\t\t\t                June 2015 to Present"}
{"text": "Sr. Front End/UI Developer.\t\t \t      \t\t\t         "}
{"text": "Responsibilities: "}
{"text": "Participated in development of a well responsive single page application using AngularJS, React.js framework, JavaScript, ECMAScript6, TypeScript and jQuery in conjunction with HTML5, CSS3 standards with Front End UI team. "}
{"text": "Designed and developed Prototype module using Angular.js implemented Pagination, and Data-grid added additional functionality for ui-grid"}
{"text": "Worked with JPMC’s proprietary JavaScript framework which is MVC built on top of the knockout."}
{"text": "Developed and created the web pages using Adobe Creative Suite (CS), Adobe Flash, Dream weaver and Photoshop. "}
{"text": "Designed data formatted web applications using HTML5, CSS3 and deploy the script by client side scripting using AngularJS."}
{"text": ""}
{"text": "Developed UI and pagination using Angular.js and Node.js."}
{"text": "Working with React.js for making changes to the existing web application and creating reusable UI components."}
{"text": "Implemented latest HTML5 and CSS3 features like creating various effects, shading, 2D 3D animation, Shapes, Handling multimedia files and many others."}
{"text": "Handled complex JSON responses, converted and binded them to the $scope object."}
{"text": "Used UI bootstrap for building rich internet applications, Angular.js to optimize in-browser use and to load the module and to improve the Speed."}
{"text": "Involved in writing application level code to interact with APIs, RESTful Web Services using AJAX, JSON. "}
{"text": "Developed data insertion forms and validated them using JavaScript."}
{"text": "Created Master Pages, CSS Styles Sheets and Integrated to Silver light and got approval from Business Stake holders. "}
{"text": "Worked closely with SQA team in fixing the reported bugs/defects and checking cross platform compatibility. "}
{"text": "Successfully executed all the test cases and fixed any bugs/issues identified during the test cycles.\n "}
{"text": "Environment: HTML5, CSS3, Java Script, ECMAScript6, JSON, jQuery, AJAX, Angular.js, React.js (Redux), Node.js, Responsive Web Design, Bootstrap, MongoDB, Photoshop, Dreamweaver, DOM, Restful, jQuery UI, agile, SQL and Windows. "}
{"text": ""}
{"text": ""}
{"text": "Starbucks (Seattle, WA)                                                                                          Dec2013 - June 2015"}
{"text": "Designation: Front End Developer\t\t\t                             \t            "}
{"text": "Responsibilities:"}
{"text": "Extensively involved in design discussions and user experience sessions to provide inputs on the layout."}
{"text": "Created a custom, responsive web application to replace line-of-business web applications."}
{"text": "Created reusable HTML templates and style sheets based on UI standards and guidelines."}
{"text": "Designed the front-end applications, user interactive (UI) web pages using web technologies like JavaScript, HTML5 and CSS 3."}
{"text": "Worked on building the responsive web pages using bootstrap."}
{"text": "Implemented different validation control on the web pages using AngularJS."}
{"text": "Made enhancements to existing CSS and DIV tags, made upgrades using Twitter Bootstrap model."}
{"text": "Closely worked with Business Analysts for requirements analysis and issue resolution with functional specifications for Quote creation, Finalizing Deadlines, Tool Configuration & Reporting."}
{"text": "Implemented MVC Architecture and developed presentation layer using HTML5, CSS3, JavaScript, jQuery and AJAX."}
{"text": "Used CSS based design techniques to eliminate table-based layouts and use of CSS Sprites to speed up page loading and improve the website performance with cross-browser compatibility and SEO."}
{"text": "Extensively used jQuery plug-in like Auto populating select-box, Search plug-in, calendar plug-in, ajax-queue plug-in and Auto populating multiple select-boxes."}
{"text": "Used MVC Frameworks, Media Queries & CSS3 to make web page Fluid and Responsive."}
{"text": "Environment: HTML5, CSS3, jQuery, Angular.JS, Handlebars.JS, Ajax, Bootstrap, JSON, web services, RAD, Sublime Editor, Apache and Static server access, JavaScript (Debugging)."}
{"text": ""}
{"text": ""}
{"text": "T-Mobile (Seattle, WA)            \t\t\t                                  Oct 2011 – Dec2013"}
{"text": "Designation: Web Developer/designer\t                                             "}
{"text": "Responsibilities:"}
{"text": "Designed and development of Web pages using HTML, CSS including Ajax controls and XML."}
{"text": "Coded JavaScript for page functionality and Pop up Screens."}
{"text": "Developed data insertion forms and validated them using JavaScript."}
{"text": "Used JavaScript and XML to update a portion of a web page thus reducing bandwidth usage and load time and add modal dialog in web pages to get user input and requests."}
{"text": "Validated input values to make sure that they will be accepted before they are submitted to the server."}
{"text": "Used JavaScript to make dropdown menus on web pages and display part of a web page upon user request."}
{"text": "Drove multiple component design session parallel, creating design artifacts according to specifications."}
{"text": "Utilized jQuery UI Library to create various components for the web application."}
{"text": "Developed next-gen UI components such as accordions by using CSS3."}
{"text": "Wrote Object Oriented JavaScript to create modules and extensively debugged with Firebug and other debugging tools."}
{"text": "Facilitated discussions with Systems Analyst to identify technical requirements."}
{"text": "Creating cross-browser compatible and standards-compliant CSS3-based page layouts."}
{"text": "Utilized new software methodologies to be able to adapt to changes in requirements quickly. "}
{"text": "Environment: HTML, CSS3, JavaScript, jQuery, AJAX, Usability Testing, Agile methodology, Eclipse."}
{"text": ""}
{"text": "Zensoft Services Pvt. Ltd (Pune, India) \t\t\t            March 2010 – Oct2011"}
{"text": "Designation: UI Developer\t\t\t                                                         "}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Analyzed, Designed and developed the systems to meet the requirements of business users."}
{"text": "Participated in the design review of the applications to come up with UI and provide best possible Recommendations for the applications from UI standpoint."}
{"text": "Developed screen functionality using HTML, CSS, JavaScript."}
{"text": "Wrote Cross Browser code of CSS and JavaScript for Internet Explorer and Firefox."}
{"text": "Involved in fixing Front-End issues with current layouts."}
{"text": "Worked with the design team to provide crisp graphic designs."}
{"text": "Implemented different validation control on the web-pages using JavaScript."}
{"text": "Environment:  HTML, CSS, jQuery and JavaScript."}
{"text": "Professional Qualification"}
{"text": ""}
{"text": "Bachelors in Computer Engineering (RTM, Nagpur University, India)"}
{"text": ""}