{"text": "Name: martha martha"}
{"text": "E-Mail: martha.martha@gmail.com"}
{"text": "Address: Handan, China"}
{"text": "Github: https://github.com/martha"}
{"text": "LinkedIn: https://linkedin.com/martha"}
{"text": "Phone No. 27015091960"}
{"text": "PROFESSIONALSUMMARY \nSeeking a challenging position in Quality Assurance Analyst field wherein the analytical, technical, problem solving, design, communication and interpersonal skills acquired through education and experience that can be effectively implemented to contribute towards the growth of the concerned organization. Strong ability to work on own initiative as well as part of the team. Proven leadership skills involving managing, developing and motivating teams to achieve their objectives and highly dedicated in maintaining the high quality standards."}
{"text": ""}
{"text": "7+years of experience as a Quality Analyst in analyzing Business Requirements, designing Test Scenarios and Test cases for Web and Client/Server applications . "}
{"text": "3+ years of experience as PeopleSoft Financials Consultant for IT, business, and finance industries ."}
{"text": "Fluent understanding of PeopleSoft Financial Management process throughout lifecycle, including design, configuration, development, integration, testing and deployment ."}
{"text": "Strong knowledge of all the phases of Software Development Life Cycle and Role of a QA"}
{"text": "Good understanding and Knowledge of Waterfall and Agile methodologies ."}
{"text": "Complete understanding and knowledge of STLC that includes Test Strategy, Test    Plan, Test Design, Test Execution and Bug Reporting."}
{"text": "Expertise in analyzing Business Requirements and Specifications and development of Test cases and executing them ."}
{"text": "Experience in Manual and Automated Testing using Mercury/HP Suite's tools: Quick Test Professional and Quality Center ."}
{"text": "Expertise in Quality Center all modules in managing the whole testing process."}
{"text": "Good Experience on Selenium IDE and creating Scripts in selenium --RC by using Java "}
{"text": "Good knowledge in performing different types of Testing like Integration, System, Regression, Functional, Performance and User Acceptance Testing (UAT) ."}
{"text": "Good knowledge on Software Testing concepts and practices ."}
{"text": "Good working Knowledge on All phases of Testing Process including Test Planning, Test Design, and Test case Execution and Test Closure."}
{"text": "Ability to generate Test Scenarios and Test Cases and to create Test Data ."}
{"text": "Experience in using Automated Testing Tools such as Quick Test Professional (QTP) on Applications developed in .Net, Java and Siebel."}
{"text": "Knowledge on Defect tracking and change management using Quality Center ."}
{"text": "Knowledge on Writing and Executing SQL statements ."}
{"text": "Experience in reviewing skills in the Requirements for testability, conducting walkthroughs with developers and other team members ."}
{"text": "Demonstrated strengths in communicating with all levels within organization and possesses excellent interpersonal, written and oral communication skills."}
{"text": "Highly trainable, fast learner, ambitious and hardworking, committed to excellence."}
{"text": "Excellent Analytical, Problem-Solving and Documentation skills ."}
{"text": ""}
{"text": ""}
{"text": "TECHNICAL SKILLS"}
{"text": ""}
{"text": "Operating Systems:\t    Windows 2000/2003/XP"}
{"text": "Application:\t\t     PeopleSoft Financials , Peoplesoft HR,  PeopleCode, PeopleTools SQR, Visio"}
{"text": "Scripting Languages:\t     VBScript, JavaScript"}
{"text": "Testing Tools:\t\t     ALM, Quality Center and QTP"}
{"text": "Web Technologies: \t     ASP.NET, XML Web Services, XSL, XSLT, HTML, DHTML, XML, COM"}
{"text": "Database Products:\t     SQL Developer, SQL Server, Oracle "}
{"text": "Web Servers:                         IIS 5.0/6.0"}
{"text": "Version Management:        Visual Source Safe, CVS, TFS, Tortoise SVN"}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": ""}
{"text": "Pacific Life Insurance, Newport Beach, CA\t\t\t\t\t           April’16 - Present"}
{"text": "QA Lead"}
{"text": ""}
{"text": "Project Description: This project was to test the new functionality on PeopleSoft application. I was involved as QA Lead. My focuses of this project was Cash Management, Deal Management, AR, Banking and Financial Gateway."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Participated in Requirement Gathering for Cash Management, Deal Management and  Account Receivable."}
{"text": "Coordinated with Business Analysts, SMEs and Developers to understand all business workflows, applications, interfaces/sub systems ."}
{"text": "Reviewed/Analyzed customization requirements . "}
{"text": "Actively Participated in weekly Test Leads meetings to develop complete Test Execution Plan, Test Integration Plans, Dependencies, pre requisite deliverables."}
{"text": "Successfully Participated and completed weekly touch based meeting with Work Stream Lead to finalized decision related to Treasury Team."}
{"text": "Prepared Detailed Test Scenarios, Test Plan, Test Execution Plans, Test Cases and Test Scripts by analyzing business requirement documents and functional requirement documents ."}
{"text": "Supported and helped in AIT by preparing scripts, setting up labs and facilitating Daily Triage meetings."}
{"text": "Extensively involved in Functional testing, Integration testing, Security testing and Regression Testing."}
{"text": "Wrote and executed SQL Queries and validated test results."}
{"text": "Coordinated with modules AP, GL, ETP, DRG, DRM,OBIA etc. to prepare plan and fix defects."}
{"text": "Attended Daily Defect Review and Defect Status meetings . Provided updates to Team  on testing activities."}
{"text": "Participated in Daily morning and Triage meeting during QA testing ."}
{"text": "Supported and Coordinated UAT testing with end user Business teams ."}
{"text": "Coordinated all phases of testing including test plan creation, Test Data Sheet preparation, script creation, execution and re-testing ."}
{"text": "Coordinated with the user and technical team in identifying and resolving defects in customizations ."}
{"text": "Created and executed security related Test Scripts."}
{"text": "Involved in testing and validation of Row level Security, Role Level Security and DDM(Dynamic Data Masking)Security."}
{"text": "Helped and facilitated in Business Process Testing."}
{"text": "Contributed and improved QA process, procedures and methodologies."}
{"text": "Managed QA scope to ensure deliverables and achieved within agreed upon time, cost and quality parameters."}
{"text": "Proactively managed and highlighted risks and provided mitigations."}
{"text": "Contributed QA tasks to the project plans that meet overall project objectives and timelines ."}
{"text": ""}
{"text": ""}
{"text": "Citizens Property Insurance, Tallahassee, FL                                             \t                               July’14 – Mar’16"}
{"text": "QA Analyst/Data Analyst"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Implement and deploy PeopleSoft Financials applications, including cash management and deal management modules, for this leading software-consulting firm."}
{"text": "Design, develop, test, document, and deploy PeopleTools, PeopleSoft Internet Architecture, and related components."}
{"text": "Developed the complete Test documents like Test Plan, Test Cases and Test Scripts by analyzing Business requirement documents and Use cases ."}
{"text": "Prepared Requirement Traceability Matrix (RTM), Test Status reports and Test Sign off  documents."}
{"text": "Involved with project backlogs and sprint backlogs ."}
{"text": "Extensively involved in System testing / Functional, Regression testing and Integration testing"}
{"text": "Wrote Complex SQL queries and PL/SQL subprograms to support the test case results, SQL performance tuning."}
{"text": "Performed Negative testing using Informatica to find how the workflow performs when it encounters invalid and unexpected values."}
{"text": "Involved in test management and defect management using Quality Center and TFS ."}
{"text": "Performed Database (metadata) validation before loading the data into the target tables ."}
{"text": "Performed Data Validation by testing the delta/daily and reconcile/data loads. "}
{"text": "Created SQL compare statements to validate Actual results with the Expected Results and written complex SQL queries for validating Cognos Reports. "}
{"text": "Tracked and executed the User Acceptance Test Cases (UAT) with respect to the requirements to determine the feature coverage."}
{"text": "Using Load Runner, execute multi-user performance tests, used online monitors, real-time output messages."}
{"text": "Preparation and execution of test scripts using JMeter and SOAP UI tool to perform Web Services testing."}
{"text": "Involved in validating SSIS and SSRS packages according to functional requirements ."}
{"text": "Involved in testing Stored Procedures, Functions, Triggers and packages utilizing PL/SQL . "}
{"text": "Worked on Autosys for Batch Processing ETL, PL/SQL subprograms and performed backend testing."}
{"text": "Verified ETL logs, reject/discard files for errors, and reported them to development team."}
{"text": "Worked with Synchronization, Data Table and Descriptive Programming, in QTP integrated environment"}
{"text": "Worked on Informatica Workflow Manager to run the workflows and monitored the status and logs in Workflow Monitor."}
{"text": "Extensively tested Cognos reports for static/cosmetic errors like header, footers, logos, fonts etc that may appear in all pages of the reports ."}
{"text": "Performed Backend database testing, by executing the Group functions, complex Joins and sub queries ."}
{"text": "Validated the data moving from multiple sources to target using Informatica data validation option ."}
{"text": "Estimated level of effort (LOE) for testing effort and reported to Test Leads."}
{"text": "Performed Quality Assurance activities for data validation, data scrubbing, data profiling ."}
{"text": "Created shell scripts and used Unix commands to manipulate input files for test execution"}
{"text": "Created test data for all ETL mapping rules to test the functionality according to requirements."}
{"text": "Ensured quality products delivered and installed as specified in the statement of work (SOW)."}
{"text": "Attended Bi-Weekly Defect Review and Defect Status meetings . Provided updates to Team Lead on testing activities. "}
{"text": ""}
{"text": ""}
{"text": "Wells Fargo, Greenwood Village, CO\t\t\t\t\t\t             May’13- June’14"}
{"text": "QA Analyst/Tester"}
{"text": ""}
{"text": "Wells Fargo is a Banking sector which services its customers belonging to the various Business units, Bankcards/Card, Services/Mortgage, Origination/ Mortgage, Servicing/Phone, Bank/Wires/Consumer, Credit Group/Debit Card, Operations/ Education, Finance/Private Client, Services/WF, Insurance/Wholesale groups etc . by authenticating using Account numbers, SSN & PIN/TIN through the IVR systems,  route the calls to the Bankers based on the request sent by the Customer through the Network routing & Enterprise level routing through CTI and Screen Pops on the Agent Desktops to answer their queries and help them in day to day transactions  ."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Working on Wachovia credit card conversion project and supporting multiple applications like OLM, MM IVR and CCIVR."}
{"text": "Preparing a Test Plan as per the requirement/Specifications ."}
{"text": "Supervised application design and architecture components of various PeopleSoft Financial Management projects for this professional services company ."}
{"text": "Liaised with clients in various industries for requirements and input to Architect PeopleSoft solutions, such as accounts payable/accounts receivable (AP/AR), general ledger (GL), and asset management."}
{"text": "Developed and tested detailed functional designs for business solution components and prototypes."}
{"text": "Used Quality Center for Test management and Defect Tracking ."}
{"text": "Supporting and testing multiple applications individually."}
{"text": "Manually executed the test cases and used Rational Clear quest to open defects."}
{"text": "Working on multiple projects like Rewards, BCTC and command plastic .  "}
{"text": "Reviewing FSD and BRD documents to prepare test plans and test scripts."}
{"text": "Performing complex analysis of business requirements and system analysis ."}
{"text": "Performing data conditioning, regression testing and test validations."}
{"text": "Testing contract management application which was developed in .Net"}
{"text": "Analyzing the business requirements, specifications, creating and executing Test plans, Test cases and Test Scripts ."}
{"text": "Estimated time lines for testing the entire Call flows ."}
{"text": "Created test scenarios and test cases based on vision flows, call flows and flow charts."}
{"text": "Analyzing the specifications and communicating the spec-related issues to the client."}
{"text": "Involved in high-level meetings with Project Manager, Business Analysts, Developers and all other team members to resolve issues ."}
{"text": "Attending the regular client call and discuss weekly status with the client"}
{"text": "Checked for timely delivery and different milestones"}
{"text": "Motivate team members "}
{"text": "Checked for timely delivery and different milestones and motivate team members"}
{"text": "Produce Test Scripts in such a form that they can be used by trained users during UAT and signed-off with results recorded"}
{"text": "Performed compatibility testing with different vendors"}
{"text": "Extensively involved in Regression Testing"}
{"text": "Determined security issues and proposed technical solutions"}
{"text": "Wrote test cases for defined security requirements and build test cases"}
{"text": "Validated Authentication, Account Balance, Account History, Transfer Funds and Switch Accounts"}
{"text": "Automated the MORTIMER Scripts (API Tool)  using QTP"}
{"text": "Wrote VB Script, developed Custom Functions, Dictionary Objects, and used Descriptive Programming by using QTP."}
{"text": "Diagnosed and resolved technical issues and in internal resources"}
{"text": "Created CTI test cases and test scenarios according to business rules"}
{"text": "Validated data using HOGAN and CIV"}
{"text": "Worked with various mainframes and disturbed processing platforms like AS/400, OS/390, PCs, Novell and other remote access security products."}
{"text": ""}
{"text": ""}
{"text": "First Bank, Phoenix, AZ\t\t\t\t\t\t\t                           Aug’12 - April’13"}
{"text": "Quality Analyst"}
{"text": "\t         "}
{"text": "Project Description: The current application is a part of online banking that a customer leverages to set up his e-bills payment as well as inter account transfers. This project was developed using ASP.Net with the SQL Server. This project is to maintain all kind of activities like bank, electrical, house tax and other transactions using e-bill payment."}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Wrote test cases for each page in different modules for e-bill pay system ."}
{"text": "Created and implemented testing process for Agile methodology"}
{"text": "Conducted Usability Testing against requirements using QTP"}
{"text": "Created QTP / Quality Center automation framework with extensive VB script coding, and updated / maintained it. "}
{"text": "Used Device Anywhere, executed multi-user performance tests, used test suites, scheduler and other features of the Device Anywhere. "}
{"text": "Prepared test scripts, test logs and bug reports using QTP and Quality Centre."}
{"text": "Checking the functionalities and test under various environments on web and made a comparative analysis."}
{"text": "Conducted manual testing for new products and current applications "}
{"text": "Working on mobile technologies including GSM, CDMA"}
{"text": "Participation in creation of test plans, Creating test cases & bug reports ."}
{"text": "Managing, analyzing, and maintaining test cases."}
{"text": "Performed Database Validation Testing using complex SQL queries using Inner/Outer joins ."}
{"text": "Checking for the code standard as per client requirement "}
{"text": "Coordinating with the team in allocating the work and reviewing the test & defect reports ."}
{"text": "Fully integrated with Quality Center for Test Management activities, Report creation, created separate test sets for each release based on the severity ."}
{"text": "Performed regression testing on web and Android devices ."}
{"text": "Played an active participant role in testing of the sync applications to identify more defects . "}
{"text": "Preparation of defect report and test summary report ."}
{"text": ""}
{"text": ""}
{"text": "Jefferson County Health Department, Louisville, KY\t\t\t\t         March’10 - July’12"}
{"text": "QA Tester\t\t\t\t   \t  \t\t"}
{"text": ""}
{"text": "Jefferson County is one of the largest populated counties of Kentucky State. The project's scope was to develop an efficient system to handle immunization of adults and children for the health department. Oracle 8i database, forms and reports were used in the project. Manual quality assurance testing was performed. "}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Analyzed business requirement documents, technical specification documents, user interface requirements to develop test scenarios"}
{"text": "Mapping requirements to high-level test scenarios and test cases ."}
{"text": "Logged the test scenarios into Quality Center ."}
{"text": "Conducted release based integrated and functional testing"}
{"text": "Using self joins and primary and foreign keys developed SQL quires, provided data for team members."}
{"text": "Delivered VB scripts using Quick test Professional by creating BPT\\'s (business process testing)"}
{"text": "Ran nightly process in UNIX environment and processed send and received that are send and received from trading partners."}
{"text": "Validated data populated in various send/receive files using storyboards and intended business logics."}
{"text": "Reported defects and re-tested after the fix is delivered for testing."}
{"text": "Reported for re-occurrences of functional defects and initiated root cause analysis."}
{"text": "Helped team leads in prioritizing QC defects by severity and criticality of nonconformance"}
{"text": "Reported Defects using Quality Center 9.0"}
{"text": "Conducted regression testing on various functional modules to make sure that new code of bug fixes have not adversely affected ."}
{"text": "Helped in UAT testing"}
{"text": ""}
{"text": ""}
{"text": ""}