{"text": "Name: esther esther"}
{"text": "E-Mail: esther.esther@gmail.com"}
{"text": "Address: Weifang, China"}
{"text": "Github: https://github.com/esther"}
{"text": "LinkedIn: https://linkedin.com/esther"}
{"text": "Phone No. 978264151950"}
{"text": ""}
{"text": "Professional Summary"}
{"text": ""}
{"text": "Network Security Engineer with experience in testing, troubleshooting, implementing, optimizing and maintaining enterprise data network and service provider systems."}
{"text": "Strong hands on experience on Cisco Catalyst (3550, 3750, 6500) series switches, Cisco (2500, 2600, 2800, 3600, 3800, 7200) series Routers, ASA Firewall, Blue Coat Proxy SG, Load Balancers using Cisco ACE, F5 LTM/GTM, Tufin  Solar Winds, Sniffer, Check Point,  Palo Alto Networks Firewall models."}
{"text": "Primarily worked on Checkpoint Security Gateways running R77, R76, and R75 Gaia and Fortinet Firewalls running Forti OS 5.2. "}
{"text": "Configured IDS/IPS on Cisco, Checkpoint and Fortinet Firewalls"}
{"text": "Creating VPN tunnels per request via JUNOS, SCREENOS or Fortinet Firewalls."}
{"text": "Working knowledge of frame relay, MPLS services, OSPF, BGP and EIGRP routing protocols, NATing, NAC product sub-netting, also including DNS, LDAP, DHCP, http, HTML, HTTPS, TCP/IP, UDP, SNMP, OSPF, RIP, IPSEC, PPTP, VLAN, STP, RTSP & Multicasting protocols."}
{"text": "Experience in layer-3 Routing and layer-2 Switching. Dealt with Nexus models like 9K,7K, 5K, 2K series."}
{"text": "Have In-depth knowledge of deploying and troubleshooting LAN, WAN, Frame-Relay, Ether-channel, IP Routing Protocols - (RIP, OSPF, EIGRP & BGP), ACL's, NAT, VLAN, STP, VTP, HSRP & GLBP."}
{"text": "Proficient in Cisco IOS for configuration & troubleshooting of routing protocols: MP-BGP, OSPF, LDP, EIGRP, RIP, BGP v4, MPLS, switching (VLANS, VTP Domains, STP, and trunking)."}
{"text": "Well experienced in configuring protocols HSRP, GLBP, VRRP, ICMP, IGMP, PPP, HDLC, PAP, CHAP, and SNMP."}
{"text": "Working experience on Blue Coat Proxy SG to safeguard web applications."}
{"text": "Performs Tier III network support for enterprise network and solves escalated ticket issues to include Bluecoat proxy rule additions and Cisco firewall issues"}
{"text": "Provided administration and support on Bluecoat Proxy for content filtering and internet access to primary, remote site offices and VPN client users."}
{"text": "Experience with Blue Coat URL filtering with whitelisting and blacklisting URL, creating rules for content filtering."}
{"text": "Utilized the Blue Coat Proxy, SIEM, SOC, Tuffin, IPS/IDS."}
{"text": "Provided administration and support on Bluecoat Proxy for content filtering and internet access to primary, remote site offices and VPN client users."}
{"text": "Ability to work under minimal supervision, adheres to deadlines, and motivated to excel. Strong Knowledge of office365 and Office Tools such as Microsoft Word, PowerPoint, Excel and Visio."}
{"text": "Experience in CheckPoint IP Appliances R65, R70, R75, R77 & Cisco ASA Firewalls."}
{"text": "Provide L3 support for checkpoint and Palo Alto firewalls."}
{"text": "Involved in the integration of F5 Big-IP load balancers with CheckPoint firewalls for firewall load balancing and was responsible was troubleshooting and maintenance."}
{"text": "Experienced in Migration from Checkpoint and Cisco ASA Firewalls to Palo Alto."}
{"text": "Experience with Juniper NetScreen 520M Firewall and Palo Alto network firewall."}
{"text": "Involved in configuring Juniper SSG-140, SRX-240, and Cisco ASA 5585."}
{"text": "Experience in configuring all Palo Alto Networks Firewall models (PA-2k, PA-3k, PA-5k etc.) as well as a centralized management system (Panorama) to manage large scale firewall deployments."}
{"text": "Worked on configuration of Palo Alto firewalls including Security policies, Application & URL filtering, Data filtering, Threat prevention and File blocking. "}
{"text": "In-depth knowledge in designing, implementing, configuring with best practices on NexGen IDS/IPS Firewalls such as Palo Alto, Cisco Firepower (Sourcefire)."}
{"text": "Handling Break/Fix situations, monitor, configure, policy creation on Checkpoint's Smart Center Server."}
{"text": "Monitoring Checkpoint Firewall traffic through Smart Dashboard and Smart View Tracker applications."}
{"text": "Installation and administration of Checkpoint R 75.40 Firewall."}
{"text": "Implemented firewall policy change on the Checkpoint clusters."}
{"text": "Verified and Validated the Firewall policy on Checkpoint R75 clusters for unused rule and helped consolidating rule"}
{"text": "Deployed Site to Site and Client to Site VPNs utilizing Checkpoint Firewall-1/VPN-1"}
{"text": ""}
{"text": "   Education"}
{"text": ""}
{"text": ""}
{"text": "Technical Skill Set"}
{"text": ""}
{"text": "Router & Switch platforms: Cisco Router (3900, 3600, 2800, 2600, 2500, 1800 series) & Cisco Catalyst switches (6500, 4900, 3750, 3500, 4500, 2900, 6807 series), Nexus 7K, 5K, 2K & 1K. "}
{"text": "Networking Concepts: Access-lists, Routing, Switching, Subnetting, Designing, CSU/DSU, IPSec, VLAN, VPN, WEP, WAP, MPLS, VoIP, Bluetooth, Wi-Fi."}
{"text": "Firewalls: Cisco ASA, Cisco Umbrella, Fortinet, Palo Alto Networks (PA-2K, PA-3K and PA-5K), Cisco IDS/IPS SourceFire, CheckPoint (NGX, R65, R70, R77 and R71), Juniper (SRX, MX, EX Series Router and Switches)"}
{"text": "Various features and tools : Microsoft Office Suite, Microsoft Visio, Riverbed, Solar winds, Tufin, Microsoft VPN, HP NNMi 8xi (Network Node Manager), Net flow and Cisco prime, Ethereal / Wireshark, TCP Dump, NAC, Cisco DCNM, Firemon, MS-VISIO, Infoblox"}
{"text": "Load Balancers: F-5 BIG-IP LTM 2000, 3900, 5000, 6400, 6800 AND 8900, Bluecoat SG8100, AV 510. "}
{"text": "WAN technologies: Frame Relay, ISDN, ATM, MPLS, leased lines & exposure to PPP, DS1, DS3, OC3, T1 /T3 & SONET. "}
{"text": "LAN technologies: Ethernet, Fast Ethernet, Gigabit Ethernet, & 10 Gigabit Ethernet, Port-channel, VLANs, VTP, STP, RSTP, 802.1Q ."}
{"text": "Security Protocols: IKE, IPsec, SSL, AAA, Access-lists, prefix-lists, SSL-VPN. "}
{"text": "Networking Protocols: RIP, OSPF, EIGRP, BGP, STP, RSTP, VLANs, VTP, PAGP, LACP, MPLS, HSRP, VRRP, GLBP, TACACS+, Radius, AAA, IPv4 and IPv6. "}
{"text": "Operating System: Cisco IOS, Windows NT 4.0 (Desktop/Server), Windows 2000/2003/2008 Server, Windows XP/Windows 7/8, LINUX, UNIX, MS Exchange server, Solaris, Active Directory."}
{"text": ""}
{"text": ""}
{"text": "Professional Experience "}
{"text": ""}
{"text": "Optum, MA\t\t\t\t\t\t\t\t\t\t\tFeb. 2017- Present  "}
{"text": "Sr. Network Security Engineer \t\t\t"}
{"text": ""}
{"text": "Configuration and troubleshooting of Site to Site as well as Remote Access VPN on Cisco ASA and Checkpoint firewalls."}
{"text": "Proficient in researching traffic patterns to identify false-positives and/or malicious traffic within IDS (Intrushield, TippingPoint, etc), IPS (Snort), proxy (Bluecoat) and firewalls (CheckPoint, ASA, PIX, and Netscreen)."}
{"text": "Converted Checkpoint VPN rules over to the Cisco ASA solution. "}
{"text": "Migration with both Checkpoint and Cisco ASA VPN."}
{"text": "Created and manage VPNs for managed service clients including medical community on Cisco, Netscreen and Fortinet Cisco PIX VPN devices "}
{"text": "Responsible for Design and Implement Security, Network and Monitoring System Infrastructure utilizing Fortinet Technology for customers"}
{"text": "Working experience on Blue Coat Proxy SG to safeguard web applications."}
{"text": "Performs Tier III network support for enterprise network and solves escalated ticket issues to include Bluecoat proxy rule additions and Cisco firewall issues"}
{"text": "Provided administration and support on Bluecoat Proxy for content filtering and internet access to primary, remote site offices and VPN client users."}
{"text": "Experience with Blue Coat URL filtering with whitelisting and blacklisting URL, creating rules for content filtering."}
{"text": "Worked on Blue Coat proxy SG to safeguard web applications in extremely untrusted environments such as guest Wi-Fi zones. "}
{"text": "Performing URL filtering and content filtering by adding URL's in Bluecoat Proxy SG's. "}
{"text": "Design, Build and Implement various solutions on F5 Load balancers and F5 Global Traffic Managers (GTM), Check Point Firewalls, Blue Coat Proxies."}
{"text": "Install and upgrade Bluecoat proxy SG (900, 810 and SG9000 series) and Proxy AV (510,810 and 1400series) in Datacentre environment with hands on experience on inspection, data loss prevention, content caching and bandwidth management using Blue Coat proxy."}
{"text": "Support Blue Coat proxy in the explicit mode for users trying to access the Internet from Corp Network. "}
{"text": "Troubleshooting connectivity issues through Bluecoat as well writing and editing web policies. "}
{"text": "Involved in Upgrading Bluecoat proxy servers from SG900-10s to SG 9000-20B"}
{"text": "Deployed Bluecoat Packet Shaper to prioritze internet traffic and optimize WAN bandwidth at several remote offices."}
{"text": "Used Bluecoat Proxy SG Appliances to effectively secure Web communications and accelerate delivery of business applications."}
{"text": "Deployment and Management of Bluecoat proxies in forward proxy scenario as well as for security in reverse proxy scenario."}
{"text": "Responsible for managing and operating Cisco ASA Firewalls, Juniper firewalls, Fortinet Firewalls, and Netscaler Load-Balancers to provide secure and robust connectivity for many appliances"}
{"text": "Administration, maintaining, and performance of all network based hardware, such as Avaya switches, Juniper, Palo Alto, JUNOS, SCREENOS, Fortinet Firewalls, Asterisk VoIP systems, Switchbox, and Windows DHCP servers."}
{"text": "Strong experience in Network security using ASA Firewall, Checkpoint, Palo Alto, Juniper, Cisco sIDS/IPS and IPSEC/SSL VPN, F5 Load Balancer. "}
{"text": "POC for any VPN issues on F5 and Checkpoint. "}
{"text": "Lead in deploying new technologies to data center and branch offices including firewall, NAC, wireless and switching technologies."}
{"text": "Implemented firewalls using Cisco ASA, Cisco PIX, Checkpoint Provider-1 /SiteManager-1 NGX R65, Firewall-1/VPN-1 NGX R65 Gateways, Secure Platforms."}
{"text": "Design, Build and Implement various solutions on F5 Load balancers and F5 Global Traffic Managers (GTM), Check Point Firewalls, Blue Coat Proxies."}
{"text": "Configure all Palo Alto Networks Firewall models and Panorama to manage large scale Firewall deployments "}
{"text": "Implemented Zone Based Firewalling and Security Rules on the Palo Alto Firewall."}
{"text": "Perform Checkpoint and PIX firewall/IDS design, integration and implementation for Cyber Trap client networks."}
{"text": "Managed corporate Checkpoint and Cisco firewalls for DMZ and remote access gateways."}
{"text": "Experience in using Smart Update, User Identity Management and Authentication in CheckPoint Firewall."}
{"text": "Experience in Configuring, maintaining and troubleshooting IPS and IPS1 in CheckPoint."}
{"text": "Responsible for Checkpoint and Cisco ASA firewall administration across our global networks."}
{"text": "Working on setup Cisco ASA 5555-X firewall on IPsec VPN, Palo Alto IPsec VPN and Global Protect VPN, and AWS VPN solution."}
{"text": "Environment: Cisco switches and Cisco routers Cisco ASA, Checkpoint, F5 Load Balancer, Fortinet, Bluecoat, Juniper, Palo Alto, Cisco Nexus 7K/6K/5K, MPLS, Microsoft Office Suite, Microsoft Visio, Riverbed, VPN, SIEM, Linux, Forcepoint, Microsoft VPN, Firepower, FireEye, Infoblox, Wireshark"}
{"text": ""}
{"text": "   Comcast, Denver, Colorado\t\t\t\t\t\t\t\t\tDec. 2015- Jan.2017  "}
{"text": "   Network Security Engineer \t\t\t\t\t\t\t\t\t "}
{"text": "\t\t\t\t                                                                       \t "}
{"text": "Primary responsibility for the Core Security of the Network. Managing the entire Network Security Products deployed in the network such as CheckPoint (GAIA R75.40/77.20), Cisco ASA (5510/5520/5550)"}
{"text": "Experience with convert Checkpoint VPN rules over to the Cisco ASA solution and worked on RSA"}
{"text": "Troubleshoot and hands on experience on security related issues on Cisco ASA/PIX, CheckPoint and Palo Alto Firewalls."}
{"text": "Configure all Palo Alto Networks Firewall models and Panorama to manage large scale Firewall deployments"}
{"text": "Working experience on Blue Coat Proxy SG to safeguard web applications."}
{"text": "Performs Tier III network support for enterprise network and solves escalated ticket issues to include Bluecoat proxy rule additions and Cisco firewall issues"}
{"text": "Provided administration and support on Bluecoat Proxy for content filtering and internet access to primary, remote site offices and VPN client users."}
{"text": "Experience with Blue Coat URL filtering with whitelisting and blacklisting URL, creating rules for content filtering."}
{"text": "Deployment and Management of Bluecoat proxies in the forward proxy scenario as well as for security in reverse proxy scenario. "}
{"text": "Worked on Blue Coat proxy SG to safeguard web applications in extremely untrusted environments such as guest Wi-Fi zones. "}
{"text": "Performing URL filtering and content filtering by adding URL's in Bluecoat Proxy SG's. "}
{"text": "Design, Build and Implement various solutions on F5 Load balancers and F5 Global Traffic Managers (GTM), Check Point Firewalls, Blue Coat Proxies."}
{"text": "Involved in configuration of access-control lists on Juniper and Palo Alto firewalls for proper network routing and B2B connectivity. "}
{"text": "Implementing security Solutions using Palo Alto PA 5000, Check Point Firewalls R75, R77.20 Gaia and Provider-1/MDM."}
{"text": "Upgraded the data centre network environment with Cisco ASA 5520. Configured ACL's on Cisco Switches as well as configured routers as terminal servers."}
{"text": "Responsible for installation, troubleshooting of CheckPoint firewall and LAN/WAN protocols."}
{"text": "Configuring VPN, clustering and ISP redundancy in CheckPoint firewall. "}
{"text": "Successfully Setting up Checkpoint firewall systems in multiple locations, with IPS, Mobility and Web Content filtering blades. "}
{"text": "Performed routine monitoring of Checkpoint firewall from security perspective and troubleshooting the connectivity issues. "}
{"text": "Work on CheckPoint Platform including Provider Smart Domain Manager "}
{"text": "Worked on configuring, managing and supporting CheckPoint Gateways "}
{"text": "Regularly performed firewall audits around CheckPoint Firewall-1 solutions for customers"}
{"text": "Involved in configuring Checkpoint (R77) Firewall rule base and objects as per the requirements."}
{"text": "Troubleshooting checkpoint firewall connectivity related issues using Smart view tracker."}
{"text": "Experience in reviewing and recertification of rule sets and involved in creation, validation and maintenance of enterprise check point (R77.30) firewall policies."}
{"text": "Implemented antivirus and web filtering on Juniper SRX 240 at the web server as well as configuration of F5 Big-IP LTM 6400 load balancers and experience working with F5 technologies (LTM, GTM, APM, V9, V10, V11)."}
{"text": "Managed the F5 BigIP GTM/LTM appliances to include writing iRules and everyday tasks of creating WIP and VIPs. "}
{"text": "Worked on F5 BIG-IP LTM 8900, configured profiles, provided and ensured high availability"}
{"text": "Configured ACL's in Cisco 5520 ASA firewall for internet Access requests for servers, Protocol Handling, Object Grouping and NAT. "}
{"text": "Environment: Cisco Routers, Cisco Switches, Nexus 5k/2k, BlueCoat, Checkpoint, F5, Load Balancer, Cisco Umbrella, Fortinet, Cisco ASA (5510/5520/5550), Palo Alto, Linux, Microsoft Office Suite, Microsoft Visio, Riverbed, Infoblox, Wireshark, Microsoft VPN, Forcepoint, Juniper SRX."}
{"text": ""}
{"text": "Robek software systems, India"}
{"text": "Jr. Network Engineer \t\t\t\t\t\t\t\t\t\tJun. 2010- Jul.2015  "}
{"text": "                                                                      "}
{"text": "Responsible for the configuration of Cisco Routers (4000, 2500, 3000, 2600) using RIP, OSPF, EIGRP, BGP"}
{"text": "Managed office network with Cisco devices with network devices including 2500 and 3600 series routers and 3500, 2900, 1900 series switches"}
{"text": "Analyzed and resolved a high percentage of initial customer contact in the areas of PC/LAN."}
{"text": "Dealt with customer problems to management and support groups utilizing standard escalation model."}
{"text": "Extensive experience in configuring and implementing OSPF and BGP."}
{"text": "Supported core network consisting of Cisco 7200 series routers running multi area OSPF."}
{"text": "Configured EIGRP and OSPF as interior gateway protocol with route filtering and route redistribution, installed and maintained Cisco 3600, 2600 and 7200 backbone routes with HSRP."}
{"text": "Provided administration and support on Bluecoat Proxy for content filtering and internet access to primary, remote site offices and VPN client users."}
{"text": "Experience with Blue Coat URL filtering with whitelisting and blacklisting URL, creating rules for content filtering."}
{"text": "Implemented stub/Totally stub areas and various OSPF features like route-summarization and SPF throttling."}
{"text": "Hands-on experience with WAN technologies like T1/T3, DS3, STM1 and STM4 circuit types."}
{"text": "Configured Security policies including NAT, PAT, VPN, Route-maps and Access Control Lists."}
{"text": "Knowledge with redistribution of routing protocols and Frame-Relay configuration"}
{"text": "Handled Network Migration from RIP to OSPF."}
{"text": "Implementation of TCP/IP and related Services-DHCP/ DNS/ WINS."}
{"text": "Configured, maintained and troubleshot routing protocols such as OSPF, EIGRP and BGP."}
{"text": "Engaged in office moves, helped in identifying network requirements of new building, installed new networking hardware, and coordinated with vendors for cabling/wiring."}
{"text": "Performed troubleshooting, while maintaining trouble ticket tracking, following both internal/external routes."}
{"text": "Assisted with escalation procedures and customer notifications."}
{"text": "Configured Cisco Routers for OSPF, IGRP, RIPv2, EIGRP, Static and default route."}
{"text": "Upgraded Cisco Routers, Switches and Firewall (PIX) IOS using TFTP."}
{"text": "Configured switches with port security and 802.1x for enhancing customers security."}
{"text": "Worked on the security levels with RADIUS, TACACS+."}
{"text": "Troubleshoot and Worked with Security issues related to Cisco ASA/PIX, Checkpoint, IDS/IPS and Palo Alto firewalls."}
{"text": "Utilized application groups, SSL decryption, IPS, antivirus, anti-spyware, URL filtering, NAT, VPN, and the Reporting features of Palo Alto."}
{"text": "Implemented Zone Based Firewalling and Security Rules on the Palo Alto Firewall."}
{"text": "Involved in configuring Checkpoint Firewall rule base and objects as per the requirements."}
{"text": "Troubleshooting checkpoint firewall connectivity related issues using Smart view tracker."}
{"text": "Experience in reviewing and recertification of rule sets and involved in creation, validation and maintenance of enterprise check point firewall policies."}
{"text": "Involved in the integration of F5 Big-IP load balancers with CheckPoint firewalls for firewall load balancing and was responsible was troubleshooting and maintenance."}
{"text": "Hands on Knowledge/experience on F5 load balancers, its methods, implementation and troubleshooting on LTMs and GTMs."}
{"text": "Environment: Cisco Routers, Cisco Switches, Routing protocols, Cisco IOS, BlueCoat, Checkpoint, Palo Alto, F5, Load Balancer, Cisco PIX, HSRP, VRRP, IPSEC, VPN, Microsoft VPN, QOS, MPLS, VLANS, VTP, RSTP, ACL, NAT, IDS/IPS, SIP, RTP, RADIUS, TACACS+, Nessus, NMAP, Wireshark."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}