{"text": "PROFESSIONAL SUMMARY:"}
{"text": "6 years of professional experience as a motivated .Net/ UI developer, working under pressure and deadlines to accomplish project objectives."}
{"text": "Able to analyze business requirements and formulate a design in both individual and team scenarios."}
{"text": " Experience in interacting with Clients and Users for gathering requirements."}
{"text": "Extensive design experience with web technologies HTML/HTML5, CSS/CSS3, Bootstrap, JavaScript, jQuery, Angular JS."}
{"text": "Strong experience in design of web-based applications using ASP.NET 4.5/4.0/3.5/2.0, C# 4.5/4.0/3.0/2.0, AJAX, Master Pages, Web Services, Windows services and Server Controls. Incorporated many rich, user friendly, responsive features in the application using Angular JS, BOOTSTRAP, and HTML5."}
{"text": "Experience hosting web applications in IIS, developing applications using the ASP.NET MVC."}
{"text": "Worked on C# and ADO.net for developing windows applications as well as developing the web applications using Language Integrated Query (LINQ)."}
{"text": "Proficiency in multiple databases like MySQL, ORACLE and MS SQL Server."}
{"text": "Ability to learn new frameworks, design patterns quickly and adapt. "}
{"text": "Experience in working with both Agile (Scrum Framework) and Waterfall Methodologies."}
{"text": "Hands on experience in C#.Net, Visual Studio.Net, ASP.NET, MVC, ADO.net, Web services, RESTAPI, SOAP, XML, WCF and Web API."}
{"text": "Experience with Azure to developing and deploying web applications in Cloud Environment"}
{"text": "Designed CSS for different browsers and worked on UML diagrams."}
{"text": "Proficient in writing Complex Database Queries, Creating Tables, views, Stored Procedures, Functions and Triggers."}
{"text": "Good experience working in Bootstrap UI, Silverlight, and HTML 5."}
{"text": "Developed internet/intranet applications using Xml Web Services and WCF (Windows Communication Foundation)."}
{"text": "Experience with Test Driven Development (TDD)"}
{"text": "Experienced in deploying and testing web applications on IIS 7.0/6.0."}
{"text": "Experience in securing web applications using ASP.NET authentication and authorization mechanisms"}
{"text": "Involved in leading many daily SCRUM meetings which establishes the context of daily goals of work."}
{"text": "Strong team builder having excellent analytical skills with capability to handle new technologies."}
{"text": "Solid skills for Management such as Communication & Time with good team skills for improving the intention to work in fast paced environment."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "TECHNICAL SKILLS:"}
{"text": ""}
{"text": "ACADEMIC PROFILE"}
{"text": "Springfield, IL                     University of Illinois at Springfield                 May 2017 "}
{"text": "Master’s in Computer Science\t                                                         GPA: 3.8"}
{"text": ""}
{"text": "WORK  EXPERIENCE:"}
{"text": "  CSG International, Chicago                       "}
{"text": "Software Engineer                              \t\t\t\t\t\t April 2018 – Till Date"}
{"text": "Responsibilities:"}
{"text": "Working on developing a C# .Net project, Ascendon and its solutions which supply backend billing capabilities for digital-media and IoT based solutions (i.e. Redbox, Disney, Formula One, Dish, AT&T etc.)"}
{"text": "Implemented and extensively used the Object-Oriented programming concepts in C#"}
{"text": "Working as a Developer within a cross functional agile team to develop new components within an environment using .NET, SQL Server, Elastic Search, Angular, Redux"}
{"text": "Using Microsoft SQL Server Profiler, Kibana, JMeter to performance tune and monitor slow running queries and processes."}
{"text": "Implemented and consumed Web Services using WCF."}
{"text": "Developed User Interactive Web pages using HTML5, CSS3 validations using JavaScript, Angular.js."}
{"text": "Developed Web API's to receive and send JSON messages and web services using WCF. "}
{"text": "Used Bootstrap styles extensively to get the right styling for the Web Pages"}
{"text": "Worked with JIRA, Confluence to resolve defects and implement enhancements"}
{"text": "Working with SQL Server and Elastic search to persist and cache data"}
{"text": "Working on implementing feature requests for Ascendon in C# and to resolve defects"}
{"text": "Developing automation scripts to optimize various processes involved throughout the project lifecycle."}
{"text": "Wrote NUnit Unit Tests and Spec flow/Gherkin tests to cover unit testing prior to deployment."}
{"text": "Perform automated tests, unit tests (NUNIT) and customized load testing for the overall system and the custom API specifically using tools such as JMeter etc."}
{"text": "Communicate effectively with the scrum master, product owners and business stakeholders/end clients and fellow team members to facilitate understanding of deliverables, prioritization, and required effort."}
{"text": ""}
{"text": "Environment: .Net Framework 4.7/4.5/4.0, Visual Studio 2017, C#, SQL Server 2016, AJAX, JavaScript, Confluence 2018, NUnit, IIS, LINQ, HTML, CSS, jQuery, Kibana, Bootstrap, Bamboo, GitHub."}
{"text": ""}
{"text": "Credit Suisse, Raleigh, NC \t\t   "}
{"text": "Software Developer   \t            \t\t\t\t\t\t\tJune 2016 - March 2018"}
{"text": "Responsibilities:"}
{"text": "I was involved in the complete software development life cycle (SDLC) and developed User Interfaces using ASP.NET MVC and C#.NET."}
{"text": "Coordinate with business users in gathering business requirements, designing and programming the application according to the requirements and translating them to technical specifications"}
{"text": "Demonstrate a good understanding of object oriented design patterns, principles and frameworks used for web application development."}
{"text": "HTML, JavaScript, jQuery, CSS3 for front-end development."}
{"text": "Integrated this application with a WCF service layer and Entity framework to enable transfer of data between the client and server."}
{"text": "Designed and developed Stored Procedures, Tables, Indexes, Triggers and Views, used SQL Server as the database."}
{"text": "Involved in implementation of Object-Oriented Concepts during the development. "}
{"text": "Extensively used ADO.NET objects such as Data Adapter, Data Reader, Dataset and Data View for reading/updating records in the database."}
{"text": "Involved in writing complex SQL Statements, Views and Stored Procedures, Indexes to validate data and ensure system integrity and security Written LINQ functions for data access."}
{"text": "Participated in Unit testing of the application and wrote the test cases to test each of the application modules with the help of Nunit."}
{"text": "Worked with the QA team on a daily basis in fixing the reported bugs/defects."}
{"text": "Participated in various Client meetings with the team and the project manager to discuss improvements in the development of the application."}
{"text": "Involved in Scrum methodology and involved in daily sprint meetings."}
{"text": "Environment: Visual Studio 2015, C#, SQL Server 2016, AJAX, JavaScript, HTML, CSS, jQuery Bootstrap, Kibana, Bitbucket, Bamboo, SourceTree, Git, VMware."}
{"text": ""}
{"text": "Liquid Hub, India                                    "}
{"text": "Software Developer                          \t     \t\t\t\t\t    Jan 2015 - Dec 2015"}
{"text": "Responsibilities:"}
{"text": "Worked as developer in the team for design and development of application using Microsoft Visual studio with the ASP.Net 3.0, SQL Server 2008. "}
{"text": "The coding of the application was in C#/ASP.NET using an N-tiered architecture consisting of the presentation layer, data access layer and the database layer."}
{"text": "Implemented UI using ASP.NET, C#, .NET, VB.NET, MVC 4.0, HTML5, XML, JavaScript/TypeScript, React JS, Node JS, CSS3, Angular JS, Angular 2, AJAX, Bootstrap, Express and server controls."}
{"text": "Used Entity Framework and LINQ to Entities Connect to the Database and perform all the database transactions"}
{"text": "Extensively used java script for client-side validations"}
{"text": "Implemented form validation using JavaScript and Regular Expressions for validations in Registration page framework."}
{"text": "Used WPF of .NET for creating control templates and more appealing visual appearance."}
{"text": "Involved in writing SQL statements and stored procedures."}
{"text": "Implemented Web API Services for CRUD operations with HTTP verbs GET, POST, PUT and DELETE."}
{"text": "Used ADO.Net for creating and manipulating data access logic. "}
{"text": "Performed Unit Testing with the testing tool NUnit and involved in Unit test case, code review checklist preparation and validation."}
{"text": "Developed Agile Software Development methodologies to enable efficient and effective high-quality software development."}
{"text": "Provided maintenance and Production support to clients by fixing the issues."}
{"text": "Written and improved application technical documentation and provided knowledge transfer to team members."}
{"text": ""}
{"text": "Environment: Visual Studio 2010, ASP.Net 4.0, C#, SQL Server 2008, Ado.net, AJAX, JavaScript, HTML, CSS, Json."}
{"text": ""}
{"text": "Dev IT Solutions Pvt. Ltd, Hyd, India         "}
{"text": "Jr. Software Developer                  \t      \t\t\t\t\t       Jan 2013 - Dec 2014"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Developed the portal pages in ASP.Net using Master Page, Themes & skins to maintain the consistent look and feel throughout the application"}
{"text": "Customize the software according to client specifications by implementing new Custom Controls, using C#, WPF and MVC. "}
{"text": "Used WCF for inter communication between the applications using MSMQ for providing secure, reliable transport messaging queue."}
{"text": "Developed Web API's to receive and send JSON messages and web services using WCF. "}
{"text": "Produced content pages with CSS layout and style markup presentations and used JavaScript methods and properties"}
{"text": "Designed and implemented Data Grid Web Parts to display data from SQL Server 2008 database utilizing Business Data Catalog features."}
{"text": "Developed the Unit Test plans, created the scripts and executed Test cases using WinRunner."}
{"text": ""}
{"text": "Environment: .Net Framework 3.5, WCF, ASP.Net, ADO.Net, LINQ, MS Visual Studio 2008, IIS, Microsoft Office 2007, jQuery, WPF, MVC, Angular JS, JavaScript, CSS, SQL Server 2008, Windows."}
{"text": ""}
{"text": "TECHNICAL ACTIVITES"}
{"text": "Attended a two-day workshop on Big Data and .Net."}
{"text": "Participated in Paper Presentation on Cloud Computing conducted by MLRIT."}
{"text": "I have given a Paper Presentation on Cloud Computing and Security Challenges"}
{"text": ""}