{"text": "Name: clara clara"}
{"text": "E-Mail: clara.clara@gmail.com"}
{"text": "Address: Bogotá, Colombia"}
{"text": "Github: https://github.com/clara"}
{"text": "LinkedIn: https://linkedin.com/clara"}
{"text": "Phone No. 633725893519"}
{"text": ""}
{"text": "PROFESSIONAL SUMMARY:"}
{"text": "Over 6+ years of IT experience in Development of Business Applications and Solutions. "}
{"text": "Total 6+ years of experience in Designing, Developing and Administrating applications using BizTalk Server."}
{"text": "6+ years of experience in.Net Technologies C#, IIS. "}
{"text": "Extensive Integration experience includes integrating Mainframe(HIS), WCF-SQL, IBM-DB2, SharePoint, SSIS Packages, EDI systems, WCF-BasicHttp, SFTP, FTPS, SMTP, SFDC-Rest Services, Oracle, SAP, and (Schedule adapter). "}
{"text": "Good experience in using EDI transactions. "}
{"text": "Installed and configured BizTalk Server both on Single and cluster environment. "}
{"text": "Implemented various BizTalk design patterns such as Scatter-gather, Singleton, parallel convoy, sequential convoy, Aggregator, Message Broker, Splitter, Content based routing, dynamic routing, calling pipeline components from orchestration, Error handling. "}
{"text": "Good understanding of implementing Service-Oriented Architecture (SOA) using Windows Communication Foundation (WCF), Message Broker. "}
{"text": "Worked on various Advanced functions available in BizTalk that includes Table Looping, Scripting (XSLT, C#), Mass Copy functions, DB Lookup, Iteration , ( custom fantods) etc. "}
{"text": "Rigorously utilized Windows Communication Foundation (WCF), Defined Contract Definitions, Endpoint Definitions, Client, and Service. "}
{"text": "Implemented Enterprise SSO to store non windows based system credentials and sensitive information. "}
{"text": "Encrypted format. "}
{"text": "Hands on experience on Business Activity Monitoring (BAM), Enterprise Service Bus (ESB) and Business Rule Engine (BRE). "}
{"text": "Experience on ADO.NET objects such as Data Adapter, Dataset, and Data Reader to interact with databases like SQL Server & Oracle (ODP.NET) "}
{"text": "Responsible for installing the MSI packages in both QA and Production Environments. "}
{"text": "Implemented BizTalk Deployment framework (BTDF) "}
{"text": "Experience leading and mentoring a small team. "}
{"text": "Experience with Administration, Troubleshooting BizTalk applications. "}
{"text": "Used different tools for better maintenance of BizTalk like Message Box Viewer, Performance Analysis of Logs (PAL), and Ditching. "}
{"text": "Highly motivated with excellent analytical and communication skills, and an ability & enthusiasm to learn new systems and technologies. "}
{"text": "Ability to work independently with a high degree of personal initiative. "}
{"text": "Excellent testing, analysis, troubleshooting and problem-solving skills with attention to detail. "}
{"text": "Ability to quickly acclimatize to ongoing projects and complete the work in a timely manner."}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": ""}
{"text": "PROFESSIONAL EXPERIENCE:"}
{"text": ""}
{"text": "Evident Health, Richmond, VA                                                                                                 Aug, 2016 - Present"}
{"text": "Senior BizTalk developer and .NET Developer"}
{"text": ""}
{"text": "Responsibilities: "}
{"text": "Involved in all phases of Software Development Life Cycle SDLC including Requirement gathering, Design, Coding, Debugging, Testing and deployment. "}
{"text": "Good experience in installing and configuring BizTalk server 2013/2010, wife LOB adapter, adapter pack, HIS adapter, ESB Toolkit. "}
{"text": "Played Tech lead role, responsible for providing Proof of Concepts, delegating work to other resources and getting deliverables on time."}
{"text": "Practiced Water-fall, Agile (SCRUM) Software Development methodologies. "}
{"text": "Very strong experience in integrating BizTalk with mainframe (AS400), extensively used BizTalk HIS (Host Integration Server) adapter to call Cobol/CLP programs."}
{"text": "Experience in the Creating the ESB 2.1 Itineraries, implemented dynamic transformation using BRE Resolver. "}
{"text": "Integrated BizTalk with IBM-DB2 and implemented insert, update, delete and select operations with DB2. "}
{"text": "Interacted with legacy system and third party services to design and develop new interfaces. "}
{"text": "Worked on WCF-WebTop adapter to consume and expose JSON formatted REST services. "}
{"text": "Responsible for upgrading projects from BizTalk 2010 to 2013R2. "}
{"text": "Configured EDI Parties and Certificates for the Partner profiles."}
{"text": "Created X12 connections to receive both EDI and Non EDI files from external vendors. "}
{"text": "Extensively used SOAP UI while testing sales force (SFDC) REST services i.e. upset, login, delete methods "}
{"text": "Implemented automation of SSIS packages by using Message Broker design pattern of BizTalk. "}
{"text": "Build and maintain BAM Activities for different applications using BAM API's. "}
{"text": "Implemented batch jobs for both quarterly purge files, daily update files using WCF-SQL adapter and stored procedures. "}
{"text": "Experience with consuming and Publishing BizTalk Artifacts as WCF Services "}
{"text": "Upload/download files to Customer SFTP site using BizTalk software SFTP adapter. "}
{"text": "Implemented BRE using concepts such as Static class, handling repeated node in the message, calling .net components in BRE using RuleEngine.XMLHelper methods. "}
{"text": "Worked on Automating PGP Encryption and Decryption by using GNUPG software that involves generating our Public key, adding Customer key to our key ring. "}
{"text": "Thoroughly worked on SMTP adapter, implemented concepts such as HTML formatted emails, PDF attachments, dynamic and static SMTP adapter "}
{"text": "Created a traffic cop singleton orchestration that controls the execution of messages in FIFO fashion. "}
{"text": "Configured and set up App pools, web sites and creating self-sign certificates in IIS. "}
{"text": "Implemented aggregator Design pattern by using the combination of Sequential convoy and calling a send pipeline from orchestration. "}
{"text": "Created .net component that unzips the original file in a custom pipeline component. "}
{"text": "Used both Start Orchestration, Call orchestrations. "}
{"text": "Created Path Queries to Read and set values inside message Orchestration. "}
{"text": "Experience in using XSD.EXE tool Creating Serialized Classes using XSD Imports and Object based Mapping using serialized classes "}
{"text": "Utilized SSO configuration tool for storing and retrieving configuration data dynamically. "}
{"text": "Used BRE in the custom pipeline component to set the document schema for flat assembler at runtime using Fact Retriever. "}
{"text": "Applied advanced WCF techniques such WCF behavior at Send port to customize the SOAP header. "}
{"text": "Integrated SharePoint portal with BizTalk, so that business users can override actual threshold values. "}
{"text": "Generated pdfs using the FO.NET pipeline component and XSLT templates."}
{"text": "Invoked Various WCF Services Using WSHttp bindings with Fault Handling."}
{"text": "Consumed and Exposed JSON and XML formatted REST services in BizTalk. "}
{"text": "Used PowerShell scripts for administrative purpose such as 'start host instance’, resolve 'stop pending' state and send automated emails for suspended instances. "}
{"text": "Developed Microsoft SQL Server stored procedures and staging tables for pushing and pulling data to/from BizTalk. "}
{"text": "Developed custom pipeline component to extract and change the Data part of xml. "}
{"text": "Analyzed all the available logging mechanisms for BizTalk and Implemented CAT Framework to trace the run time functional flow. "}
{"text": "Handled exceptions in all BizTalk processes using common error handling orchestration for routing failure errors and configured process to send alerts to System Admins. "}
{"text": "Developed Test scripts for business users & coordinate with QA team to for end to end testing. "}
{"text": "Used WMI scripts for Host Management and Sending emails for suspended messages. "}
{"text": "Utilized BTDF scripts to implement automated deployment in multi server environment. "}
{"text": "Tracked the message instances and trouble shouted the problem as part of BizTalk Server Administration. "}
{"text": "Worked on Visio for designing various design documents in parallel to development. "}
{"text": "Involved in writing Technical Specs, Deployment Checklists for the Applications developed."}
{"text": "Involved in supporting the BizTalk applications that involves creating tickets, assigning priority for the tickets. "}
{"text": "Involved in TFS Architecture, Categorizing solutions into common components, BizTalk artifacts, .net components and other. "}
{"text": "Environment: EDI, WCF-WebTop, WCF Services, Host Integration Server, DB2, PGP, SFTP, WCF-SQL, FO.NET, TortoiseSVN , TFS, BizTalk 2010/2013 R2, VS 2012/2013, SQL Server 2012/2014, Share Point Server 2010"}
{"text": "Well Care, Tampa, FL\t                          \t\t\t                                              Oct, 2014 – Aug, 2016"}
{"text": "Senior BizTalk developer and .NET Developer"}
{"text": "Responsibilities:"}
{"text": "Analyzed request to provide accurate implementation time estimates, participated in solution design, functional and technical requirements documentation. "}
{"text": "Involved in installation and configuring of BizTalk Server 2010/2013 that includes adapter pack 2.0, BAM, ESB and SharePoint services. "}
{"text": "Performed EDI HIPAA transactions 837D, 837I, 837P in BizTalk 2010 "}
{"text": "Interacted with delivery team and clients to understand business requirements and Involved in deterring, how to best leverage technology to support those requirements in developing effective BizTalk solutions. "}
{"text": "Responsible for creating canonical schemas for EDI applications."}
{"text": "De-batching multiple EDI transactions and Created Parties & Agreement for trading partners."}
{"text": "Followed Agile Software Development methodology. "}
{"text": "Used BRE for formatting, validation of the messages and to check mandatory fields. Also Published and Deployed Rules into the Rule Engine Database. "}
{"text": "Created Custom Pipeline Components Decoder with .NET Encryption/Decryption Components. "}
{"text": "Worked on complex EDI maps, used most of the advanced functions, and wrote XSLT scripts, debugged maps. "}
{"text": "Performed integrations for both B2B and EAI transactions using WCF services. "}
{"text": "Published Schema as WCF Service for the external partners. "}
{"text": "Used both Network Monitor 3.4, Wire Shark to identify the issues at the application layer level. "}
{"text": "Developed XSLT for complex logic which was not possible using native BizTalk mapper tool. "}
{"text": "Developed orchestrations with error handling logic and worked on Partner ports, Direct and Dynamic binding in Orchestrations. "}
{"text": "Used both VMware, Virtual pc to create a BizTalk development machine. "}
{"text": "Implemented Composite operation in WCF-SQL adapter. "}
{"text": "Created new relationship with trading partners by enabling the exchange of EDI documents with the companies. "}
{"text": "Experience property schema with Context Property Base and Message Data Property Base. "}
{"text": "Experience in designing ESB itineraries. "}
{"text": "Developed .Net components and accessed from BizTalk Pipeline components, Orchestrations, Map. "}
{"text": "Deployed BizTalk exposed services in IIS and done unit testing using SOAP UI. "}
{"text": "Proficient in developing and deploying WCF Services to IIS. "}
{"text": "Used intercom tool to debug the complex pipeline components. "}
{"text": "Experienced with BizTalk 360 to analyze, monitor and debug business process. "}
{"text": "Created Canonical schemas and also complex Flat file schemas by setting both Positional and delimited values. "}
{"text": "Created Stored Procedures to retrieve and Insert data from and to Databases. "}
{"text": "Developed Enterprise Service Logging Application to Track transactions for .Net Interfaces using BAM API's. "}
{"text": "Used Rule engine deployment wizard for exporting and importing the policies. "}
{"text": "Worked with the almost all the shapes in Orchestrations. "}
{"text": "Implemented logging by logging messages from the orchestration flow to SQL database. "}
{"text": "Developed orchestration with untipped message type to accommodate future schema changes. "}
{"text": "Used Nun it to test the individual .net modules. "}
{"text": "Utilized Mozilla's Path tool (Fire path) to extract the path. "}
{"text": "Experience in creating flow diagrams using tools like Microsoft Visio, MS Word designer. "}
{"text": "Involved in Pre-cutover and Post-cutover activities for Go-Live from BizTalk perspective. "}
{"text": "Involved in 24 hour on call support and preparing issue resolution documents during warranty period. "}
{"text": "Involved in KT (Knowledge transfer) and reverse KT sessions while working with offshore team. "}
{"text": "Played BizTalk administrator role and be the single point of contact for deployments of new projects and upgrade of existing projects. "}
{"text": "Used Microsoft Team foundation server (TFS) for the purpose of version control and source code maintenance needs. "}
{"text": "Environment: - EDI/HIPPA 5010, BAM, BRE, Visio, TFS, BizTalk 2010, VS 2010/2012, SQL Server 2008/2012."}
{"text": "\t"}
{"text": "BCBS, Jacksonville, FL                                                                                                            Aug, 2012 – Sep, 2014"}
{"text": "BizTalk Developer/Administrator"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Involved in Full Software Development Life Cycle (SDLC) and identifying the requirements and defining the business rules to user requirements."}
{"text": "Involved in working with BizTalk native adapters like FILE, BAHS 2.0, WCF-SQL and SharePoint using Messaging, Orchestrations, Pipelines and Adapters. "}
{"text": "Involved in Integrating Mainframe System using the Host Integration Server (HIS), Transaction Integrator (TI). "}
{"text": "Developed Proof of Concept to demonstrate the capability of LOB SAP adapters using .Net Web Services. "}
{"text": "Migrated Maps from XslTransform class to XslCompliedTransform class for better performance and security. "}
{"text": "Developed BizTalk multi root node schemas to accept multiple message types through the same Interface and common Error schemas. "}
{"text": "Implemented BizTalk with ORACLE-DB by using both WCF-Oracle DB adapter approach and ODP.NET approach. "}
{"text": "Replaced the existing legacy SFTP and PGP components with new software 4.1 components."}
{"text": "Integrated BizTalk with SSIS packages by both using stored procedure route and calling .NET route. "}
{"text": "Developed XSLT for complex logic which was not possible using native BizTalk mapper tool. "}
{"text": "Used BAM (Business Activity Monitoring) to track the messages going through different systems. "}
{"text": "Worked on Automating PGP Encryption and Decryption, by generating our Public key, adding Customer key to our key ring, Encrypting and Decrypting using GNUPG software "}
{"text": "Created SSIS Packages for Data Movement and database maintenance. "}
{"text": "Created simple SSIS packages. "}
{"text": "Created simple SSRS reports and deployed in various environments. "}
{"text": "Performed bug fixes in XML to flat-file Maps for BizTalk server. "}
{"text": "Experience with T-SQL for writing Stored Procedures and modifying them. "}
{"text": "Worked with Entity Framework, Enterprise Library, and Log4net for logging and database calls. "}
{"text": "Documented my entire work to facilitate the knowledge transfer process to the clients. \n "}
{"text": "Environment:- Host Integration Server, SAML, Gung, X509, Single Sign-On (SSO), TFS, BizTalk2010, SQL Server 2008R2, VS 2008 Team Suite."}
{"text": ""}
{"text": ""}
{"text": "Apollo Hospitals, Hyderabad, INDIA                                                                                      Jun, 2011– Jul, 2012"}
{"text": "BizTalk and .NET Developer"}
{"text": ""}
{"text": "Responsibilities:"}
{"text": "Involved in Requirements Gathering, preparing Mapping Documents, Data Analysis. "}
{"text": "Maintained both BizTalk 2006R2, 2009 projects."}
{"text": "Developed automated B2B applications sending/receiving EDI files, which are converted to XML and imported in SQL Server thru stored procedures using SQL BizTalk Adapter. Also worked on other native adapters like FILE, HTTP, SMTP and WCF. "}
{"text": "Implemented a new EDI solution using Microsoft BizTalk "}
{"text": "Worked in both 32 bit and 64 bit environments. "}
{"text": "Use of Long Running and Atomic Transaction for consistency. "}
{"text": "Used ADO.NET Command & Connection Objects, Datasets, Data Adapters and Data Readers for Data Access Layer. "}
{"text": "Created and configured various Hosts, Host instances and adapter handlers as part of BizTalk Server Administration. "}
{"text": "Responsible for maintaining versions of code using Team Foundation Server (TFS). "}
{"text": "Environment:- EDI, BRE, SAML, Single Sign-On, WCF Services, TFS, BizTalk 2006R2/2009, VS 2008 Team Suite, SQL Server 2005/08."}
{"text": "\t"}
{"text": "EDUCATION"}
{"text": "B-Tech , JNTU, India"}
{"text": ""}